{
	"45745855000": "序：\n钝器击打头部的那一刻，哈利没有任何时间去反应。\n一下、接着又是一下——\n钝器击破了他的脑袋，他感觉全身的血液都从头部的破口处喷涌而出。\n随着钝器挥舞的方向，他应声倒下。\n鲜红的液体流淌了一地，也弄脏了掉落在地上的那一封情书，他的视线变得模糊，而在失去意识的最后一刻，他也没能看清楚前来赴约的那人是谁，只有一双黑色运动鞋在他的眼前不断地摇晃着。\n那人踩着那封信来到他的旁边，残留的血液从钝器上滴落，滴到了哈利的脸上，他半跪下来，用手帕擦拭掉了那张惨白脸上的那几滴血迹，而下一秒，他便朝哈利的脑袋挥下了致命的最后一击——\nChapter1\n①9月??日，星期三，??：??\n当哈利再次睁开眼睛时，他正躺在地毯上，一片漆黑的环境令他无法判断现在的他身在何处。哈利本能地用手护住了自己的脑袋，直到确定没有人在他附近徘徊后，他才敢去摸索着寻找自己的眼镜。\n狭窄的房间静悄悄的，只有疑似他人呼吸的声音环绕在他的周围，他不敢做出太大的动作，因为他担心那个袭击他的人此时此刻还躲在这个房间里默默地观察着他。\n但他这般胡乱地摸索并没有起太大的作用，他依旧没有找到眼镜还被迫摸了一手灰。混沌的脑子令他无法思考任何事情，他如同一具尸体般静静地躺在那里，直到一束微弱的光透过窗帘缝隙打在了他的脸上，他才意识到有什么不对劲的地方——\n学校的储物间里有窗户吗？\n哈利用手抚摸过自己被钝器重击的位置，却发觉上面并没有留下任何的伤口，而痛感也如同梦境一般消失不见。地面透过地毯和衣物传来的冰凉感让哈利意识到现在的他并不在储物间里，而这也给了他些许勇气去观察自己所处的环境。\n他挣扎着从地上爬了起来，借着那若隐若现的光观察了起来：熟悉的红色窗帘、熟悉的床、熟悉的书桌——\n这不就是他的寝室吗！\n他身穿着长袖睡衣坐在寝室的地毯上，印刷在衣服上的黑色卡通狗在光线下吐着舌头，似乎是在告诉他那一切都是他的梦。他的被子一半悬挂在床沿上，一半散落在地上，而他刚刚一直在寻找的眼镜，此时此刻也正完好无损地躺在他的枕头边上。他站起身来拍了拍残留在衣服上的灰尘，拾起掉落在地上的被子重新躺回了床上。\n天渐渐地全亮了起来，但哈利却毫无睡意，他依旧不敢相信从他收到情书到去往储物间被人袭击的这一系列事情都只是他的一场梦。\n被钝器砸伤时带来的痛感实在是太过于真实了，真实到令他不敢想象他居然还能安然无恙地躺在这里。罗恩还在不远处的另一张床上熟睡着，平稳的呼吸声让哈利感到安心。总之不论如何，现在的他就是毫发无伤，他没有任何实际的理由去解释他在储物间里发生的那一切。\n他安慰似的将那些疼痛感归结于自己半夜不小心跌下床时的磕磕碰碰，随即便闭上了双眼。\n等待天完全亮起的时间实在是太过于漫长了，哈利换了好几个不同的姿势都无法让自己再度入睡。那双袭击者穿的黑色运动鞋一遍又一遍地出现在他的记忆里——\n而那也是他在昏迷前见到的最后一样事物。\n这般详细的物件出现在梦里本就是一件不科学的事情，而这也正是令哈利感到极为害怕的一点：\n这感觉并不仅仅是一场梦，它更像是一个预知，预知着他的未来。\n如果没有做那场奇怪的梦，那么今天本该是一个美好的周三。\n昨晚的怪梦实在是太影响他的休息了。哈利打着哈欠坐在阶梯教室的最后一排，他艰难地用右手支撑着下巴，以防自己在课上睡着。\n如果这节是其他教授的课，哈利可能会直接选择逃课，或是干脆趴到桌子上开始呼呼大睡。毕竟作为代表霍格沃茨同其它学校比赛的足球队队员之一，他完全可以以自己昨天训练太累了为由让教授放过他。\n但这节课可和别的课不一样，毕竟这可是学校里最会刁难学生的斯内普教授的课，他必须得强忍住那股睡意直至下课。\n从哈利来到霍格沃茨大学的第一天起，他就感受到了斯内普对他的深深敌意，不管他坐在第几排，哪怕是待在一个不起眼的角落里，斯内普都会精准地叫他起来回答问题，如果答不上来甚至会直接扣除他的平时分。哈利对此敢怒而不敢言，毕竟他的平时分全被斯内普牢牢掌控着，他可不想因此而挂科。\n哈利的教父小天狼星曾经告诉过他有关斯内普和他父母之间的事情，简要概括着来讲，就是他们在年轻时也同样在这所大学就读，而他的父亲詹姆和他的教授斯内普，虽然两人并不是同班，但每次碰面时却都总会因莉莉的事情而争吵起来。\n当然，莉莉最后的选择是詹姆，这场战斗也因此而结束了，但斯内普似乎依旧怀恨在心，即便后来詹姆和莉莉因车祸意外离世了，他也依旧在怨恨着詹姆没有保护好莉莉。\n小天狼星厌恶斯内普，因此在向哈利描述斯内普时，他会将毕生所学的所有贬低词语全往斯内普身上套用。而正是因为自家教父如此主观，所以哈利才没有选择全盘相信，他认为斯内普除了过分针对他以外，本性并没有小天狼星所说的那样坏，虽然他同样也不喜欢斯内普，但在学校里，哈利还是会去尊敬他。\n斯内普在讲台上毫无感情地演讲着化学教材上的内容，一片沉寂的课堂让哈利的睡意更加强烈了，他的眼睛几乎就要闭上了，笔也因他那逐渐放松的手指而滑落，继而掉落到地上。\n投屏上的字母开始扭曲了起来，哈利根本没有意识再去分辨上面写着些什么了。\n离下课还有五分钟，但哈利却完全没有意识到方才掉落的那支笔在触碰到地面的那一刻发出了清脆的响声，而那也引起了某个对他有意见的人的注意：\n“...下面我要叫一位同学来回答这个问题——波特先生，请你回答一下。”斯内普拿着厚重的化学教材直径向他的位置走来。\n哈利被男人的声音吓得一个激灵，他下意识地就站了起来，但脑子依旧是一片空白，他甚至不知道题目是什么。\n如果是以往他肯定会和赫敏他们坐在一起，这样还有人可以给他提供帮助。但是他今天实在是太困了，为了不引起教授们的注意才选择和罗恩赫敏分开坐，他独自一人躲到了最后一排的角落，却依旧被斯内普抓住了机会进行刁难。\n哈利站在阶梯教室的最后一排，这也正是整个教室的最高处，他俨然成为了所有学生的关注焦点。罗恩和赫敏坐在第三排，他们焦急地回过头来用口型告诉他答案，但距离的遥远导致哈利完全无法识别出他们口型中的含义。\n隔壁班经常会来找他茬的那个德拉科马尔福，此时此刻正毫不遮掩地在和他的两个小跟班嘲笑着他。为了找哈利麻烦，他每次上课都故意坐在离哈利最近的地方，而这次也不例外，他坐在最后一排的位置，离哈利只隔了一个过道的距离：\n“波特，如果你肯求我的话，我就把答案告诉你。”德拉科的声音从另一边传来，声音不大，但极具有嘲讽性。哈利当然不会接受一个马尔福的帮助，他宁可被扣除分数，也不愿意去请求德拉科。斯内普的脚步声越来越近，德拉科他们立刻收回了笑容，躲在课本后便准备看哈利的笑话。\n“波特先生，如果你再不给出一个答案的话，我将会扣除你十分平时分以作为分神的惩罚。”斯内普看了一眼手表，离下课只剩下了一分钟，他也不想与哈利多费口舌。他已经准备好了名单和笔，打算直接哈利的名字后面写上扣分。\n哈利低着头，不敢与斯内普那双空洞却又带有敌意的眼睛对上，他的气场实在是太强了，光是站在哈利旁边就已经让哈利紧张到出了一身汗。\n哈利抿了抿唇，大脑飞速运转着。他依稀地记得在昨晚的梦里他也同样被斯内普提问过，只不过那时的他并没有回答上来，而是被斯内普恶狠狠地告知了答案随后还被扣了五分平时分。虽然哈利根本不知道这次的题目是什么，但他还是决定死马当活马医，反正都是扣分，还不如随口说一个答案出来：\n“反应速率是18。”哈利的声音很小，但在安静的环境下又显得格外的清晰，哈利不知道这个答案是否正确，但看斯内普的反应，他总感觉有不祥的预感，他感觉斯内普的目光在他的身上停留住了。\n而此时此刻的斯内普确实有想要继续刁难下去的意思，哈利的答案的确是正确的，但那张摊在桌子上的草稿纸却又是一片空白。正当他准备开口去询问哈利的解题思路时，一阵清脆的下课铃声却打断了他——\n“下课吧！”斯内普意味深长地看了一眼哈利，随后拿着教材扬长而去。哈利知道，斯内普的这个眼神意味着下一次倒霉的还会是他，但是这也无妨，能逃过一劫是一劫。他长松了一口气，随后开始整理自己的书本，但还没等他收拾完，一只不怀好意的手就已经揽上了他的肩头：\n“疤头，你这次只是运气好罢了，下次可就没那么好运了！”是德拉科的声音。哈利不耐烦地拍掉了那只手，他现在可没这个心情与德拉科开玩笑。见哈利这副低气压的模样，德拉科很识趣地收回了自己的手，虽然他平常时总会惹怒哈利，但他知道，如果在哈利正处于低气压的时候触碰到他的底线，他会死得很惨的。为了不再次激怒哈利，德拉科悻悻然地带着克拉布和高尔离开了。\n在哈利收拾好自己的东西时，罗恩和赫敏已经在教室门口等待着他了。当然，他们的第一句话就是询问哈利是如何做出那道题的，明明哈利看起来像是一副没睡醒的模样，却在最后关头说出了正确答案，这对他们来说实在是太不可思议了，但哈利只是含糊其辞地说那是自己蒙的，并没有向他们解释那场奇怪的梦。\n其实哈利自己也想不明白，为什么梦里的答案会和现实如此吻合，难不成那个梦还真是预知梦？一想到这里，哈利就起了一身鸡皮疙瘩——\n如果真的按照梦的发展，那他岂不是马上就要被钝器砸死在储物间了？\n哈利跟在罗恩和赫敏的身后来到了下一间教室，一路上他一直在思考这个问题，但他实在是不敢再往深处思考了。如果要确认那到底是不是一场梦，只要看看自己的储物柜里有没有那一封情书就可以了。\n下节课是一节没有任何教授在的自习课，这是一间小教室，哈利经常会坐在这间教室的最后一排靠近后门的位置学习，理由很简单，只要他往身后一伸手就可以触碰到学校提供给学生们的储物柜，这给他带来了极大的便利。\n由于哈利经常坐在这个位置，久而久之，他身后的那一个储物柜也便成为了他自习课时的专属，和他一同上课的学生都知道这件事，所以也会尽可能地避开这个柜子存放物品。\n哈利依稀地记得在昨晚的梦里，当他正准备将不用的书本放入柜子中时，一封情书却从里面滑落了出来：上面赫然写着“To Harry”，还是用粉红色的信纸包装起来的。\n作为万年直男，哈利原以为这只是德拉科给他搞的恶作剧，但在他等了德拉科足足一节课后，德拉科却依旧没有来，似乎是因为他们的学院出了些事情，所以邓布利多校长将他们学院所有的男生都叫了过去。\n不知道这封信来源的哈利也只好按照情书上写的“课后在学校最角落的储物间见”行动，按时来到储物间，结果却没想到竟出了那样的意外。\n哈利忐忑不安地打开自己的储藏柜，他心脏跳动得很快，他担心迎接他的真的会是一封粉红色情书。他缓缓地移动开他柜门，而下一秒，他也松一口气——\n柜子什么没有。\n哈利将所有书本全部放了进去，随后坐回了自己的座位上。提心吊胆了一早上，哈利可没有心思去学任何东西。而德拉科的踩点出现也让哈利彻底放下了戒心，毕竟在那个梦里德拉科可是压根没来上这节课。\n哈利安心地趴到桌子上，决定好好地补上一觉。\n然而，哈利还是感觉有一种莫名的违和感环绕着他，强烈的第六感告诉他：昨晚的梦，他一定是真实地经历过的。\n当哈利再次从梦中惊醒时，时间已经过去了一大半，他揉了揉太阳穴，试图从残留的睡意中清醒过来。他又梦见了那封情书，还有那双黑色运动鞋，虽然这次比早晨时的感觉要模糊很多，但他依旧没办法忘却那份恐惧。\n在再三犹豫下，不安感还是驱使着他去储物间探个究竟。哈利拿上自己的手机，悄悄从后门溜了出去。赫敏和罗恩以为他只是去上厕所，也便没有在意。\n通往储物间的走廊一片漆黑，哈利将手机打开了照明功能，依靠着那仅有的一束光线向前走着。寂若无人的环境让哈利心生恐惧，但他还是硬着头皮朝着储物间的方向迈步。\n明明只是十分钟的路程，哈利却感觉自己将近走了一年，他在储物间的门口停住了脚步， 而那扇门，此刻正半掩着。\n哈利紧握住手机，他的手已经开始微微发颤。在犹豫了将近一分钟后，他还是决定先在附近寻找些武器用于防身。哈利将手机放回到了裤子口袋中，空出手来在储物间外的一个堆满了各种体育用品的角落翻找着趁手的工具。\n但翻找到最后也只是找到了一个扳手。\n哈利吞了吞口水，单手拿着扳手推开了那扇充满未知的门——\n灰尘混杂着如同铁锈般的味道铺面而来。\n哈利被这些灰蒙蒙的尘土迷了双眼，他连忙挥手将那浑浊的空气挥置一边，待眼睛适应了后，这才缓缓地睁开双眼。\n然而，在他睁开双眼看清楚储物间全貌的那一刻，一股寒意瞬间漫上了他的全身，他甚至忘记了该如何去呼吸，而从他那因恐惧而放大了的瞳孔中可以看见：\n一具被小刀刺穿喉咙的尸体正静静地躺在地面的正中央。\n血液已经凝固，从脸到脖子再至胸口——\n那人的身体无一不被那暗红色的胶冻状凝块所侵染。\n哈利强忍住想要呕吐的欲望，他靠在门框旁试图找一个支撑点支撑住自己那将近发软了的身体。凭借着仅存的理智，他掏出了手机拨打了报警电话。\n但随着嘟嘟的两声，电话并没有拨出去。屏幕顶部的信号栏直接降到了最低的那一格，这预示着他根本不可能在这样一个环境下拨打出任何一个电话，哈利不死心地又拨了五六遍，他甚至连罗恩和赫敏的电话也都试了一遍，但那根本没有用处，而在慌张之中他甚至差点将它摔在了地上。\n只有一人一尸的储物间清晰地回荡着急促的呼吸声。长这么大，哈利哪见过这种场面，他生活在一个和平的年代，除了他的教父小天狼星在他年幼时被冤枉是杀人凶手而入狱了以外，他就再也没碰到过像这般棘手的事情了。\n如果是别人，那他们会怎么做？\n经过几分钟的冷静，哈利开始了思考，这种时刻他应该多去想一想那些刑侦剧里角色会做什么。他重新举起了手机，只是这次不是再徒劳地去按绿色的按钮，而是点开了拍照功能——\n随着“咔嚓”的一声，血淋淋的照片存储进了他的相册中，他将手机放入口袋里，随后转身离开。保留好了现场照片，现在的他有了充分的缘由去向其他人解释发生的这一切。\n哈利加快脚步向麦格教授他们的办公室跑去，而在慌张之中，他甚至忘记了打开手机的照明。他在昏暗的走廊里不顾一切地向前冲，但却在无意间撞到了一个他完全不想在现在这个时候碰到的人——\n德拉科马尔福。\n“疤头，你又在搞什么鬼！”淡金色头发的青年和他撞在了一起，在撞击的作用之下，两个人直接跌坐到了地上。\n哈利捂住了脑袋，光是这无足轻重的冲击力就令他眩晕不止。伤疤隐隐作痛，那是车祸给他留下的痕迹，从他年幼一直伴随到现在。自从他离开孤儿院后，它就再也没有痛过。\n它带来的感觉让哈利更为不安。\n“不要去那边的储物间。”哈利起身站起，随后头也不回地从德拉科身旁跑走，他顾不得再和德拉科解释什么了，虽然他也同样想知道德拉科为什么在这里，但现在的这种情况已经不允许他再耽误下去了。\n德拉科呼喊着“波特”的声音在他身后回荡着，他期许德拉科不要抱着好奇心去储物间，否则他肯定要被吓得魂飞魄散。\n眩晕感不断直击头脑，哈利甚至开始有些看不清眼前的道路。\n一格，两格，三格......\n在台阶就像分裂了一般出现了重影，他很勉强将注意力集中在台阶上面，一步一步小心翼翼地挪步。然而，在他迈向最后一格台阶的那一瞬间，意外还是发生了——\n他的后脚突然失去了重心。\n他拼命地调整身体企图调整过来，但那完全无济于事，他就像是一张毫无重量的白纸一般，轻飘飘地向后仰去，手机从裤子中滑出，随着他身体跌落的方向摔到地上。他闭上了眼睛，等待着即将到来的疼痛。\n而他不知道的是，接下来将会有比疼痛还要恐怖的噩梦等待着他——",
	"45745792000": "At first, there were no indications that I was different.\nThe usual signs were there; when I was 5 I healed a cut on my hand, when I was 7 I got so angry I made a house elf fly across the room, and when I was 8 and a half I went through a small phase of being able to read my cousins mind. My uncle was particularly proud of me for that one, and although I didn't know exactly why at the time, I knew that I'd done something different, something extraordinary.\nHowever, of course nothing can stay perfect forever; after that everything changed quickly, so quickly it makes my head spin to think of it. On the 5th of June, my cousins 9th birthday arrived. As with every year we sat in the living room (my aunt found the parlour room to be far too uptight for occasions like this) on the rug that had become threadbare with age, and sat around as my cousin opened his presents. He tore open presents wrapped like sweets, in layers of brightly coloured cellophane all tied with fluffy bows. There was the usual fanfare, a magical train set, tricks, sweets and chocolates, funny wooden toys that were usually played with by muggle children, etc. Once all the presents had been opened and he sat there in the midst of wrapping and ribbon watching the train go round on its rail, my uncle shared a rare smile with my aunt, and drew out a slender box, in a gorgeous shade of cerulean blue. Draco looked up, wide eyed at the box and carefully reached towards it, his fingers trembling slightly as he undid the gold bow and prised open the box. Inside the box laid a wand. It was shorter than my aunt and uncles wands, a little stubbier too, and duller in colour, but to Draco it was the most magical thing he'd ever laid his hands on and he squealed with excitement, already begging his father to teach him some spells.\nFor four weeks I watched Draco wave his training wand around practicing spells that my uncle had spent hours patiently teaching him. I gazed on enviously as he lit up the hallway with a wave, or turned his carrots purple at dinner, knowing that when my birthday rolled around, I too would receive the honour of wielding a wand like that, and starting my path of becoming a witch in my own right.\nAlthough my birthday landed on July 6th, only just over a month after Draco's birthday, I couldn't help but feel that it was taking forever for it to come, and for the first time in my life I actually used the calendar that my aunt gifted to me every Christmas, striking of the days with a big red slash, constantly looking towards that glorious gold circled day. It was causing me more excitement than all of the rest of my birthdays put together. I expressed this to my godfather when he came to visit and he chuckled warmly saying, \"If this is how excited you are for a training wand, wait to see how you feel on the run up to being eleven.\"\nFinally the day came and everything went exactly like it did on Draco's birthday, the threadbare rug, the hidden smile, the perfect slender box, I was so excited I felt like I could explode. The wood of my new wand was slightly cool to the touch, and shone a beautiful honey tone. Of course me and Draco immediately began to compare our wands, as expected we both thought that ours was more shiny, a nicer colour, longer. In reality they were both exactly the same, but that didn't stop us from thinking that ours was superior of course.\nI still remember how much love and hope I felt for that wand, I feel it now too slightly, but it feels bitter and tainted, like a strong almond, sweet at first until it starts tasting of cyanide.\nMy uncle, as he did for Draco spent hours attempting to teach me how to use it, but with every hour he got increasingly more frustrated and I got increasingly more upset, as the wand stayed stoic, refusing to perform. Weeks passed and I still couldn't get a flicker of light or a spark of colour.\nOne night about two months after my birthday I heard my aunt and uncle talking in the drawing room, they talked often in there at night, so this wasn't anything unusual, but the tone of my uncles voice was strange, his usual lazy drawl had been replaced with a sterner harsher voice. My godfather spoke to me about this often, he called it my uncles \"ministerial voice\" and said that he only used it when speaking of matters with great importance.\n\" We can't be too sure yet, its far too early to tell, besides not all wizards respond well to training wands Cissa. There have been clear incidents in the past as well, we both know that.\" My uncle stressed.\n\" But we have to keep an eye on it! And shouldn't we start preparing now, in case the worst happens, if the dark lord hears-\"\n\" The dark lord hasn't been around for nearly eight years, for all we know he's well dead and gone\" My uncle interrupts her abruptly.\nThis seems to end their conversation and they both lapse into silence. My aunt stares into the fire fear clouding her eyes; she raises a hand to her mouth as if to bite her nails but seems to think better of it letting if fall back to her lap gracefully.\nThe next time my godfather visits I question him, hoping to find some answers.\n\"Who's the dark lord?\" I ask innocently.\nHe looks up sharply with surprise in his eyes.\n\"Why are you asking?\"\n\"I heard my aunt talk about him.\" I reply. I worry, he looks strange, and I fear that he'll close up and refuse to give me any answers.\n\"He was a friend of your mothers.\" He answers at last.\n\"A good friend?\"\n\"I suppose you could phrase it like that.\"\n\"Is he important?\"\n\"Very.\"\nThis sates my curiosity and I stop asking him questions, focusing on playing with my dolls instead. Out of the corner of my eye I see him relax at the fact that he hasn't been asked any further questions.\nOn Draco's 11th birthday, there is much fanfare as midway through breakfast an owl glides through the window of the dining room, that had been deliberately left open just for this occasion. There are smiles all around as Draco pulls the letter from the owl and cracks open the burgundy seal on the envelope. He reads the entire list aloud even down to the equipment list.\n\"Can we go shopping now?\" He exclaims. My uncle chuckles.\n\" We'll wait for Calla's letter, we can get everything at once.\"\nDraco pouts and sulks for a while, but eventually comes around, as even the disappointment of waiting to go shopping can't overshadow his pure joy and excitement about receiving his Hogwarts letter.\nAs the days lead up to my birthday I feel more and more anxious, paranoid that another event like the training wand will happen. My uncle and godfather both reassure me that it won't. My aunt simply stands in the corner of the room trying to hide her fidgeting behind her robes and her anxiety behind her perfectly painted on smile.\nThe morning of my birthday comes and no owl appears. We all try to carry on as usual but a heavy weight settles on me as I open my presents and I throw up after two bites of birthday cake. At 4.30 my uncle disappears upstairs to write a letter to a man named Dumbledore.\n\"That's the headmaster of Hogwarts\" Draco tells me matter of factly.\nHe doesn't act worried like my aunt and uncle, but for the first time in recent memory he sits and plays dolls with me, seeming to forget that just 4 weeks ago he'd announced that he was now a man that didn't need toys to be entertained. At 5.45pm we observe an owl going through the window into my uncles study, and at 6pm my uncle calls my aunt into his study. We hunch over the keyhole trying to listen into their conversation but our efforts are futile.\n\"They've put a silencing charm up.\" Draco announces in dismay.\nThe next morning at breakfast we all eat in silence, and I don't dare bring up the previous day. We eat lunch in silence as well, and then dinner too. This continues for the next 3 weeks, and is the only time period within my memory that a family dinner was spent without listening to Draco's endless spiel of whine or upset.\nIn late July Draco and my uncle leave to shop for his school supplies in diagon alley. Draco brags as he leaves, of course, but its more subdued than usual; there's no malice behind his taunts. My aunt brings me into the drawing room once they leave, an I'm faced with a strange man cloaked in pure white robes. He looks just a bit older than my aunt and uncle; wrinkles crease at the corners of his eyes, but don't spread across his forehead yet, his hair is starting to turn a steel grey at the temples, but the rest of it is still smooth and black, like an oil slick. He smiles at me warmly, in contrast to his hawklike appearance, and I cower into my aunt, afraid.\nMy fear might seem strange to you, but at this point my only outer world interaction had been with either my godfather or my aunts very small group of friends, who didn't really come around all that often. My cousin had a few friends, but I had always been more happy in my own company.\n\"Calla\" My aunt spoke softly. \"This is healer Anton, he's here to do a check-up, will you let him?\"\nI nodded, not really wanting to speak, and sat primly on the edge of a chair, as the healer prodded and poked me with his wand, occasionally casting a spell that made my stomach turn or my chest feel tight.\n\"It's alright, these are powerful diagnostic spells, it's normal for them to feel funny.\" My aunt reassures.\nI sit for a further 20 minutes, watching the delicate hand of the clock tick round repetitively. By the time the healers finished I feel a bit loopy from staring for so long.\nOnce he's finished, and has made at least 3 pages worth of notes, he looks up to me.\n\"Well Calla, I think we've finally figured out what's wrong with you.\" He announces.\n\"What is it?\" My aunt worries.\n\"Calla's magical core is as strong as we would have expected it to be, if not stronger. But it seems to be bound to specific parts of magic, not all of them. It isn't that Calla can't do magic per se, more so that she just can't do the type of magic you're expecting her to do.\"\nMy aunt relaxes, but only slightly. \"So what do we do now?\" She asks.\n\"You could experiment. Look through a book of spells and see what she can do and what she can't, once you find one or two spells she can do you'll have some sort of idea what else she could do. Or if that doesn't work you could try her with something other than a wand, some cultures use staffs of special stones for example; but really Mrs Malfoy, I think the best way will just be to let Calla find out organically. Without receiving a wand or any formal training, she'll most likely continue to perform accidental magic. Overtime she'll  be able to curate it, to make it into something more than a few outbursts.\"\n\"So we're just supposed to keep her here forever until she figures something out? Every child should have the right to an education! It's unfair that Calla should miss out just because her magic is different!\" My aunt blurts out, in obvious distress.\nHealer Anton has reached the fireplace by now, and already has a handful of green powder in his grip, ready to throw it in and disappear at any moment. He pauses and turns to face my aunt.\n\"Well there's always muggle school.\" He remarks with a shrug before flooing away.\nMy aunt drops to her knees and starts to sob, in a state that I'd never seen her in before then. It was then I suppose that the whole reality of the situation dropped on me. I had magic, yes but I would never go to Hogwarts, I would never surpass my training wand, I would never sit an OWL or a NEWT. Those would nevers circled around my head until I felt sick and dizzy. I can't remember the events of the rest of the day now, it's all too blurred in my mind. Maybe we did speak at dinner, maybe Draco did show off. Maybe, but I don't think so.\nThat was the first day that I truly felt out of place in the magical world that I'd grown up in, but it'd be far from the last.",
	"45745729000": "'Okay, now here's your lunch, there's a Dollar in there to buy some milk, you can ask an older kid how to do that,'\n\"Mam I'll be alright-\"\n\"I've wrote down your phone number for you, just in case you forget! Make sure you keep it in your pocket!\"\n\"I'll be fine, just trust me on this, okay?\" Remus said softly, brushing his mothers hands off his shoulders and giving her a kiss on the cheek before slinging his bag over his shoulder and giving a small wave goodbye before crossing the street and walking the few minutes to his new school.\nRemus is sixteen and he knows it isn't normal for his mother to get so worked up before his first day of school, but he's been homeschooled all of his life. His father was a big political figure in Wales and Remus was never sent to school, as he spent most of his childhood sick and his mother tutored him in everything he needed. They'd moved to Chicago after his Dad got offered a position at the local university and now he is going to a real school for the first time.\nThe entrance was crowded and he was bumped into several times, though most seemed to move out of his way, one of the only positives of his towering height. It didn't take long for him to find his room and he immediately slinked to the back and tried to find a seat near the far corner. He went to put his bag down by one of the desks but he was interrupted by a smooth voice.\n\"You don't want to sit there, Thats where Mulcibers girlfriend is going to sit, and they are practically nausea inducing,\" the mysterious voice informed, and Remus looked up to a pair of icy grey eyes staring him down. The boy, with jet black curls and a fair complexion, shared a look of humour with the blonde and brunette, the two equally attractive boys sat around him, before returning to the book he was sketching in with a pencil.\n\"Thanks..\" Remus started uncertainly, picking up his worn out bag and moving to the next desk over before, yet again, being stopped by a warm, rough voice, this time the blonde boy.\n'You don't want to sit there either,\" he points to the teen sat at the desk in front before continuing, \"His hair is so greasy you'll probably slip over if you even get near him,\" and him and the other boy the one who hasn't yet spoken, snicker. \"You should sit with us,\" he says with a small smirk and Remus gave him a small smile and sat down at the desk next to them.\n\"I\"m Barty and this is Evan and Regulus\" the brunette, Barty, informs as he points to the others, first the blonde, Evan, and then the noirette, Regulus, each giving a small wave in turn.\n\"I'm Remus\" he finally says after picking up on the three staring at him expectantly. \"Do any of you know where room G14 is? It's where I'm supposed to be next class.\"\nRegulus takes the timetable out of his hands and looks it over \"'Health Tuesday/thursday, room G14'\", he reads out and hands it back. \" Yeah we know where that is. It's in the back building, we'll take you there\", he assures.\n\"What back building-\" Barty starts before being cut off by sharp glare from Regulus and a kick under the table from Evan. \"Ohh, yeah, the back building.\" he says slowly and Evan sighs but gives Remus a reassuring smile.\n\"Thanks\" , Remus breathes out, grateful that he isn't going to spend his first day alone and lost.\nAfter homeroom ends Barty and Evan grab hold of Remus and pull him through the bustling hall, occasionally shouting things out such as \"New meat coming through!\", earning them multitudes of glares from peeved students. Regulus strolls ahead and rolls his eyes and his friends childish tendancies.\nRegulus had known Barty and Evan for practically his whole life and was grateful for them, though they were seldom not embarrassing. They were his brothers when his left him and they were the only people he could trust, he couldn't ask for anything more.  All he really wanted was for them finally realise how utterly and hopelessly in love they are with one another, but its proving to be a difficult task.\nHe was pulled out of his thoughts when they got outside and the cool breeze hit him and he decided to slow down and listen to whatever nonsense Barty was talking now.\n\"Youre taking twelfth grade English Lit?! Why? I can barely pass this years class.\" Barty marvelled.\n\"I like reading,\" Remus shrugged \"it's calming\"\n\"Damn this kid is smart!\" He exclaims, hitting Evan softly on the arm, as if to prove his point and Evans yes widen and his face becomes a deep crimson. Regulus hides his laugh in a cough and Remus' eyes shift between Barty and Evan before be sends a questioning look to Regulus, who responds with a smile shake of the head and a look telling Remus he'll explain later. The trio settle near a tree outside, overlooking a gym class, while Remus stands, confused.\n\"Where's the back building?\" He asks whilst Evan lets out a soft laugh.\n\"It burned down in 1987.\" Regulus simply states, leaning against the tree with his legs crossed and a smirk playing on his face.\n\"Won't we get in trouble-\" Remus starts but he cuts himself off. His only been to one class today and its already torture, so skipping one or two wouldn't hurt, would it? \"Fuck it.\" he sighs, before throwing his bag off his shoulder and onto the grass before sitting down and joining them.\n\"Why didn't they keep homeschooling you? You seem smart enough?\" Evans questions before copying Regulus and leaning against the trunk of the large tree.\n\"They wanted me to get socialised or something? They think I don't have enough friends or whatever.\" It was true in a sense, but that wasn't the only reason. His parents had wanted him to go the proper school since his mother had gotten sick and couldn't keep up his studies. He wasn't going to tell people that though, he didn't want to be more of an outcast than he already was.\nEvan went to respond but he was interrupted by a small gasp from Barty. \"In the name of all that is holy, will you look at James potter's gym clothes?!\"\nRegulus gave another one of his signature eye rolls and looked up from the sketchbook that he had propped up on his lap and was drawing in with a pencil. \"Of course all the Marauders are in the same gym class.\"\n\"Who are the Marauders?\"",
	"45745726000": "Petunia Dursley was not your ordinary middle-aged muggle. Despite her unassuming appearance with brown hair and green eyes, she was a highly skilled spy for MI6. She had been recruited from a young age and had quickly climbed the ranks, earning a reputation for her ruthlessness and efficiency in dealing with dangerous muggle threats.On this particular day, Petunia was on a mission to take down a notorious criminal who had been causing chaos in the muggle world. She had been tracking him for weeks and had finally located him in an abandoned warehouse on the outskirts of London.As she made her way through the dark and dusty building, her gun held tightly in her hand, she couldn't help but feel a rush of excitement. This was what she lived for - the thrill of the chase, the adrenaline rush of taking down a target.When she finally came face to face with the criminal, he sneered at her, \"Who do you think you are, little girl?\"Petunia smirked and replied coolly, \"I'm the one who's going to put a bullet in your head.\"Without hesitation, she pulled the trigger, watching as the man fell to the ground, lifeless. She felt a sense of satisfaction wash over her, knowing that she had protected the Muggle world from yet another dangerous threat.As she made her way back to MI6 headquarters, Petunia couldn't help but smile to herself. She loved her life as a spy - the danger, the excitement, the sense of purpose it gave her. She knew that she was doing important work, protecting the innocent from those who would do them harm.\"You're one of our best, Petunia,\" her boss said as she handed over her report.Petunia grinned. \"I know,\" she replied. \"And I wouldn't have it any other way.\"",
	"45745720000": "“You can stop being so gentle with me,” Ginny said against Harry’s lips.Their first kiss had been spontaneous and passionate but every kiss after had been sweet and tame. Ginny did not mind the gentle kisses but she wanted more and Harry seemed to be holding back.“What?” Harry asked, looking up at her.She had already taken the initiative to sit in his lap, which he definitely did not seem to mind but his hands were softly on her waist as they kissed.“You’re being perfectly proper with me - too proper. Just snog me like your life depends on it,” she said boldly.Harry promptly turned red. “I- I, uhm-”“Merlin, Harry, you’ve dated before. Why are you so scared?” Ginny asked. Harry was avoiding looking her in the eyes now. She hadn’t meant to embarrass him, she just couldn’t understand why they weren’t passionately making out right now.“We didn’t - we never-” he stuttered through his reply.“Oh boy. Why not?” she asked honestly.Harry’s brow furrowed. “She was crying all the time, especially when we kissed, she just wanted to hold hands and talk- Look, can we not talk about Cho right now?” He looked back up to her.Ginny smiled. “Never? Well, you’re overdue for a good make-out session then.”“Are you mocking me?” Harry shot back.Ginny adjusted her position so she was even closer to him. “No, I’m volunteering.” She grinned and he chuckled when he realised she wasn’t making fun of him.“Just get out of your head for a minute and let your body lead.”Harry turned redder. “I don’t think that’s a good idea.”Ginny looked at him. “Yes, that’s what you’re supposed to do… I’ll lead,” she added as she sensed his hesitation still.Ginny leaned back in and started slowly, giving him time to adjust. She moved his hands and placed them on her back instead. Then she put her hand on his jaw to guide him, the other around his neck.Harry seemed to gain some confidence as he held her a little tighter and she leaned in further. She grabbed onto him tighter as she deepened the kiss.Suddenly Harry appeared to lose all hesitation at once as he took the lead. Tongues sliding together, lips moving still but suddenly he was guiding her. His left arm looped around her waist as the other came up and buried itself in her long hair. She inhaled sharply at the sensation of all these things at once.She had never been kissed quite like that. Leave it up to Harry Potter to go from 0 to 100 in a few minutes’ time. His technique needed work but was compensated by his enthusiasm and the feeling it caused in the pit of her stomach. He held her closer, her body pressed to him as his head angled for better access.“Better?” he asked when they parted, looking rather flushed. She could tell he knew it was definitely better.“You’re joking?” She caught her breath as he continued to hold her to him, their faces close to each other and their breaths mingling.“This is better than my dreams,” he admitted, looking into her eyes eagerly.“Been dreaming about me, Potter?” she said, tucking her hair behind her ear.“For longer than I care to admit.” He bit his lip.She smiled wider. “Shall I show you what we do in my dreams?” She was sure she was blushing but she did not care.Harry swallowed hard. “What’s that?”Ginny put both hands on either side of his face and kissed him, and then her lips travelled to his jaw, leaving kisses everywhere. Her lips moved further down to his neck, one of her hands came to his collar and slipped under the fabric as she nipped at his neck.“Interesting dreams you have,” he commented, his voice sounded strained and his hold on her tightened.She chuckled. “You don’t know the half of it.”",
	"45745630000": "From wizard to ghostbuster challenge\nPlot: Stranded in another universe Harry are taken in by four muggles who hunts ghosts for a living.\nRated M\n\nDetails:\n- Plot begins during The Battle at The Ministry of Magic in The Order of The Phoenix since with all the magical artifacts getting destroyed it give the writers a realistic source of depths and interconnection on how to transform the characters, give them new abilities or send them to another fictional universe for crossovers.- Harry ends up in Netherworld where he meets Heronymus who tells him about \"the strange but powerful wizards\" which leads that Harry eventually finds himself in Ghostbuster-verse.- You can include Sirius.- Harry catches up with his muggle education.- Pairing is with any two-eight years older female character, even female ghosts and multi-pairing if you want.- Rated M for eventual lemon with girl-on-girl if you chose mulit-pairing.- Protective parental Ghostbusters.- Reasonable mayor who takes sympathy for the universal displaced wizards and do everything in his power to help them up on their feet again within reason.- Bashing on Dumbledore and Weasleys, but mentioned only.\nIf you accept this challenge write the link in the comment section when you've posted the first chapter.",
	"45745408000": "It was just another day at Hogwarts school of witchcraft and wizardry, and Sue Sylvester was convalescing with the spirit of he-who-must-not-be-named. Or as I like to call him, Blobby-mort.\n \nHer gaze was fierce and her resolve was unmatched, her eyes brimming with vengeful rage as she stared into the invisible camera of the audience with a look of cunning wickedness on her face. Sue Silvester was a brilliant woman, more so than even the most clever minds in the entire world with an IQ of one thousand and seventeen hundred million percent dot four hashtag 9; her brain just too big for her puppet head on her tiny wooden body. \n \n\nOh? Haven’t you heard?\n\n \n\nMy dear friends and esteemed colleagues of ao3 literature, this story isn’t just about Sue Sylvester as a woman…\n\n\n\nThis is about Sue Sylvester as the jigsaw puppet she made of herself in the glee episode where she traps Klaine in a fake elevator and forces them to get back together because she is the number one Klaine shipper with a whole ass shrine in her funky little creeper storage room. \n\n\n\nAnd she shall thus appear as the puppet version of herself throughout the entire story, or this shall not be known as ‘the puppet fic’.\n\n \nAnyways, so Sue as her puppet self on a tricycle droned out the white noise of the chatter around her, her mind focused on her goal as she recited mantras of her core beliefs to herself. \n \n“The glee club are the most vile set of losers to ever walk this school. With the amount of bacteria colonies in their unwashed armpits, I’m surprised they haven’t been legally classified as a health hazard to the rest of the other students.” Puppet Sue kept harshly whispering under her breath, sneering as she spoke. \n \nVoldemort was beside her, listening to her rant away to herself like an insane baboon who was also a puppet. He thought to himself that damn she was probably way crazier than he was despite them both wanting to eliminate children, and he flapped his funky arms around to try and get her attention. \n \nPuppet Sue turned to Voldemort, the dark lord’s spirit inhabiting the vessel of famous British television personality, Mr Blobby, and monologued to herself about how she got there. \n \n‘In order to DESTROY THE GLEE CLUB, I had to team up with the only other thing in this world that is more disgusting than a bunch of sweaty teenagers with self-esteem issues and poor hygiene… Mr Blobby, who was also just Voldemort. It is only with him and my sidekick, Becky, that I may finally reach my ultimate goal of finally DESTROYING THE GLEE CLUB!’ Sue internally said to herself as she kept staring into the invisible camera, unaware that her name had been called like 3 times already by her no-so-official one-night-stand lover. \n \n“Sue?” Voldemort puppet Mr Blobby said in a gross uwu voice. \n \n“What?!” Sue snapped at him. \n \n“They’re over there.” Blobby-mort pointed out to her with a wave of his pink flabby arms. \n \nSue turned her head to look at the tables in the great hall, where students were flooding into the giant room to stuff their stupid faces with breakfast sausages and bacon and eggs and toast and waffles and croissants and pancakes and muffins and buttered bread and bagels and entire rotisserie chickens. \n \nSue took a glance over to the teacher’s table, watching as headmaster Gonzo, swallowed an entire sausage whole whilst making eye contact with Argus Filch who was just a normal human. He was so nasty, so gross, so unholy that she wanted to shove a broomstick up his ass and hoped he would fly high enough to reach the fucking moon. \n \nLooking at the degenerate members of the Hogwarts glee club, who were the puppets from DC’s legends of tomorrow from the puppet episode except for Fin who is just a regular puppet version of himself, Sue was almost sick to her stomach seeing them eat normally like they weren’t clearly all adults over the age of 20 and definitely not supposed to be at this school for kids.\n\nAnd also, where the hell was everybody else? Aside from the glee club and members of the quidditch team (who were also very much 22 year olds trying to pass as 16 year olds), there were fuck all students there, and for some reason the teachers didn’t notice or care. \n\n\n\nIt was like they were all trying to make puppet Sue go crazy… It’s like they all were out to get her, and they were just waiting for her to snap. \n \nShe wished them all ill, and if there was any indication of her seething fury, the metal spoon bending in her alpha puppet hand was surely one. Sue could smell the bastardness coming off the glee club at Hogwarts, and as her alpha rage senses began to pull her away from the task at hand of murdering them all, she was distracted briefly by the sheer power of will that exuded from her cheerio physique and elite ultra mega alpha prowess. \n \nShe could not stray from the plan now. \n \nAfter class, she met up with Blobby-mort and Becky to mosey on over to the glee club room, which used to be the room where the quidditch team and cheerios would congregate to talk about the sports program and their benefits from winning all those sponsors and championships. \n \nThey needed to lure the entire glee club and their teacher, Kermit, to the girl’s lavatory where they would push everyone down the hole into the chamber of secrets where they would be eaten and digested by the enormous pet snake that Sue had adopted from puppet Hagrid about a week ago when he was drunk and blasted out of his mind in the ratty corners of Diagon Alley. Hagrid had a bunch of dead rats in his pocket that he thought were brown, furry twizzlers but he seemed like a reliable person to buy from because he wouldn’t remember a thing about selling puppet Sue the snake that night. \n \nSue busted down the glee club door with a boom like that one video of Big Bird coming through a door, wheeling in on her tricycle with a horrible creaking sound from the rusted chains on her silly little funky jigsaw tricycle. \n \n“Guess who just saw a recruit for Broadway roaming around the halls?” Sue said in her deranged jigsaw puppet voice, watching as all their faces lit up in excitement. “I hear they’re gonna give a role to anyone who will join in on the puppet orgy in the girl’s bathroom…”, she continued with a smirk, feeling the woosh of the desperate morons as they clawed past her and sprinted to the cursed lavatory immediately. \n \nPuppet Saw movie Sue and Becky looked into the camera menacingly as the glee club ran to the bathroom before following them in hot pursuit as they left their glee club teacher, Kermit, in the dust.\n \nArriving to the girl’s lavatory, Sue and Becky were greeted by Blobby-mort who had a moustache and a hat on, parading as the Broadway scout who had the glee club hanging on his every word as he patted a man who was literally 30 on the back for lining up for the orgy. Beside this grown ass man was Ed Sheeran (as seen in his music video for sing), another sexy puppet about to join the orgy as he ripped open his clothes and got all fuzzy and naked at Blobby-mort’s request. \n \nYes…everything was going to plan. No close calls yet-\n\n\n\n“What are you up to, Sue?” Kermit strolled up to Sue with suspicious eyes. \n \nHe was Kermit, and his face was also Kermit, and when he spoke there was only Kermit with an attached dirty blond wig to his scalp that was so crusty you could run a knife over it and it would sound like when you’re about to crunch into a piece of fried chicken that’s been left on the floor of a man’s gaming setup for a little too long. It was like when you run a rusty knife against dirty grill char leftover from a barbeque, \n \nStupid glee club. Stupid Kermit. Stupid Hogwarts school where they had very little employees and no normal enrolments. \n \nSue’s alpha instincts were kicking in, and as she radiated top dom fem masc girlboss energy, Kermit shuddered a little bit. \n \nOh?\n\n\n\n\nIntriguing…\n \nWhen Kermit shuddered, it was like Sue’s senses got put into overdrive, smelling something that she believed he had been hiding all these years they worked together. \n \nMr Kermit was an omega!!\n \nHe probably forgot to take his heat suppression pills, and as such, his pheromones were going crazy out of this world. She could smell him everywhere her nose turned, and as Sue growled whilst backing him into the wall, she got a whiff of the tell-tale scent of a subby little omega in heat. And that omega was this bitch boy in front of her. \n \n“S-S-Sue”, the Kermit puppet choked out as his bottom lip quivered against her mighty alphaness. \n \nA series of throaty moans began to conjure up from behind them as Blobby-mort grabbed Gonzo, the glee club, the legends of DC’s puppet ensemble, and Headmaster Goofy for a fuckening of epic proportions. \n \nThe star ‘Rachel Berry’ of the glee club, Puppet Ed Sheeran, began to sing as Gonzo began to fondle his weird puppet breasts. Ed moaned as the first line of Mozart’s ‘Requiem in D Minor, K. 626, III. Sequentia: 1. Dies irae’ left his lips, and the horny bastards really started going at it like they were demented animals and not civilised sentient puppets with hopes and dreams and some regard of tact and manners. \n \n“Hyuk- garsh- dang nabit”, Goofy moaned as a member of the glee club shoved a hand up his ass and began using their hand up there to make him talk and make noises of pleasure as they explored his puppet cavity. \n \nFabric and string became wet and tangled as the puppets kept fumbling about in ways that were sexual but looked strange and like someone had cum on a rag and just thrown it into a pile of already dirty laundry. More could be said about the ways in which this orgy occurred: like how Sue as her jigsaw puppet-self bred Kermit to heaven and back while doing tricks on her tricycle, outdoing whatever the heck it was that Tony Hawk was doing; or perhaps how Rachel Berry had started speaking in tongues as Satan, a old friend of Sue’s, had begun to speak through her body when she accidentally summoned the dark lord by singing so low that she hit the brown note and shit her pants so viscerally that she opened a doorway to hell; or even how the glee club had also all pooped their pants and started stomping it down some of the drains in the girl’s lavatory or throwing handfuls of their shit at the wall like it was a snowball fight in Canada or something. \n \nAll horrible. \n \nAll disgusting. \n \nBut nonetheless they were all getting delirious and tired, for you see, Sue and Blobby-mort had actually found a way to turn fentanyl into a gas and had fumigated the entire lavatory to make the glee club more susceptible to influence. Because Sue was a high-value alpha female, the drug had no effect on her, and she made sure to signal for Becky to get out before she got high from the drugs herself. Blobby-mort was also fine, despite the huge broomstick that Professor Goofy had shoved up his ass with a HYUK sound and a crazed look in his bug-eyes that were reminiscent of that one time he went into a school and shot it up and then went to court for it where he pretty much admitted that he was guilty because “the demons told me to”. \n \nAnd so the seeds of Sue’s cunning were finally coming to fruition, as the glee club began to trip balls and get high off their faces so bad that they thought they could walk on air. \n \nIt was finally time. \n \n“Guys! Guys! Guys!” Sue called out to them as she wheeled her tricycle over. “There’s an even kinkier party setup for the orgy down the hole. I heard there’s an even bigger ‘snake’ down there for us to enjoy wink face” she informed with a grin, pointing to the now open chamber of secrets that had a really poorly constructed sign with a red arrow pointing down next to it. \n \n“Did somebody say hole? Hyuk!” Professor Goofy said, diving head first like a plank into the hole, no questions asked. \n \n“Fuck yeah I love holes!” Bob the Builder screamed, nobody questioning how he got there as he helicoptered his phat but stubby schlong before penetrating a fleshlight with wet cement dripping down from it. \n \n“Broadway, here I come!” Rachel exclaimed in a demonic, three-toned voice. \n\n\n\nRachel proceeded to pirouette and tap dance her way to the hole, singing Sticker by NCT as she backflipped off the side into the hole, her voice echoing down. Everyone in the glee club, and even dear old crusty omega Mr Kermit had immediately jumped down after her, their laughs and shouts of joy getting further and further away as they went down before they ultimately stopped altogether. \n \nWaiting for them at the bottom of the tunnel into the hole was in fact the basilisk, alive and hungry for degenerate glee club members. It also was lowkey Sue’s pet after she found out she was the heir of Salazar Slytherin, not Blobby-mort unfortunately, and threw an 11 year old boy with a scar on his head down the stairs one time at a London train station. He didn’t make it but oh well, you live and you laugh and you love.\n \nAs their screams turned silent, Sue understood her dreams had been realised. The glee club was finally defeated. Destroyed once and for all, Sue gazed upon the light coming through the windows of the lavatory and breathed, watching the sun rise on a grateful universe. \n \nFree from the glee club, Sue leant back on her tricycle seat and took out a protein shake as Blobby-mort sucked up all the fentanyl mist like he was sucking the souls of small children on a Tuesday afternoon at a little league game. Becky came in shortly after that, and they all simply sat together. \n \n“We did it, Sue…”, Becky remarked as she began to play the violin outro music to this endeavour. \n \nPuppet Sue took a swig of her delicious and nutritious protein shake and sighed in relief and enlightenment. Then she looked into the camera and said, “I’ve finally done what I was put here to do, and DESTROYED the glee club. Use code CHEERIO for 15% off your first protein shake order now.”\n \nSue downed the rest of her shake before wiping the excess of the corners of her mouth, satisfied that all was now right in the world. \n \n“And \n\nthat’s \n\nhow Sue, C’s it.”",
	"45745369000": "They had been dating for barely three weeks and Ginny could not be happier. She was in a better mood than she had ever been but there was one downside to dating Harry. Everyone seemed to be interested in him and now that she was with him, she seemed to be under a lot of scrutiny too. It appeared a lot of girls thought she wasn’t good enough for him. She tried to not let it get to her but it was getting difficult.Ginny was in the Clock Tower Courtyard, sitting under one of the arches when she saw Harry making her way toward her. However, he was stopped by a group of Ravenclaw girls from her year. He had garnered extra attention now people thought he was the Chosen One. Ginny knew he was, but she knew most people did not understand it was a burden, not something to fawn over.Ginny focused back on her Charms book but kept glancing at him. He met her eyes but remained talking. The girls were all giggling. When a girl touched Harry’s arm, Ginny had to resist rolling her eyes, they weren’t even being subtle.Ginny looked back down at her book, it was not worth brooding over. Then she heard two girls pass behind her.“Oh, look, it’s Harry. Can’t believe he’s dating that poor freckly girl, Merlin knows what he sees in her. I think it’s rather pathetic,” one whispered to the other.Ginny whipped her head around and shot them a murderous look. They looked shocked she had overheard them. She thought about hexing them but it was not worth the detention. She shoved her book in her bag and slipped off the ledge. She took off towards the Wooden Bridge, no longer interested in waiting for Harry.“Hey, Gin! Wait up!” Harry shouted as he ran after her.Ginny did not stop to wait for him. Instead, she walked on, her hand tightly grabbing the strap of her bag.“Ginny!” he shouted again, now sounding rather annoyed.She was almost at the end of the bridge when he finally caught up with her. He grabbed onto her shoulder and turned her around.“What’s wrong?” he asked.She was avoiding meeting his eyes. “Nothing,” she said, walking on.Harry caught up with her again and dragged her behind the corner of the bridge, out of sight of the other students.“Is this about these girls? They were just asking about some Potions homework,” Harry explained.Ginny finally met his eyes. “Yes, that really seemed to be their only intention,” she shot back.Harry sighed as he ran his fingers through his hair. “Look, I don’t know what their intentions were, because I don’t care,” he defended himself.Ginny looked towards the ground. “It’s not just that,” she mumbled, crossing her arms.Harry asked her to explain.“Everyone thinks I am not good enough for you. They think you took pity on me and my ugly freckled face like I am a charity case.”Harry’s hands landed on her arms and bent down so she would meet his eyes. “I don’t take pity on you, I think you’re really cool,” he told her.Ginny was still too upset to smile but it seemed to amuse her slightly. He lifted her chin with a finger.“You are not ugly, ask any guy. The only reason they don’t pursue you is because they’re terrified of your bat-bogey hex. You’ll have to thank Slughorn for that,” he told her.A smile was starting to appear.“And personally I think your freckles are really cute,” he added, kissing the bridge of her nose where there were the most freckles.Ginny wrapped her arms around his waist and sighed. Harry put his arms around her too.“It is really difficult to date you,” she complained.Harry let out a chuckle. “Are you ready to give up on me then?” he asked her.Her arms promptly tightened around his waist. “Absolutely not!” she told him firmly.“That’s my girl,” Harry replied grinning.Ginny looked around them to check if they were in anyone’s view. When she saw no one was around, she grabbed him by his shirt and pushed him up against the wall and kissed him. When their lips parted, Harry looked at her completely in awe. He pulled her close and kissed her again.",
	"45745339000": "Harry had just sneaked out of the Gryffindor dormitory, wearing his invisibility cloak as he walked through the halls. Only a few older students were walking around as it was already getting late, most returning to their own dorms. Harry however, was heading to the Slytherin dormitory, intending to meet up with his boyfriend.Theodore Nott had approached him in the library one day, starting simple small talk. He had been shocked but the older boy was nice to him during their talk so he hadn't been against the talk. Or all the other random talks and following meet ups they had afterwards. They had been talking almost daily when Theodore had asked him out for a date. As they had grown closer, he accepted without any second thoughts or doubts. The older boy had treated him so sweet, it was an amazing date. Soon after they decided to date, only in secret as they both agreed on waiting till things are more stable between them before telling their friends.They had been dating for a month now and Harry was happy. They often went to meet each other near the Slytherin dormitory, spending some time together in empty class rooms or sneaking outside sometimes as well. But they always made sure to never get seen. Tonight Harry had planned to ask for them to be official, wanting to tell his friends about their relationship.He stopped in front of the Slytherin dormitory, peeking inside when one student opened the secret dorm. He could hear people talking and smiled when he heard Theodore's voice as well. But as he listened more closely the words got clearer and his smile died right away.\"You should have seen his smile! He really thought I like holding his hand. He really is so naive!\" He could hear Theodore joke. \"Just a bit more and he will do anything I ask from him. This game is so easy. Pansy, get ready to pay up. I'll manage to get into his pants before Yule comes.\"He could hear laughter following the statement before the door to the Slytherin dormitory closed in front of him. He was shocked by what he just heard. Theodore's words meant that everything was all a lie, that the boy had just approached him because of a bet. Had he really been that easy to woo? He tried to remember their dates, wondering if there had been any signs of everything being a lie but nothing came to his mind. He had really thought everything was real and that he was wanted. His breathing started to come in fast little puffs of air, his mind finally realizing that he had made a complete fool of himself. He had been played with all alone. His eyes started to sting but he refused to cry now. He couldn't break down while still standing in a hallway.Taking a stumbling step back, he collided with a person who was apparently on their way to the dormitory. Cursing, he turned around and looked at Draco Malfoy. The blonde was scowling while reaching out and somehow managed to yank down the hood of his cloak.\"Potter?? What are you doing here??\" Draco asked loudly and he quickly pulled the boy into an empty room nearby, scared someone could see him. He couldn't handle talking to people right now, especially since he had just heard that his relationship was fake all along and he was pretty close to an emotional break down.\"Don't scream like that!\" He tried to scold but his voice was shaky and heavy with emotions. Take a deep breath he tried to calm down, leaning against the cold stone wall.\"Don't tell me what to do Potter! Why are you hiding outside the Slytherin dormitory? What are you planning? Did you try to sneak in and cause trouble?\" Of course Draco would assume he was there to cause trouble. No one knew about him and Theodore after all.\nBut wait- Didn't Theodore just flaunt about wooing him to all the Slytherins? So why would Draco assume he was there for trouble?\"If you really need to know...I was there to see my boyfriend. Or should I say fake boyfriend.\" He spoke, trying to sound angry but honestly, he was just sad and knew it was apparent in his voice.\nHe waited for Draco to start laughing in his face but all he got was a moment of silence and a frown.\"What boyfriend? Why fake? You're not making any sense Potter. Is that a lie to keep me from reporting you to Snape?\" Draco asked with a scowl.He frowned and looked up at the blonde, trying to find any hidden emotions that could show if Draco was playing with him, pretending not to know. But the boy just looked really confused and still somewhat annoyed with him.\"Theodore Nott? We've been seeing each other for a while. Always meeting in secret. He just told everyone about how he will get into my pants soon. Like it was a game.\" He admitted softly, looking back down on the ground. \"Are you trying to tell me you didn't know? He basically just yelled it through the dormitory. And everyone was laughing like it's a great joke. There you go! That's what happened. If you want to have your laugh as well, go ahead. Now is your chance Malfoy! But make it quick please so I can head back and have my well deserved break down.\"He jumped when his words were followed by a loud crash. Looking back up he saw Draco had pushed over a table and was now cursing loudly. It confused him a lot to see Draco angry over this. Why wasn't he laughing like the others? Wasn't his whole existence a joke to them?\"How dare he??\" Draco screamed, making him jump again and looked around nervously. \"He knew! I told him everything and still...\"\nHe frowned when Draco's words trailed off. The blonde made even less sense that normal.\"Why are you so angry?\" He blurted out, not able to stop his curiosity. \"And who knew what?\" He added as the former statement had really confused him.It took a moment before Draco actually turned to look at him again, anger still clear on his face. The blonde leaned against a table, sighing softly before finally speaking again.\"Nott knew that...\" Draco started before stopping again, seemingly thinking about what to say next.\"Come on Malfoy. Whatever it is can't be worse than this.\" He spoke, making wild gestures with his hand as to indicate he was talking about his own situation. \"Just tell me please. I won't laugh. Promise!\"\nUsually he would take any chance he got to laugh at Draco but he was still too hurt right now to even think about finding anything funny.\"He knew that I like you, okay!\" Draco screamed before crossing his arms. \"I told him quite a while ago. He just grinned and told me to think about if I really want you. I didn't know he would...\"He looked at Draco in shock, not really knowing how to react. He hadn't expected to get a confession from the person who usually spent all his free time bullying him. They were enemies!\nNarrowing his eyes he stepped closer, stopping right in front of Draco.\"Are you trying to trick me now as well? Is this part of this stupid game? Is everything just a stupid joke to you??\" He screamed, getting angry now as well. It was already bad enough that Theodore Nott had played with his feeling but now Draco wanted to join in as well? \"You know what, don't answer that. I'm leaving now!\"He turned around to walk away, already almost at the door when a hand wrapped around his wrist and pulled him back. He stumbled a bit but managed to stay upright.\"Wait! Potter- Harry please. Just listen okay?\" Draco started and he almost sounded like he was pleading with him. No, that couldn't be right. Draco Malfoy never pleaded with anyone.\nHe wanted to pull his wrist away but instead turned his head to glare at Draco. The pain he saw the those grey eyes made his anger falter, adding more to his confusion.\"Just...wait please.\" Draco said again. \"I know this must sound like another trap. I know okay! But...I'm not lying! I really didn't know what Nott was planning. I might be the reason for his stupid game but...I would never...\"He frowned when Draco stopped talking again, wondering if he would really put his trust in those words. He had trusted Theodore Nott as well and he now knew how much of a mistake that had been. He had been too open, had given his heart away too easily. Maybe he did deserve the pain after being so weak to his own feelings and his need for some romantic company.When he stayed quiet Draco started to talk again.\n\"You don't believe me right?\" The blonde asked softly. \"I can understand...I wouldn't trust myself either after all that.\"He sighed softly, looking away from Draco. He couldn't deny that Draco was acting really different from usual and his reaction to hearing what Theodore Nott had done was a lot and didn't look staged. But his hurt heart just wanted to guard itself, wanted to avoid further hurt. A part of him knew that he could never be really sure what people's intentions were towards him. Most just saw the boy who lived, never the boy who was abandoned.\"Prove it.\" He spoke and looked at Draco. \"Prove that you're not lying to me. That you aren't part of this game.\"\nHe wasn't sure why he gave Draco a chance but something inside those grey eyes made him feel the need to give him a chance. Merlin, he really was too soft, too easy to sway.\"I- yes?\" Draco asked and slowly a smile started to appear on his handsome face. Wait- since when was Draco so handsome? And where the blonde's eyes always glowing like that when he smiled? Harry could only stare for a moment before shaking his head.\"To be honest, I don't know why I let you sway me.\" He admitted. \"And I'm probably setting myself up for more hurt here.\"He would have probably said more but suddenly a pair of arms wrapped around him, pulling him into a warm embrace. His hands hovered in the air as he blinked in surprise, not knowing how to react. A part of him, his traitorous heart, wanted to learn into the touch right away but another part wanted to push Draco away.\"I won't hurt you...I promise. Just give me this one chance. It's all I ask for. I will prove to you that I mean every word.\" Draco spoke softly, his words a bit muffled as the boy was speaking into Harry's unruly hair. \"I can start right now if you want? With the proving I mean. Part of me really wants to punch Nott right now. Let me show you that he didn't tell me anything.\"He hesitated while slowly placing his hands to rest on Draco's sides, sighing softly. He knew he shouldn't, knew this wouldn't end well. It was all so sudden and didn't make any sense to him either. But how much worse could things get? There wasn't anything more he could lose really. Well besides that tiny amount of dignity that he had left. It got even more impossible when Draco gently pulled him closer and started to rub his back. Had Theodore ever been this gentle? Sure, they had been holding hands and hugged as well but neither had made him feel this secure and safe. It could just be his need for affection that made everything seem better but he felt different with Draco.\"Alright, one chance Malfoy. Only one. If you mess up I will let Hermoine have her fun with you.\" He said, pulling away slightly so he could look at Draco properly. Draco was looking down at him, smiling gently while nodding. It was getting harder to doubt his decision when Draco seemed so happy about it.\"Can we start by calling each other by our first names? Call me Draco?\" The blonde asked and he nodded with a small smile of his own. This was already feeling so weird just to think about calling the other Draco out loud.\n\"Let me show you the Slytherin dormitory. I will choose a completely different approach from what you're used to. I won't hide you.\"He was surprised by the sudden suggestion. Theodore Nott had always made sure no one would ever see them together. They didn't even talk when they weren't alone, always hiding everything with the excuse that no one would ever understand their relationship. Maybe that should have already made him realize that something was wrong. If Draco wanted to walk around with him now then maybe this was real now. He didn't want to get his hopes up at all but his heart wanted this.\"Alright, let's go then.\" He said softly, taking a deep breath to calm down a bit, feeling nervous as he had to face Theodore Nott as well and admit that he knew everything now. He looked back at Draco when the other took his hand.\"Is this okay? I don't want to push you to do something. I just thought...if we walk in...this will help?\" Draco said slowly, blushing a bit. He nodded slowly, smiling gently at how cute Draco could look. He never thought he would use the word cute to describe Draco.\"Yes, this is okay I guess. It makes us look like...we're dating?\" He asked hesitantly, not sure if that was what either of them wanted. Well technically Draco kinda confessed a crush but that didn't have to mean anything. And he himself had basically just had a breakup with his old fake boyfriend whom he would see again soon.\"I like the sound of that.\" Drado admitted, leading them out of the room and over to the secret passage into the Slytherin dormitory. They looked at each other and nodded before Draco said the password to let them inside. They could immediately hear people talking and his heart hurt when he heard Theodore's voice as well, sounding all happy and cheerful. His fake boyfriend apparently also forgot that they had wanted to meet tonight as well, too busy priding himself with his fake relationship. He could feel Draco squeeze his hand as they walked into the common room together. All the noise died right away, everyone starting at them in shock.\"H-harry? What are you doing here?\" Theodore Nott asked, getting up to walk over to them. \"What is going on here?\" Theodore looked at their joined hands and frowned, reaching out towards Harry but Draco stopped him.\"What does it look like to you Nott? I'm showing Harry our dorm. Do you have a problem with this?\" Draco asked before Harry could react. \"You will see Harry here more often as he gave me the chance to court him.\"He looked at Draco and could see him smirking at Theodore, looking rather smug when Theodore's facial expression moved from shocked to angry. He had never seen Theodore show so many emotions so openly when they were together. Only now he realized just how little emotion Theodore showed, only always having a charming smile.\"Harry? Is this true?\" Theodore asked, taking another step closer. \"What about us my love? Is this because I never introduced you to anyone?\"\nHe wanted to laugh at how Theodore was trying to act like they were real, trying to lure him back into all his lies and empty promises.\"Theo darling.\" He started with a sweet smile like he always did when they met each other in secret. \"We were never real my darling. Wasn't it such a fun little game? Pretending to date in secret?\" He asked, feeling Draco wrap his arm around his shoulders. He stood a bit straighter, looking directly into Theodore's eyes. \"Guess what? You can forget about getting into my pants now. Please spare us both the embarrassment of having to continue this talk.\"He couldn't stop grinning when he saw Theodore trying to find the right words, obviously realizing that he heard everything. Oh how he enjoyed to see the older boy so exposed right now. He could hear some of the Slytherins snigger before Pansy Parkinson called out.\n\"Guess you're not as charming as you thought Theo!\"He turned to look at Draco and smiled gently. \"Maybe we should move somewhere more quiet?\" He asked, just wanting to get away from Theodore Nott as fast as possible. While he acted all though in front of everyone, he was still hurting inside and the longer he had to stand there, the harder this was getting.\"Of course Harry. Let me take you somewhere else.\" Draco said and started to lead him away from the common room. They didn't get far before Theodore reached for his hand, trying to tug him back.\"Harry dear. It was only a joke between friends hm? It wasn't anything serious. Come on baby.\" Theodore started to sweet talk. \"Don't throw us away. I will even introduce you to my friends. We won't be a secret anymore.\"He clenched his teeth while Theodore spoke, angry that the older boy apparently still thought he had a chance. That he was still so easy to sway. He wanted to say something in return, curse Theodore for trying to play with him again but Draco beat him to it.\"Harry isn't available for your games right now. Or at any other time.\" Draco spoke firmly. \"Don't think this won't have any consequences Nott. You knew about my feelings for Harry. I won't let you get away with this nonsense.\"Before anyone could say anything Harry felt himself get pulled out of the room by Draco. He followed silently, watching the blonde closely. He would he lying if he said he had never looked at Draco closely, but it was the first time he didn't have to pretend to be annoyed by the other boy or look away fast. He had to admit that Draco was quite handsome, though he would have never guessed he would end up in such a situation. But here he was now, getting pushed down to sit on Draco Malfoy's bed.\"Sorry you got pulled into this.\" He spoke softly after a few minutes of them just sitting next to each other in silence. He didn't really know what else to say, feeling out of place and really embarrassed about the scene he had just caused in the common room.\"Please don't apologize. I did offer to come with you, didn't I?\" Draco said with a smile. \"Did...did this convince you? That I didn't know about any of this?\"\nThe question came slowly, almost hesitantly which made him look at Draco again. He couldn't stop himself from smiling when he saw how nervous and almost shy the other boy seemed to be right now. It was such an unusual sight but also so endearing.\"Yes. Yes it did convince me. And everyone looked so shocked as well.\" He spoke with the little confidence he had managed regain. \"I guess Theodore never thought any of us would find out. Him trying to save the situation was so embarrassing.\"\nHe smiled sadly, looking down at his lap.\n\"Where you really honest earlier? That you want to give it a try? Give...us a try?\" He asked gently, not able to face Draco as he asked this question. He would never openly admit it but he was scared of the answer. For all he knew, Draco could have already changed his mind again. He looked up quickly when Draco reached for his hand, holding it so gently.\"Of course I was honest. I still am. I really want to be by your side. I know things won't be easy, especially in the beginning. But I know we can overcome things with time and we can always do everything slowly. So...please give me a chance? Let me court you?\" Draco asked softly and he smiled before reaching out to wrap his arms around the blonde's neck.\"One chance...\" He mumbled while hiding his face on Draco's neck. He could feel lips on his hair as Draco pressed the most gentle kiss there. Closing his eyes, he slowly relaxed more and finally allowed himself to stop worrying so much. Maybe this day wouldn't be the worst day in this school year after all.~~~~~~~~~~~~They did make things official the next day. Harry had already told his friends when he came back to his dormitory at night, even confessing about his secret relationship with Theodore Nott. While Hermoine and Ron where a little bit sad that he had kept things a secret, they did understand him and promised to support him in the future. They didn't like Draco but after hearing how the blonde supported him and stood by his side made them accept their courting quite fast.\nThey did receive many weird looks when they were seen together for the first time, holding hands as they walked together to the first class they had together that day. He couldn't really blame people for staring at them as they were usually fighting or insulting each other. But he had to admit that it felt good to not hide for once, to not ignore the person he was dating. And he knew everyone would get used to them talking normally and occasionally even holding hands. It would just take a while and soon things would be completely normal again.Now he could smirk whenever he saw Theodore Nott watching him together with Draco, enjoying the upset look on the older boy's face. It wasn't really revenge as he was serious about Draco, but if it was revenge, then it would be the sweetest revenge he ever had.",
	"45745315000": "The lead singer of the enormously popular rock band the Marauders is dead.\nJames scrunches the paper and throws it in the hearth, letting out a sob.\n“James! Are you okay?” Sirius came rushing in.\n“What do you think?” he sneered back\n“Sorry, that was stupid of me.” He came over and placed himself next to James stroking his hair.\n“I'm sorry, it's just frustrating that I can't do anything, and I mean anything, without me getting reminded of his death. And now you are comforting me, whilst it's literally your brother we're talking about.”\n“I know, James, but his death affects you too. It affects all of us, and we all react differently. So yes, right now I'm the one stroking your hair, but you were stroking mine yesterday. It's okay for you to accept what you feel, give yourself the space you need.\n“How's Remus doing?”\n“James, did you even listen to what I said? Stop searching for other people to care for and acknowledge your own feelings. it's been only a week; you're not supposed to support others when you're one of the people needing support the most.”\n“I'm fine. I just want to help others. It makes me feel useful.”\n“You are useful James. How often do I- do we have to tell you that? You are useful, even if you're bawling your eyes out and smashing vases to the ground. you're James freaking Potter, your useful by just existing.”\n“doesn't feel that way.”\n“Then make it feel that way, because I'm not letting you help anyone but yourself right now.”\n“But-”\n“James.” Sirius said with a stern voice.\nJames knew he needed to shut up when Sirius asked him to, he knew Sirius didn't like acting like that, so he wouldn't make it harder than necessary.\nRemus and Peter walked in, their eyes red from crying. Not an uncommon occurrence these days, it had become a normal thing. Crying that is. Then sitting in silence, sometimes for hours. Staring at a wall, or just closing your eyes and not opening them until someone snapped you out of your zone.\nNo one said anything as Remus and Peter joined them in their hug. That happened more often as well, just holding on to each other. It felt like if they didn't, they'd fall apart. So, they sticked together, even though it was hard. They stopped talking as much, but the silence said more anyways. It said: “I'm here for you,” or “I'm here with you.”\nJames knew he'd have fallen apart without his friends. If there hadn't been anyone else, he wouldn't have had anyone to convince his brain they needed him more than he needed himself.\nHe would have drowned in grief.\nNot being able to block out the moment he heard.\nHe still remembers the phone ringing.\n\na week earlier\n“Sirius, your phone's ringing!”\n“Sorry, I've got my hands full, can you take it?” Sirius shouted from the other side of the apartment.\nJames groaned. “Isn't that just convenient,” He muttered under his breath. He hoped it would be Regulus. That voice, James would never get enough of it. So angelic, yet his words were borderline mean. James shouldn't get his hopes up. Even if he was calling, it would be for Sirius, so he could only listen for a few seconds. Regulus and James had tried to keep their relationship as secret as possible, knowing how Sirius would react, but at some point, the media caught a few moments between them. Some of their fans shipped them, and there were a few times that they kind of rolled along with it. When Sirius mentioned it, they would say something about the fans, and not wanting to disappoint them. Regulus was on a trip, with his other friend group, since the band didn't have anything on the planning at the moment.\nHe picked up the phone “Hello?”\nHe heard the person on the other side taking a deep breath, “Hello, is this Sirius Black speaking?”\n“No, this is James Potter. Sirius is available if it's urgent though, should I go get him?”\n“No, that's not necessary. I think it might be better if you deliver the news.”\n“Who am I speaking to again?”\n“Oh, sorry! It's Dorcas Meadowes.”\nHe recognized her name; Reg must've mentioned her. “Right, what's going on?”\n“Uhm, I don't really know how to say this. Something terrible has happened, and they think you should hear it from someone you know, but Dora is-” he heard a rustling sound on the other side of the line “She is not in a right state to tell you right now.”\nWhat did Pandora have to do with this? Was it about Reg? “Please just tell me, I'm starting to get really nervous.”\n“Sorry,” Dorcas took a deep breath, “It's about Reg.”\nJames's mind went a hundred miles an hour. what happened? The worst of things went through his mind, had he had some kind of accident? Was he in the hospital?\n“Regulus is- he is dead” came from the other line. Dorcas' voice was thick, she clearly had been crying.\n“What?” he asked in disbelieve. He heard that wrong right?\n“He was murdered.”\n“No.” He heard a ring in his ears as his knees hit the floor. Everything faded away as if he was not really there anymore.\n“James?” he heard from the phone\n“Shit sorry, uhm, thank you for calling. I'll tell Sirius, is it okay if I call you back later? I- I just-”\n“You don't have to explain. James. it's fine, really. Just call when you're ready. I'll tell everything you want to know.”\n“Thank you”\nHe was sobbing, his breath hitching. As Sirius came rushing in, “Sirius.”\n“What happened? James, are you okay?”\n“No, Sirius, It's Reg.\" there is no nice way to tell someone their brother died, so James just said it. \"He's dead” he saw the expression in Sirius's eyes go blank.\n“Sirius?” he got no reaction. “Sirius, I need you to talk to me right now,” he said calmly.\n“No.”\n\"No?”\n“No.” Sirius snapped his gaze up to James; He took a breath “what happened?”\n“i don't know the entire story, but uhm- he- he was murdered.”\nJames hadn't seen anyone have so much hatred in their eyes as Sirius did in that moment.\n“Murdered,” He repeated in disbelieve with a threatening undertone in his voice.\n“Sirius please think twice about doing anything you'll regret later.” He knew Sirius, and he knew he didn't handle these types of situations well.\n“Yea, ok.”\n“That's a start, now mean it.”\n“I don't think I can mate.”\n“Oh, Sirius,” James muttered as he tried to keep Sirius from falling to the ground as he broke down. He cried and screamed and tried to break free from James' grip. Until he gave up and continued sobbing on James's shoulder for another hour. Sirius went through basically every emotion James could name in one day.\nAfter that, he started doing everything he did on a normal day, pretending as though nothing happened, with breakdowns when he failed to keep his mask on, but he knew how to hide those from everyone else. James knew though. Because he knew Sirius. He could barely help him during those times.\nHe tried, but he kept failing, not being able to help Sirius. It felt awful. It felt like he was failing him. Sirius. But Regulus as well and that felt arguably worse.\n\npresent\nHe didn't know where to get the energy from anymore.\nUsually they would have something to do with the band, that was where James put all his energy in.\nTheir band. It would never be the same again, not without Reg. And hat was apart from looking at it like they were missing a lead singer, technically Sirius could fill in that gap. Normally Sirius and James would play the bass, Remus could too, but he said he'd rather stick to the keyboard. Making funky sounds. And Peter was the drummer. This wasn't about the technical side though. This was about them losing someone in their family, one of their friends. Someone James loved.\nLoves.\nHe will love that stupid git forever, He'd be wrong if he thought getting murdered would mean that James wouldn't love him anymore.\nHow dare he.\nHow dare he leave him behind.\nHis Reg, dead. No, murdered even.\nJames felt the anger rising.\nIt was the moment he decided he would find the person who did it, and he would make them regret it.",
	"45745153000": "Theo had a type. Blondes over brunettes, petite and fragile women over the tall and muscular ones. He fancied slim necks adorned with white, lace chokers, milky skin without freckles or acne scars, slender calves, tiny feet and small breasts that could easily be covered with his hands. But more than anything, he adored hairless bodies. No matter how beautiful and cute the girl was, if he noticed even a shadow of hair on her forearms, legs, fingers or, Merlin forbid, a chin, he got turned off instantly. Daphne was perfect in this respect. To be honest, she was flawless in many ways. And at the same time she appeared truly nightmarish in plenty of others. Even so, Theo loved her to the fullest, not giving a shit about any of her quirks, so he proposed to her. He expected a lot of things (Daphne has many traits, yet predictability wasn’t one of them), but definitely not \"Oh. I'll think about it.\"So she had. For five fucking years (not that Theo was in a hurry or something; there was clearly nothing for her to think about, that's all). And then, three weeks after the wedding, she teleported to Rome with a guy who they'd got to charm frescoes in their bedroom. It was her idea, those frescoes. So were the stained-glass lancet windows. “It's going to be like in a cathedral here,” she used to say. \"Have you never had this fantasy? That you're having sex on the altar? With all these saints watching your cock being swallowed inch by inch by my wet mouth?\" And now it was him who had to wake up with a cherub's naked butt above his face and listen to sermons of bearded old men with halos whenever he swore or reached into his pants for his own entertainment. After a few months when it finally became clear to him that Daphne wasn’t going to come back, he wanted to work it all off. But the bloke must have used some really complicated protection spells because nothing could get rid of it; it was even immune to wall-breaking charms. They shelled out a lot of money for this bedroom, he couldn't afford to hire another specialist, so in the end he left everything as Daphne had designed it.The whole situation amused Smith.\"I didn't know you were such an exhibitionist,\" he said when he came by to collect the books he’d lent Theo earlier. \"Do you enjoy being watched when you take your pants off? Shall I follow you next time you say you're going to take a piss?”\"Bugger off. It was Daphne's idea.”Smith chuckled. Not like a good friend, not like a kind acquaintance and definitely not like somebody who understands the feeling of loss. There was always something derisive and contemptuous behind Smith's smiles.\"One has to admit to one thing. She has a taste. Let me guess, in the kitchen you have The Last Supper hung, don't you?”\"Get your fucking books and be so kind to fuck off,\" Theo grumbled as he shoved a translation of a goblin classic and several obviously battered volumes into Smith's hands.“Not so fast.” Smith eyed the titles quickly. “Some of them are missing.”“Which ones?”“Sand’s book of poetry. Wilde's fairy tales. Macbeth. And Shakespeare's sonnets.”\"Daphne might have taken them with her. She had a soft spot for such Muggle rubbish.” In fact, Smith wasn't even Theo’s friend. It was Daphne who had introduced them to each other. One evening she came back tipsy from her sister's birthday party and said: \"I want to go to The Silver Serpent.\"Theo sized her up: her creased clothes (paying special attention to the wine stain on the left sleeve) and her makeup, which was lacking the freshness and precision from a few hours ago.\"You’d better visit the bathroom first.\"Daphne gave a theatrical sigh, kicked her shoes off and sat down across from him. She bent over the table and pushed the books away.“Come with me.”Her breath smelled like The Green Fairy and that strange, irritating aroma that permeated everything in Malfoy Manor, starting from pillows, through cutlery, ending up with elves. He hated that fragrance.“No, thank you”. Barely had she pulled a face (the corners of her mouth had gone down as though she had been about to cry), when he added more softly, \"Take Astoria with you.\"\"Astoria won't go anywhere without Malfoy, and he'd rather get his arse beaten by a Blast-Ended Skrewt than set foot there. Besides… Uhm, they were kind of busy when I left them.”Her cheeks reddened noticeably. Was she someone else, such a reaction could mean that Malfoy and Astoria got engaged in passionate foreplay in front of her. However, sex didn't embarrass Daphne. She could talk dirty in public, without stuttering, in a way that made him blush, or browse Playwitch on Knight Bus with such a composure that everybody would think it was Daily Prophet. What abashed her were the little gestures of affection: passing peas to someone first rather than putting them on your own plate or exchanging glances during a boring story. Theo found it extremely cute.\"I don't want to go alone,\" she added as Theo tried to go back to reading what he had translated before she came home. \"Pretty pleeeeaseee?\"\"Why do you even want to go there? It's not a club for girls.\"\"That's exactly the reason why!\" Daphne's finger went dangerously close to his eye. He blinked. \"Who said girls can't visit gay clubs, huh? You know, I could be into men going down on each other. Why–?\"\"What did Astoria tell you? Malfoy is said to kiss Potter's arse, but I doubt you should take it literally.\"“—can you go to the strip club and I can't go to the gay one?! How are my fetishes worse than yours?!\" She finished, digging him dramatically in the chest.\"I don't go to strip clubs,\" he pointed out calmly.She rolled her eyes. \"I know. But you could, and no one would say anything. Including me. Actually, it's even sexy... We could go there someday.\"Theo gave her half pitying, half tender look.\"Go to sleep. You’re drunk.\"\"Theeeeeoooo!\" She nearly laid down on the table to grab his collar. It was hard to tell what she was going to do because she was too drunk and the material slipped from her fingers. Theo straightened his back, avoiding her touch.\"You may find it exciting, but, truly, it disgusts me. What am I supposed to do in a place like that? Puke?\"“My Scourgify is second to none. I'm sure I can handle your vomiting.\"In the end, Daphne had her own way. She kept pestering him until he agreed to go. Of course, it was a bizarre and unsettling place. In many ways similar to normal clubs, yet completely different. What disgusted Theo the most was the presence of guys in skimpy clothes which weren’t decent enough to hide sweaty skin full of springy hair. When one of those oddballs passed him on the way to the bathroom, Theo nearly gave his back a wipe-down. The wizards making out on the dance floor made the world feel horribly wrong, dirty; as if someone had tricked Theo before, hiding it from him. Theo was lucky to have Daphne by his side. Even rumpled, with her hair messed up, she was pretty, feminine and smooth.Suddenly she grabbed his neck and was pulling down until her mouth met the level of his ear.\"I see a friend! Let's go say hi!And she began to push her way towards the settees. Theo followed her reluctantly, checking out the place where she was heading. No familiar faces. Thank Merlin! He would die if it was someone who knew him.\"Who did you see?\" he asked as they stepped off the dance floor and a wave of soundproof charm hit them. Here, in the sitting area, the music was only a quiet, moody background.\"Zacharias Smith,\" she replied. \"Do you remember him from Hogwarts? He was a junior to us.”He dodged the turquoise drinks floating in the air. “Not really.”“Hi, Zacharias!” She waved to a tall, young, blond wizard who had just finished talking to someone and was getting up from the settee. Luckily for Theo, he didn't look like one of those guys shaking their bums on the platforms.The first thing Theo noticed about Smith as they approached him to say hello, was the fact that Zacharias Smith had hardly any body hair. He had a good head of sandy blond hair (styled as if he’d rolled right out of bed that way, but Theo knew such a look was impossible without the right spells), and his eyebrows were thick enough to make his gaze expressive, but apart from this, he seemed amazingly smooth. And it's not that he was using some depilatory charms like Daphne. As he shook Theo's hand, Theo spotted in the club light a few glimmers of gold on his forearms.\"Look who the Kneazle dragged in,\" Smith said smiling. There wasn't even an iota of sympathy in his tone, though. \"Did you follow me all the way here?\"Daphne rolled her eyes.“Don’t flatter yourself. You’re insulting my husband in spe.”\"My goodness. What a wretch agreed to marry you? I shall send him flowers.”\"No need to do that,\" Theo said, putting his arm around Daphne’s waist. \"I don't really like them.\"Smith’s eyes moved from Daphne to Theo. He wrinkled his nose as if he smelled something bad, but a polite smile never left his lips.\"In that case, there are many anniversaries of disappointment awaiting your future wife.\"\"Flowers for anniversaries are sexist propaganda,\" Daphne said. \"I prefer a quick bang before breakfast. Now I remember, you’ve been talking recently about a book that was banned by the ministry.” She looked at Theo and pushed stray ringlets out of her face. Earlier that evening she had let fairy dust (generously sprinkled on the dance floor) fall on them, and now her hair seemed luminous and drizzling, as if covered with soft silver. “And Zacharias can swing anything for anybody”.\"Not anything,\" Smith corrected her immediately, \"and not for anybody, but almost. For the right price, of course. What's the title of the book you’re looking for?”Theo gave him the name of it, expecting nothing. After all, he’d pulled a few strings himself before and still had got nowhere. However, two days after their encounter in the club, Theo got an owl from Smith. Somehow Smith had managed to put his hands on the book and would be waiting for Theo at The Hog’s Head at seven on Wednesday. Theo felt relief it wasn't in The Silver Serpent or somewhere like that. After that disgusting evening, he’d fucked Daphne twice: once in the hall and once in their bed. And then he’d woken her just before dawn for another round. But nothing could make him feel less dirty or get him to forget all those scenes from the club. He’d been dreaming about it all night. Only for this torment Daphne owed him this stupid wedding.When he reached The Hog’s Head, Smith hadn't been there yet. At least that's what Theo thought at first. Only when he ordered a beer (in a glass so dirty that he decided he wouldn't drink it even if his lips were going to crack from dryness) and sat down in the back booth, did he spot him in the dark corner of the second room. He was about to approach him when Smith noticed him as well. He wasn't alone. There was a young wizard accompanying him. He was sitting with his back to Theo, so Theo had no chance to see his face. Smith leaned towards his companion and said something in his ear. Then he grabbed his wand from the table and started walking towards Theo. He had that kind of confident, a little arrogant gait of someone who knew where he was going and was in no rush. Probably because he was tall, fit and filled his robe as well as Madam Malkin's mannequins did.\"I see you and Daphne don't share the concept of time,\" he said instead of greeting. He pulled out the chair across from him, sat down, took out his pocket watch and looked ostentatiously at it. “Five minutes ahead of time. That's forty minutes faster than I’d expect from your lovely fiancée.”\"How did you get this book? I've checked every possible place, even the old Hogwarts dens—“Smith straightened in his chair, wearing an expression of ineffable smug self-satisfaction.“It's easy. You were a Slytherin. Your name has a negative connotation. Obviously, thanks to your father — may he serve his sentence in peace. Do you know how people react when I tell them which house I was sorted into?”Theo shrugged.\"With trust and kindness. Hufflepuffs can't be up to anything and Potter has a scar on his forehead. Undermine either of above-mentioned and the world falls apart.”Smith smiled. And it seemed to Theo much more genuine than the kind smiles he'd given him earlier. Maybe because there was nothing nice about that grin. Theo smiled back.Smith cleared his throat. Theo forgot the beer was in a dirty glass and lifted it to his lips.\"Okay, let's get down to business. I'm actually in the middle of a date. Here is your book.” He drew from his pocket a small, rectangular box that could fit nothing bigger than a ring.\"You don't look gay,\" Theo blurted out.Smith had delicate, perhaps a little feminine facial features, but there was nothing girlish about the way he behaved or spoke.\"Have you forgotten where we met? Besides, you don't look heterosexual either.”Theo was so indignant that he almost spit out his beer through his nose.“What's that supposed to mean? What does a heterosexual look like?”“Exactly my point. I'm just lending it to you.” He tapped the box with his index finger. \"It's the only copy in the whole of England that isn't in the Department of Mysteries.\"“You’re kidding me. Borgin swore he had two last week.”Theo moved the pouch of Galleons across the table. Smith caught it halfway and slipped it into his coat as naturally as if he were simply stretching.“He’s probably stalling. He may have got a forger’s digits and thought he could palm a fake off onto you. If you need anything else, send me an owl. And in case it's urgent, you can always try to find me in The Silver Serpent,\" he added with a mischievous grin. He got up and once he turned his back to Theo, he froze. He glanced at him over his shoulder. \"Oh, and don't get caught reading.\"\"Yeah, yeah, my lips are sealed.” Theo raised both his hands above his head.\"That's not the point. Don’t show it to anyone. Not even to Daphne. I put a spell on this book. For my own safety. I hope you understand.”A month had passed before Theo got in touch with Smith. For the sake of returning the book, of course. He didn’t intend to keep seeing him. But he got another extra job, an old blood curse to be broken, and he needed access to an illegal volume again. And after that case another one came, and then another one and another, and before he knew it, there was no one (but Daphne) who Theo was seeing more often than Smith. One day, during one of their conversations, Smith blurted out that he had a huge library under his house.\"My grandfather requested it from the Queen,\" he said, clearly boasting. “One copy of each book which has ever been published in English. The Minister of Magic added quite a few of magical ones as it was in the best interest of both parties.””You’re lying. I've never heard of any Smith.”“That’s because he worked undercover, you moron.” He gave him a pitying look from behind the novel he was paging through in a calm manner. He rested its cover against his thighs and his own calves against the table top. He hadn't even taken his shoes off (if it had been in their flat, Daphne would have cursed him, she knew some really useful ones). \"They don't teach kids about that in History of Magic. Neither Ministry of Magic, nor the Muggle government want to make public their secrets.\"Theo didn’t believe this story, but when it came to ordinary books, Smith really had everything. From fiction, through science books, lexicons, dictionaries, reference books ending up with some ancient journals. And since Theo officially worked as a translator, he often needed something and Smith lent it to him. To Theo’s surprise — for free.\"Keep your fiancée away from me and we'll be even,\" Smith said when Theo expressed his astonishment. \"I get sick whenever I see her.\"“Interesting. She has the entirely opposite opinion of you.”\"And that's exactly what terrifies me! Perhaps she thinks that if she latch onto me, I'll get distracted and don’t notice she has tits.”Theo laughed.\"Believe me, that's not her goal at all. She would rather you didn’t notice she's in the same bedroom as you when you jump into bed with your date.”Smith pulled a face.“Disgusting.” Theo didn't know much about male beauty because he was a man himself and of course men don't discuss such things and have no opinions on them at all. But if anyone had asked him what he thought about Smith’s appearance, he would have said he was a handsome fellow. And judging by the way the girls were looking at Smith as they were sitting at the bar right now, he was not alone in thinking so. Women seemed to like this type. Slender legs whose perfect length allowed them to be held in a casual manner, long fingers that made everything they touched look elegant, thick eyelashes curled at the slightly lowered outer corners of the eyes, giving his gaze a little bit of melancholy and character, pale skin contrasting red lips (as if he had literally just rubbed pepper onto them).Theo didn't remember how they ended up in a Muggle bar. It all started with Daphne throwing a tantrum (she was excused, as he realised with a pain, he had forgotten about her performance) and flung him out of their flat. Theo was going to wait until she was ready to forgive him in the Leaky Cauldron. There he bumped into Smith, who was doing some shady business in the corner, as usual. This time he was accompanied by two girls. The red haired one had a hand on his thigh and Smith was kissing the fingertips of the other one at that very moment. Theo didn't know how to react to that, so he sank his lips into his drink, observing a turn of events. They’d been whispering for several minutes. Then Smith stood up, leaned down and kissed each of the girls practically on the corner of their lips. The girls said goodbye to him, smiling broadly, and Smith headed to the door. Although he had to pass Theo on his way, he didn't seem to notice him at all. Theo reached out and gave a pat on his shoulder before he was passed by completely.“Girlfriends?” he asked, pointing his glass at the women Smith had just left.“More like clients. I'm swinging them something. What are you doing here?”“Daphne.”Smith looked at him with a slightly raised eyebrow. Somehow he didn't look like an idiot, doing that.“She kicked me out of our flat”.“Oh.” Smith sat down next to him and gestured to the bartender for a round. \"You're not blubbering over the ring, so it's nothing serious, is it?\"“I won’t know till tomorrow. She’s not a predictable woman.” He’d already been drunk. And since the alcohol loosened his tongue, he blurted out, \"If you don't like girls, shouldn't they disgust you?\" Smith raised his eyebrows higher, so Theo added, \"You know, earlier you and those girls—\" He made a vague gesture with his hand.The corner of Smith's mouth twitched as though he had been a child getting ready to prank someone. He reached out and placed his hand on Theo's shoulder in a friendly and a very ordinary way.\"Do I disgust you, my dear friend?\", he asked.“No.”Smith’s hand slipped down the sleeve until it reached the bare skin of Theo’s wrist. It didn't stop there, though. It only brushed it, because its aim was the glass in Theo's fingers. Smith grabbed it and took a sip from it.\"You've drunk too much,\" he said. \"Come on, I'll take you home.\"But once they were out in the street, Theo didn't want to go back anywhere. So they wandered around magical London for a while. At one point, he blacked out and when he woke up, he was in a Muggle bar with a glass half full of vodka. He looked at the row of empty bottles next to them and said seriously:\"I don't think I have enough Muggle money.\"Smith chuckled.“Me neither. But you know what? Magic is might.” As if nothing had happened, as if some drunk students weren't making a toast right next to them, he confunded the bartender.“What are you doing?” Theo grabbed his wand and hid it under his jacket. He glanced nervously at the giggling group nearby, but the students seemed to be completely engrossed in cursing at some damn professor. \"If anyone had seen you—“\"They would have thought I am drunk. Take it easy.”Theo didn't know why he did what he did next. He excused himself, telling himself it was all because of him being drunk and drunk people had all sorts of weird ideas. For example, Blaise once took a shit to the flowerbed. And Daphne tried to flush herself down the toilet.Theo looked at Smith's mouth. Not from a distance where he could easily get away with it. Up close. Like really up close — they were almost nose to nose. It's weird, but Smith’s lips looked soft and tempting, not like…\"I bet,\" that inviting mouth said, parting just a little, \"tonight you’ll be dreaming of kissing me.\"It was like a slap.“I am not gay. I have a fiancée and… I love her.”Smith smiled. And there was more sadness than its usual pity in it.\"I didn't say you were. It's obvious you like girls. But that doesn't change the fact that you've been drooling over my cock for a long time now. Sexuality is a spectrum. Homo and hetero are just two opposite poles. I guess you should think about that when you're sober.”He stretched out his fingers, those long, elegant fingers that made everything look beautiful, and lowered Theo's heavy eyelids.\"Now go to sleep. You were supposed to dream of me.”",
	"45745132000": "He can hear the pounding of his heart in his head, his breathing ragged and burning in his lungs, sweat dripping on his eyebrows, the cold air sweeps as he stopped, trying to catch his breath ,his bare feet caked with dirt and blood as thorns and sharp stones punctured the skin\n\nHe didn't have his wand, stupid thing to do when racing down the dark forest\n\nStupid to be even awake in the middle of the night, chasing down something then be chased around\n\nHe can feel something behind his back, tried to turn around to get a glimpse,but nothing\n\nThen there's a pull, he felt himself thrown in the air, he lands on his back gasping for air, his eyes wide, his ears ring, a shrill sound and the excruciating pain and then cold, as if his soul was sucked out of him then coldness again and then darkness…\n\n\n\n\n\n\n—-------\n\n\nJames woke up still feeling tired, sleep usually is his best form of rest yet for weeks all he had seemed to be restlessness , he did his routine and heads to class, sighing at the silence and sudden loneliness\n\nIt's only been weeks since the incident with the whomping willow and Snape and how one night and one mistake had tore them far apart makes James want to scream\n\nRemus would speak to him but would close off , he buried himself into studies and his prefect duties and James still wants to punch Sirius' teeth for all of this, but then James also can see how Padfoot is punishing himself, it gives a sinking feeling in James as he saw both his best friend and brothers fell apart and that poor Peter is also too anxious and nervous to talk to either of them\n\nThis is another day as he sat in class, missing the usual mischief they would go into, Sirius' witty jokes and Remus' one line comebacks and Peter's gossip, James tried to look for Sirius, but he hasn't seen a glimpse of him\n\nCome to think of it, he hasn't seen Sirius since this morning in the great hall for breakfast, he hadn't even checked if he's in the dorms that morning\n\nNow antsy James hurriedly picked up his things immediately stepping out of the classroom, sprinting down the hallways, suddenly feeling like everything is wrong, he rounds a corner and almost knock into someone, he immediately apologizes but still hurried away but was stopped by that someone pulling him\n\n\"James? Mate you alright?\"\n\n\"Oh god Moony! Sorry I…\"\n\n\"No it's okay, what's got you in a hurry?\"\n\nJames pretty sure he had this funny expression in his face and still feeling the unusual anxiousness\n\n\"Have you seen Sirius?\"\n\nRemus brows furrowed into a frown\n\n\"What's he done now?\" he asks a little harshly\n\n\"nothing, but I didn't saw him in class today or in the hall I didn't even notice if he's in bed this morning and I know, you both still…\"\n\n\" Breathe James, Yes we clearly still aren't talking and no I haven't seen him either\"\n\nThere was a little tensed silence between them and Remus was about to say something when Lily walked up to them\n\n\"Lupin,Potter,Professor McGonagall is asking for both of you\"\n\n\n\n\nRemus felt his stomach drop when Lily told that McGonagall is askit for both of them, he's already feeling a little queasy specially since this morning then added by James frantically looking for Sirius\n\nHe might have been a harsh when James asked if he saw him but the still hot anger melted into concern\n\nYes he's still angry, talking to Sirius, talking about Sirius or even anything about Sirius still make him want to lash out, because it still hurts\n\nThe betrayal felt like a knife lunged deep in his chest and twisted\n\nSirius was the one who made Remus lower his guard more, the one to tell him that his scars are part of him and not a grim reminder of who he is the one who would talk his ear off into recovery after every fullmoon, he made Remus feel the safest\n\nIt was like a bucket of ice cold when he woke up after that fullmoon and was told of everything the happened , told to him by Sirius himself\n\nHow could you?\n\nHow could you use me?\n\nWhy did you do it?\n\nAnd then Sirius just hung his head, not meeting his eyes, fists clenched\n\n\"I'm sorry, I'm so Sorry Moony\"\n\nAnd that was enough, Remus had enough\n\n\"Stay away from me…from now on, Stay away from me\"\n\n\"Moony–\"\n\n\"Don't call me that, you can't call me that, you lost that right\"\n\n\"I'm sorry, I'll do anything, Please\"\n\n\"Anything? Then stay away, I don't want you near me ever again Black\"\n\nHe had said that, venomously\n\nAnd since then, even in the dorms everywhere, Sirius did stay away, he was alone, he comes and goes, he would look when he thinks Remus doesn't know,he did as told\n\nAnd Remus felt the frustrating conflicted feeling of gratification and worry,\n\nHe wants to run up to the boy,shake him and tell him to take care of himself and stop with all this self punishment, and then there that satisfying feeling of seeing him devastated and hurt and knowing all the consequences of his actions and it makes Remus' stomach churn\n\nnow as James rambled about how he haven't seen Sirius since morning , it adds to the uneasiness that is crawling up Remus' skin\nThen Lily told them that McGonagall is looking for them\n\n\nAll three walked to where McGonagall had asked them to meet them, and if Remus and James are already at their wit's end , they've been tethering as they approached the hospital wing\n\n\nWhy the hospital wing?\n\nIs this about Sirius?\n\nIs he okay?\n\n\n\"Professor, they're here\" Lily announced\n\n\"Thank you Miss Evans\"\n\nLily have a nod and stepped aside not leaving the room, McGonagall looked at her with a silent question and she pursed her lips as she gave another nod, and if one pays a closer attention, her eyes are already red rimmed, McGonagall let her stay then\n\nShe looked at both boys, her expression neutral but her eyes are grim and there's a tremble in her voice as she spoke\n\n\"I'm sure both of you are curious why I asked you to be here,And it would be best if you see this for yourselves, I'm sorry but I can't think of any other means to tell this to you boys\"\n\nBoth boys looked at each other before following, they're at the very far end of the wing, there stood Peter with Marlene,with madam Pomfrey who's joined by McGonagall, in front of them is one of the hospital beds, curtains drawn\n\n\"Pete? Marls?\" James asked confusion masking the now fear in his voice\n\n\"Why are you guys…\" Remus wasn't even able to finish his sentence\nPeter just shook his head unable to speak as he choke on sobs and Marlene wraps him in a side hug as she cries\n\"What's wrong? What's going on?\" James is already impatient at this point\n\n\"Mr.Potter…\"\n\n\"Please, just tell us what's going on\"\n\nRemus cuts off, not wanting to be rude but he doesn't want to beat around the bush any further\n\nMcGonagall lets out a silent breath and looks at Pomfrey whose eyes are also downcast, she opened the curtains\n\nLike ice was poured on their bodies both Remus and James froze, eyes wide as they stare at the one lying on the hospital bed\n\nSirius…\n\nSirius is on the hospital bed, still in his sleepwear from last night, but it was torn, dirty,and bloody, his feet filled with wounds\n\n\"He was found by the lake this morning, I'm sorry boys\" Pomfrey says voice low\n\n\nSorry? What does she mean by sorry? Can't she do anything? She's the healer, can't she heal Sirius?\n\n\n\"He's gone! He's gone!\" Peter wailed loudly this time\n\n\"No…\" James denies\n\nRemus felt his world shatter, as he stares at the lifeless body\n\nIt can't be…\n\n\"No! No! Remus, Moony, this can't be right, Padfoot , Sirius is not… Remus! Why aren't you saying something, why are you quiet, this is…\"\n\n\" James… \" It was barely a whisper, as if all of his strength was shucked out of him\n\nWith the remaining will in his body, James went forward and takes Sirius' cold hand\n\nJames can feel his knees go weak and Remus tries to catch him and brace the fall but fell with him as James lets out a silent scream then a strained wail\n\nThe hospital wing was filled with painful cries, plea and denials\n\n\"W-who did it?\" Remus ,still clinging to James had his eyes on McGonagall\n\n\"Who killed him?\n",
	"45745042000": "It's a bit unusual in their dorm right now. Somehow Remus Lupin ended up in it. Looking as torn appart as he did the last days. When he and Regulus stupid brother stopped talking for whatever reason. Probably because Sirius abandoned them like he does with everybody and everything. They finally accepted that after all he is just a black.And after three days of Lupin looking like somebody nearly killed him and he's a living dead now, he came to him. To be more precise he came to him, Barty and Evan. The look in his eyes made it verry clear that there is an important reason behind this, so they decided to let him into their room.Now he is here and he seems to hesitate. Sitting uncomfortably on Bartys bed, his bag kind of slouched into itself. Like he wants to hide of being with them. Him the big Gryffidor, speaking with them the Slytherins, who are dirt to his feet. Or at least that is how the marauders usualy behaved about their relationship. And something seemed to be important enough to make him come here. Against his better kowledge. Poor boy. Or more idiot.\"Well Lupin we don't have all day, tell us what you want or leave.\"As usual Barty breaks the silence at first. Regulus just rolls his eyes. If it had been up to him he would have waited. And waited. Till Lupin felt awkward enough to break. He's the one wanting something from them. They have the power. But now the damage is done and it get's at least faster over. Because it is true. He has other things to do.\"I uh...well I.\", in any other time the older boy is very good with his words. From what Regulus noticed he could talk in quite a flow so that people like to listen to him, different than his brother or Potter. Who always scream way to much and are just generally annoying.\"Spit it out.\" and yes Regulus would have holded his breath for an eternity, for not giving up the higher position. But this was already broken by Barty and now his patience is getting lower. Especially when he sarts to think how this all could have been a prank of his brother just to get his nearly lover into a Slytherin dorm.\"I want revenge.\" Suddenly Lupins hole body changes. Like he made a decission to trust them and now he will stick with it. This is his way to go now, his hole back straightens and there is no fear on his face anymore. It is a typicall stupid Gryffindor move of putting everything in you have. If you asked Regulus he should defitnetly hold more back and don't give them so much information this easily.But he does. Idiot. Again.\"Good for you genius, don't we want that all. What has this to do with us?\" , he snaps back.\"Verry charming Black. Just listen to me. It is about your brother he wronged me terrible. Missused my trust in him a lot. I want to pay him back, to make him hurt as much as I do now. I figured to come to you. I thought if there would be anybody to make me help hurting him much it would be you. So here I am.\"\"What did he do?\", Evan asks calmly.And this is why it is perfect to have Evan in their group. Barty would have been to daring while asking this. Regulus would have sounded to much like he doesn't give a fuck. Which he doesn't to be honest. What his brother does or does not do is not of his buisness anymore. Well ok maybe in this specific situation he cares. But usualy he doesn't. Whatever.Evan on the other hand sounds perfect. He has enough caring in his voice so that Lupin doesn't feel like they don't take him serious. But this sounds cleanical enough to assure it is important for the following that they know about it.But it seemes like his brothers ex lover doesn't care for all these good reasons. His back goes stiff and he squints his eyes. There is no information coming from him.\"Good you won't tell us, fine. But what do you expect us to do?\"Now there is a scamming smile on his face. \"I thought the best way to get to him would be to make him jealous. I'd like to make an open invitation with this to you.\"Now there are different ways to read into this. Possibility number one he wants to have a relationship with him. Would be a smart move, nobody would hurt more that to choose the little brother over yourself. But Regulus came to often in Sirius second place. There is no way in hell he would do this out of free will again. Even if it is just some fake dating nonsense.Additionally to this there is this deal he made with Pandora. A deal in which he would work more on getting into something, anything really with James. She can't stand his and this is a quote \"sad boy poetry\" anymore. So she forces him to go after it instead.So no dating with him and the boys know this as well. They each turn their head to each other and you can see the same thought in their head.Option number two.For various reasons it won't be possible to just date Barty or Evan. But even better they could be a ménage-a-droit. And in their eyes you could see how they love it. Barty more, he looks like he wants to jump onto Lupin. But Evan is interested aswell. Good for them.They all turn to Lupin again.\"I think you made yourself a deal. Evan and I are going to be your new partners.\"\"Congratulations on that, you will want to hex yourself pretty quickly.\" Regulus only adds to it.If the Gryffindor is surprise by this he doesn't show it. He quickly nods and than leans himself foreward. \"How do we want to do this.\"Now is the perfect timing to announce for Regulus his other plan that comes for him all together now. This is perfectly usable for his deal with Pandora.\"Oh no worries about that. I have the perfect idea.\"***The next morning they all walk into the great hall like usual. The others accepted his plan easily and now it is his time to shine. Instead of walking to the Slytherin table like they are supposed to do, all three of them walk to the Gryffindor table, where the hole sixth year is already seated. Most of the hall falls silent as they walk. This is an interesting turn of events nobody expected when they woke up this morning.As planed and promised yesterday Lupin sit's closely enough to Sirius. Still some room between them but in a way that he can see and hear everything.Next to their new partner sit's Potter. As predicted. Everything acording to plan till now.Of course Regulus wouldn't be Regulus now if he wouldn't have an entire break down as he walkes. It is definetly a genius way to come closer to James as he likes and dealt with Pandora. But it is also before the entire school. So his anxiety and his hole body hates him for doing this. But he always was a stubborn ass and he wont stop it now. This will happen.Potter doesn't even sees them coming. Strategically placed and get's up from his seat right in the perfect timing. You can say about Lupin what you want but this guy is great at planing and making things happen exactly like they should. Probably why all the pranks of their group worked so great.Then Regulus only has to turn James on his shoulders so that he stayes up front to him. The poor boy doesn't even realise what's happaning to him. He just smiles to Regulus and get's out an \"Hey Reggi, wh...\"Till Regulus kisses him with all he has. And it is great much more that it was supposed to be. This just should have been a little fling to make Regulus forget him. But now it get's worse. Why does a heterosexual guy kiss like that.To Regulus defense he isn't just pulling himself onto James who really doesn't wants that. In this way this would have been just an easy kiss. But no. James actually pulls him closer.Then it ends and after all Regulus nearly forgot to look at his brothers face. But he doesn't and it pays of. The amont of betrail on Sirius face almost looks like what Regulus felt the day he left him.\"And we also take this one with us.\", Barty laughes, the only one seeing everything that happened light enough to speak. He grabs Lupins hand and pulls him away with them to the Slytherin table.This is going to be an interesting month.",
	"45745003000": "“This…this is dire news...” Reckham said, hand clutching to his heart.\n“Ranrok has taken Isidora’s powers! Dire doesn’t do this situation justice!” fretted Rookwood.\n“Calm Rookwood, how can we be sure Ranrok can even use these powers?” asked Fitzgerald.\nBakar, knowing you and Professor Fig have just seen what he’s done, is noticeably resigned. You sheepishly look at him as Professor Fig begins to speak.\n“We don’t know yet if Ranrok can, but considering all he’s done up to this point, I fear the worst.”\n“It’s true, Ranrok would not have taken the powers if he was unsure he could wield it.” you managed to say. Tensions were high and you were unsure if you could speak out of turn.\n“Young one…” Bakar responded, the other keepers grew quiet.\n“Isidora was a great witch, but that doesn’t mean she was without fault. With her powers came a great deal of guilt and stress. The power to grant pain and even ease it. It clouded her mind and she was consumed by it…”\nAll in the room watched Bakar as he struggled to speak, finding his next words.\n“We…I took Isidora’s life because what she wanted to give to everyone…would have tore wizardkind apart-” Bakar paused, glancing at the other keepers.\n“-All kind apart. But, I believe I speak for everyone when I say Isidora would have wielded this power far better than Ranrok ever could.” Bakar nodded as did the other keepers.\n“I wish…Isidora could have become a Keeper. Could have been in this very room to guide you as well. She would’ve stood against Ranrok as do I, as all of us do.”\nBakar paused again and you glanced at Professor Fig. You were unsure as to where this conversation was going. Judging from his face, he sensed this unnerving aura as well.\n“The repository has been breached. There is no place for this power to go. If you can defeat Ranrok…the powers within him will flurry and likely scatter across the world. The public will soon learn of it, thousands will claw at each other to find it. You must…contain it somehow.”\nA chill grew across the room. No one needed to speak: you all knew what he meant. You stood there, stunned at what Bakar was hinting at.\n“No.” Fig immediately spoke. “There must be another way. Some sort of containment spell or place…we cannot. We mustn’t! This power consumed Isidora. Jane is far too young to hold this same power, you cannot ask for this!”\nFig approached the portraits, a slight twinge of anger in his voice.\n“She has done your trials, learned exactly why she must contain these powers and yet you ask her to absorb all that pain, power, suffering! Surely you must know what you’re asking-”\n•─────⋅☾ ☽⋅─────•\n“-We know exactly what we’re asking Professor Fig.” Rookwood spoke curtly\n“These trials were to show Jane what happened before, it was up to her what she would do after the fact. Contain it, absorb it, it did not matter to us. What mattered is that she would have been ready. Learn from the mistakes of Isidora and be ready to do what’s rig-”\n“Are you implying Isidora did not do what she thought was right!” Bakar blurted. Rookwood’s eyes narrowed to his left at Bakar. Professor Fig backed away, hand hovering over you. Surely he did not think things would be getting dangerous?\n“Isidora’s heart was never the problem. She never would have done all of this if she didn’t think it would be right!” Bakar said defensively.\n“Professor Bakar! You know more than anyone here what I mean. Have you not forgotten what she has done? The situation she has put us in! What she made you do?” said Rookwood, flinching at his last statement.\n“That’s enough.” Reckham spoke at last. Words fell from Bakar’s mouth as he turned away and muttered. Rookwood seemed ready to speak again until Fitzgerald shot him a glare.\nFitzgerlad looked down upon you, a kindness in her eyes eased you. The tensions from earlier melted away.\n“It’s plain to see that even we Keepers struggle to agree.” said Fitzgerlad. Rookwood and Bakar, though still upset, cowered a bit in agreement. “How we feel about Ms. Morganach shouldn’t sway your choice. You are not her young Jane.” The statement eased your nerves immediately.\nIt seemed Fitzgerald saw what the others could not: the pressure on you, that one day you’d turn out just like Isidora. No one in that room knew what had happened this year. Rookwood, the undercroft, the poachers…Soloman…it was so much. Fitzgerald began to speak to you again, but you could not hear her. You regressed into your mind if only for a moment.",
	"45745003001": "\nThe daily fear you had from being hunted, the guilt of taking a life…the death that threatened to tear your entire world apart. You had experienced great loss and then some as did Isidora. The similarities between the two of you frightened you to your very core. Fig gently placed a hand on your shoulder, knowing what you referred to.\nHogwarts was like the beginning of your life and Professor Fig saw that first hand. Your step mother did not seem to care for you much, rejoiced the day you got your letter. Though, she seemed to find joy in an early departure from her nest. You on the other hand struggled to truly want to leave…more so leave him behind. Your father, much like Isidora’s, grew mute and weak due to a tragedy: the death of your biological mother.\nAs you practiced magic, you spent more and more time at Fig’s house. Partly because of your stepmother’s disdain for it, mainly so that you wouldn't need to see the look in your father’s eyes. He had to have known what was going on. Near the end of it all, you practically lived with Professor Fig. Sitting at his table, chatting about the lesson for the day, fork in hand digging into some slightly burnt bacon…it was like being with your father again.\nEven though he was still there, your father had been gone for a long time. Some mornings you relished in what used to be…what should have been with him. Sometimes it would be too much…you’d make a small mess that day; drop your fork, spill your milk. Just to excuse yourself to mourn in the kitchen. Surely Fig noticed your puffy eyes once you returned…he’d always make sure to leave a bag of sweets in your room every night you cried. Though usually unspoken, Fig comforted you. He did so in a way that almost made up for all the years your father missed out on.\n•─────⋅☾ ☽⋅─────•\nA week before you were set to leave, you returned to your old home. Fig remained outside the house as you prepared to say your goodbyes, chatting to the landlord of your home. The living room was almost barren. I suppose your step-mother was rearranging some things. No doubt turning your room into some sort of walk in closet. As you walked into your father’s room, you prepared the statement you practiced, written on Fig’s stationary. That you’d promise to write and maybe even visit often. Possibly even treat him to a visit to the castle. Though you still knew little of magic as did your entire family…maybe something could make your father like himself again. Your heart burned with such a hope, though the feeling you had since you entered the home was eating away at you. After all, your step-mother was nowhere to be found.\n！！！\nAny thoughts or hopes of a future with your father were dashed the moment you saw the empty bed. You stood still and looked around. All his things, photos, clothes, all gone. You walked downstairs, stationary still in your hand. Thoughts began to race in your head as to what had happened. Opening the door, you saw Fig still talking to the landlord, but now the man had taken off his hat. He solemnly looked at you. That was all you needed.\nColdly, you brushed past Professor Fig and walked into the carriage. You swayed in your seat, dread consuming all your feelings and thoughts. For a little bit, the world stopped. Coldness swept over your entire body until Fig opened the door and sat beside you.\n“Jane…we’ll be visiting a place before we return.” Fig cautiously said.\nYou robotically nodded as the carriage began to move. Moments later, it stopped at your town’s local cemetery\nHis gravestone looked old, though the dirt was still fresh. All it had was his name on it, no date of birth…death, just his name. You stared at the stone though it was as if you looked right through it. You couldn’t comprehend what you were even staring at. Without a word you walked back to the carriage as Fig followed, saying something that the ringing in your ears quieted. It wasn’t until you sat on your bed that night…that everything came crashing down.\n•─────⋅☾ ☽⋅─────•\nA guttural gasp escaped your mouth, and then another one. Soon, you sobbed until you couldn’t breathe. You cried, grieved, for it seems like no one has ever done so before. Steps towards your door tore you away from your sorrow. You trudged to the door, opened it, and collapsed into Fig’s chest. Fig, who seemingly was there the whole time, tightened his arms around you in an embrace. His hand affectionately stroked your head.\n“I…I am sorry Jane. If it was me…you would have been the first person in the world to know.” was all Fig could say. And in response, you weeped. Mourned. Lost. Gave into all the sadness you endured, and grieved like your father never could do.\nIf your father was still here, would you have attempted to absorb the powers in the repository? Take away his pain like Isidora did? No…there would be no point. He was lost already and no magic would have brought him back. Truly, he died the moment your mother took her last breath. It comforted you to think that wherever he was now, he would be truly alive. You had just wished he was able to do it with you before he left.\nYou exited your trance and found yourself in the map chamber again. It seems like the keepers began to discuss what to do whilst you were away. Professor Fig looked down at you, same expression as he had that night. It was then, did you speak.",
	"45745003002": "",
	"45745003003": "",
	"45744898000": "The first time Sebastian wondered just where he and Ominis would end up this summer had been on the train ride back to London. Every year before this his uncle would’ve been waiting for them in London, taking them back to the small place they called home.Now, however, he had nowhere to go. He could stay at the home all alone, but it wouldn’t feel right. There would be no Anne, no Solomon and no one else, the Goblins had murdered pretty much every last person who lived in that place.Going to the Gaunts wouldn’t work either, the family absolutely despised Ominis, that’s why the boy always spent the summer at his place.“We’ll figure something out.” Sebastian muttered, “Maybe stay in a hotel or go camping that could be fun, right?”Ominis didn’t respond, he hadn’t done a lot of talking after he decided to not turn Sebastian in. The only thing that gave Sebastian some hope for it ever going back to the way it used to be before this year was the fact that, while not talking, Ominis also hadn’t left his side for a moment.That, of course, could also be because the boy just didn’t trust him.“I’m sorry,” He whispered, before turning away and grabbing a book- not on dark magics, no he left those behind. It was a book he had found, a diary of sorts by Rowena Ravenclaw of all people. He couldn’t make sense of the words, it were words of a grieving woman that much was obvious, however it seemed to be random thoughts written on a paper.Beside his confusion, the book made him feel something, gave him something to focus on beside his urge to learn more spells that were forbidden for such an obvious reason. The addictive magic had been all that was on his mind lately, the only things that stopped him were Ominis and the book he was currently holding.“I’m not angry,” Ominis said, so suddenly that Sebastian wasn’t sure if he had imagined it or not. “Just worried, there’s a reason I despise Dark Magics, not just because of my past. It’s hard to say goodbye to them once you have accepted them as part of your life.”  He sounded bitter when he said the next sentence, “I would know.”“I never intended to worry you.” Sebastian said, not sure if there was anything else he could say.“I know you weren’t, that only makes it worse.” Ominis sighed, “Just, stop thinking I hate you or anything. I can practically hear your self-loathing because of it and it’s kind of pathetic. We both know I could never hate you, Seb.”“But we also both know that me doing Dark Magics against all your warnings is too far,”“And I’m glad you finally realised that.” Ominis replied, “Acceptance is the first step to healing from this poison.”“You really mean it?” Sebastian asked, looking Ominis in the eyes even if the other boy could not see it. He sounded smaller almost child-like, “You’re not angry?”“I mean it,” Ominis promised and while Ominis didn’t claim his family title with pride; the one part he did take with pride was the ability to lie so easily. It was part of being raised in the Gaunt house, no mask pretty much meant no life once you’re older than six.Because even if he really wished he could just hide all his anger under the love he had for his best friend, say that it was just a little mistake, he couldn’t help but feel a little angry. At himself for not trying harder to stop all of this, but also at Sebastian- the one person who knew just what he had been through- for not stopping after he had warned him multiple times.That hadn’t stopped him from at least trying to find a place to stay for both of them, he had asked around trying to find anyone he trusted who could give them a place to stay. Until eventually his favourite professor offered them to stay with her, she was alone anyways and spent most of her time away from home.“It would be good to have someone to take care of all my little flowers,” She had said after approaching him about the subject, “Just think about it okay?”Ominis had told her they accepted a week later, without even discussing it with Sebastian.“I have already found us a place,” Ominis said suddenly, deciding that maybe he really should tell Sebastian, “Unlike someone I actually think of these things before going back to my non-existent home.”“You found a place?” Sebastian asked, “Where?”“You’ll find out, have some patience, Seb.”Ominis could feel the curiosity coming in waves from Sebastian, he didn’t need to have sight to know the boy was probably looking at him, trying to read his mind about where they would spent the summer.“It’s someone we both like, stop worrying.”Sebastian decided that he trusted Ominis enough to at least reply with, “If you say so.”Ominis smiled, “You’ll like it there.” And maybe burrowing his anger under all the love he had for his best friend was easier than he thought just a few minutes ago.~Professor Garlick was waiting for them at the platform and Ominis just smiled at Sebastian’s excitement. Garlick was everyone’s favourite professor, besides the few people who absolutely despised herbology.“How did you even manage to make her-““She offered, Sebastian, she somehow just knew we needed a place.” Ominis said, “She’s probably going to be away from home most of the time, but she didn’t mind us staying.”It was only when Mirabel Garlick actually approached them, that Sebastian believed him.“Boys! How was the trip?” She asked excitedly, Sebastian smiled at her, “It was nice, thank you, professor.”“Oh! Please call me Mirabel, no formality in my house.” She said, “Are you ready to leave?” She asked then looking at their bags and the other students. Ominis nodded, “I have everything.”Sebastian nodded, he never had a lot to begin with. The goblins had taken a lot of him the past few years, till the point where he only had some clothes and his wand to actually take with him to Hogwarts.She offered her arms to both of them, Sebastian gently guided Ominis hand to one of her arms, after realising he didn’t notice the offered arm, before grabbing the other one.Mirabel smiled softly at the action before they apparated to her house.The house- which was a small cottage in the middle of a field, there was one path leading away from the cottage, Sebastian expected it lead to a nearby village.- wasn’t much, like Mirabel had warned Ominis, but it looked peaceful.“Thank you, for doing this.” Sebastian said, “I know it must be a lot to just take in two-““It’s nothing, I’ll enjoy the company and I have a trip planned with friend this summer. I was hoping you would be able to take care of my plants and cats, you should do fine. I’ve seen your skills in both Herbology and Care of Magical Creatures.” Mirabel said, “Now do you want to see the inside of the house.”Sebastian nodded, while Ominis just reached for his wand, the spell didn’t exactly allow him to see anything, but it was the closest thing he had to sight.Their teachers happily led them into the house, immediately greeted by one black and an orange cat. She smiled at the little creatures, “An elf usually takes care of them, since I can’t spent the time I want to spent with them at Hogwarts. They never got along well with other cats and there’s a ton of those in Hogwarts.” She petted one of the cats, the other gently nudged her leg with it’s head. “That doesn’t mean I don’t miss them, of course, I have always loved cats and these two they’re special to me.“I trust neither of you fear cats?” Mirabel asked, Sebastian shook his head, “We’re not.”“Good to hear,” Mirabel said, “I’d hate if you spent your time here in fear. It is vacation after all. I’ll show you to the bedrooms, I only have one guest bedroom, but I trust you don’t mind sharing?”“We don’t,” Ominis was the one to speak up this time, “We’ve practically been sharing bedrooms every night for four years now.”Mirabel nodded and started leading them to a hallway on the other side of the small cottage, there were three doors there, “The bathroom,” She said, pointing to one door, “And there’s your bedroom.” She opened the door to a room, it had a big window allowing the sun to come in, the entire room was made from wood mixed with light green and yellow colours.Sebastian quite liked how it looked. The two beds were now separated by a small nightstand.“Do you want the window bed?” He asked Ominis, who snorted, “You think I care?”“Hey! I’m just being polite, offering you the bed. Besides the entire other bed is red.” Total lie, but sometimes it was fun to-“The fact that I am a descendant of Salazar Slytherin does not mean I despise the colour red, I have told you that before. Besides, I don’t really ‘despise’ any colour, since I don’t know how any of them look.” Ominis said, while he claimed the bed closer to the door. “Maybe green really is the uglier colour.”Sebastian smiled, “I think you would like green.” He paused, “You look great in green, after all.”Ominis just snorted again, used to these comments from his best friend. “I’m sure you’d look absolutely disgusting in it.”“Hey!” Sebastian said, laughing slightly.~The first few days were kind of hard to get used to just how calm this place was, Mirabel mostly left them alone, usually spending times with her plants or going to the village close to her home.Once or twice they went with her, but more often than not they spent entire days playing dumb magical games they used to love to play before everything with Anne happened. Mirabel also enjoyed teaching them new spells, harmless jinxes that she loved when she first came into the wizarding world.After two weeks Mirabel went away for her trip with the simple instructions to give her cats and plants enough attention, the elves would do the rest.So they ended up alone.“Sometimes I wish I could lend you my sight,” Sebastian said, “I would do so in a heartbeat, just to allow you to see a little bit of this world. Some of it is actually pretty amazing.”The both of them were laying on the field next to Mirabel’s house, Sebastian was looking at the clouds that seemed to magically morph into shapes, while Ominis had his eyes closed. It was so unlike any vacation before. The first few vacations Ominis had spent with Sebastian’s family were fun, although often they had a lot of things to do. His uncle didn’t want them to be lazy. Then Anne got sick and everything changed.For the first time they could really just relax, no one was telling them to do anything.Ominis sighed, they had this conversation many times before. “I honestly don’t know if I’m missing something, it’s always been like this.” He paused, “At least I don’t have to see you all day.”“I think you’d love the way I look.” Sebastian said, voice full of confidence.Ominis turned to his side, knowing Sebastian had probably turned a while ago to be able to look at him during talking. “It’s nice, though? I can just meet anyone and not have any judgement from the way they look. There’s so many people who are absolutely amazing, but not necessarily pretty, right? So nobody likes them.”Sebastian nodded, it made sense a world without judging anyone simply by their looks, how nice that would be.“Can I ask you something?” Sebastian asked after a long pause.“What is it?”“How did you know?” Sebastian said so softly, “Everytime something almost went wrong or I was in danger you showed up.”“I have to compensate for the blindness in some way, don’t I?” Ominis asked, “It’s like this feeling I get. I was worried this year, Seb.”“I know you were.” Sebastian muttered, putting a hand on Ominis’ cheek. “I’m sorry for worrying you.”Ominis smiled slightly, “I know you are.”“I don’t think you know how sorry I am,” Sebastian said, moving his hand from Ominis face, instead before he carefully put his hand over Ominis’. “You saved me, not from all those Goblins, but from myself. I never noticed what I was doing until it was too late. I have never felt more sorry about ignoring someone’s warnings.”Ominis turned his hand around, allowing Sebastian to carefully grab it. “Now you know.”“I do.” Sebastian answered, “And you have every right to be angry, but somehow you’re not because you are the best person ever and it just makes me wonder-“ Sebastian smiled, they could never stay serious for too long.Ominis laughed, feeling where this was going.“Are you an angel?”“I’m way too traumatised for that.”“Are you? Oh damn, I was so sure I finally figured you out, maybe I could have dressed you up in all white and convince people you are my guardian angel!”“You ruined our beautiful friendship moment, Sebastian!” Ominis said and Sebastian smirked, “That’s what I’m here for, is it not? Without me this friendship would be one gross, too sweet, friendship.”“There’s nothing wrong with being nice.”“Are you even hearing yourself right now?” Sebastian asked, “I mean you are one to talk, you’re the most sarcastic person I have ever met, you seem to enjoy insulting people while sarcastic, most of them don’t even hear it’s sarcasm you know?”“Yes, well, that’s funny.”“Is it?”“I think it is and I am pretty sure you have said you think it’s funny before.”Sebastian turned back to the clouds, pulling his hand away in the process, “Right, You’re so funny.”“And you are an asshole.”~“Ominis are you actually asleep?” He whispered into the blackness of the room.“I’m not.”“Do you want to-“ Sebastian sighed, “Nevermind.”“What?” Ominis asked, Sebastian breathed in, “I don’t know, put our beds together?”Ominis snorted, “You are such a child sometimes, was that that hard to ask?”“What?”Sebastian casted a Lumos allowing him to see Ominis searching for his wand, patting the bed and nightstand. He smiled softly, before handing him his wand, after he noticed it on the ground.“We did this all the time, Sebastian. I was honestly expecting you to ask the first night.” Ominis explained, “So we’re doing this?”Sebastian nodded, even if Ominis could not see it. He was aware that every year before this one they had been forced to share a bed, it had never been weird.But it was different now, it felt different.Ominis moved away from his bed, waving his wand once, moving the nightstand away then he waited till Sebastian moved the beds.It was only once he laid there that Sebastian just realised why this, all of it, felt so different than any of the times they did the exact same thing before.He turned around, facing Ominis, the moonlight that had been hidden earlier by clouds now coming through the window, making the boy look even prettier than he usually did.“Merlin’s pants. I’m cursed.” Sebastian whispered into the emptiness of the room, hoping his friend really was asleep this time. He lifted a hand, leading it back to the place it had laid that afternoon, on Ominis’ cheek. This time however, he didn’t quite let the hand actually touch his friend.His hand was shaking and he slowly moved it back, his breath shaking. There was a lot he expected from this break, but this-It wasn’t something he ever imagined to happen, he always had thought of himself to be someone to not get into a silly teenager relationship during his time at Hogwarts.But with Ominis, it suddenly didn’t feel so silly anymore.He forced himself to slow his breathing, not get into a useless panic attack about the fact that he really was in love with his bestfriend, he forced himself to close his eyes, maybe he could still get some sleep.~It was after five days of silent pining and everyday Sebastian thanked the gods that Ominis couldn’t see him staring at him for hours with a soft smile on his face.However today was immediately different, when Sebastian woke up he noticed a pressure on his chest, an arm wrapped around his waist. It was the first time this had ever happened in the past four years. Ominis had never been a big cuddler and Sebastian had easily accepted that.“I can hear your confusion.” The boy mumbled into his chest, “Make it shut up, I want to sleep.”Sebastian chuckled, moving one of his hands to play with Ominis’ hair. “I thought you hated physical contact?”“Sometimes, but you love it.” Ominis sighed, “It’s called a sacrifice, besides I don’t mind too much when it’s like this.”“Why today?”“You were annoying me,” Ominis said, as if that explained everything.“Okay?”“Just because I can’t see it does not mean that I don’t feel you constantly staring at me, or whisper curse words while you’re laying next to me. I didn’t think it would be that big of a realisation.” Ominis muttered, “But I suppose you were always the oblivious one.”“You knew, the whole time?”“It’s been so obvious,” Ominis replied, “It’s one of the things that scared me most the past year, the fondness in your voice was just gone. It’s like you totally forgot about all of it. I spent weeks loathing myself for never making a move, because I was scared to ruin whatever it was between us. Now, however, I notice it’s impossible to keep ignoring whatever this is.”Sebastian didn’t know if he wanted to kiss Ominis or hide in embarrassment, the boy however made the choice for him when he sat up and leant above him. Sebastian leant in, allowing his lips to softly touch Ominis’.Ominis pressed back and Sebastians embarrassment fade away totally, he realised how right Ominis was, they both had been waiting for this for at least two years. All he could think about now was Ominis, the boy seemed to have taken over his entire life, he seriously doubted if it was healthy how much he would let Ominis influence his life.But he knew all the boy would do is keep him safe.Then Ominis pulled away and rested his forehead on Sebastians, laughing slightly.“I can’t believe we waited so long to do that.”“Sorry for being so oblivious.”  Sebastian apologized, not sure what else to say.“You should be, we could have done this a while ago.”“Didn’t you just say that you knew all this time, but didn’t want to ruin our friendship?”“Yes, I did, but I wouldn’t have rejected you if you asked me out.” Ominis said, “Which technically you didn’t even do.”“Oh, so I have to be the one to ask the other out?” Sebastian asked and Ominis shrugged, “You seemed like you would die from embarrassment if I asked you out.”Sebastian had to admit, this direct way Ominis chose had probably been a better idea, “Okay, well than you absolute idiot, will you go out with me?”“Oh, I’m the idiot?”“Of course, I mean I could not possibly be an idiot.”“Why is that?”“Because you have high standards and would never date an idiot, meanwhile I love my idiot boyfriend.”“We’re boyfriends now, huh?” Ominis asked, “With this attitude, you need to take me out before you get to call me that.”“Sure, whatever you say.” Sebastian replied, kissing Ominis’ nose, “Well are you ready for a really romantic picnic date?”“I have been for the past two years.” Ominis replied, smiling at Sebastian.Sebastian couldn’t help but pull Ominis into another kiss.When Mirabel returned home and she saw the closeness between the boys, she secretly cheered, before going inside to hangout with her cats, she was exhausted from the trip with her girlfriend.",
	"45744640000": "\"An owl is coming.\" announced the Irish man with his heavy accent, his blond hair was long and tangled –but everyone in the pack had long, tangled and dirty hair. Except Remus, who's hair was barely chin length. It was too long for his own liking, but werewolves who lived with packs barely cut their hair and kept it long.He needed to fit in with the rest of the pack to achieve his mission, so it was a sacrifice had to made –although Remus wouldn't really call it a sacrifice. Many things in his life wasn't to his liking, and he had learned not to bother himself with it.The owl came in a minute or so, Remus didn't know, his sense of time had been warped ever since he started this mission. There was morning, noon, afternoon and night; they didn't even bother to count the days. After all everyone instinctively knew when the full moon was.Merlin knows how much Remus wants to go back to his friends. A damn disgrace I am to werewolves, he thought. Missing human society as if \"I'm human.\"The owl arrives, Remus gets closer to the others while they open the letter.\"Dark Lord has fallen!\" the leader announces, keeping her cold but rest of the pack is shaken. Whispers asking \"How?\" and \"When?\" emerge.Dark Lord has fallen, words echo in Remus' head.\nWe won the war.\nAnd without saying a word, he apparates to the headquarters.\"Whoa.\" said the Irish man. \"So that fella was a spy.\"\"Can't be, the only werewolf working for Dumbledore is Lupin. And he lives with humans.\" responded the brunette man.\"Maybe he worked for the Dark Lord.\" another one said.\"Would explain why he left all of a sudden.\" approved the Irish.\"He was Lupin himself,\" interrupted the man they call the Redhead Jim, he was the most educated one in the pack. \"We called him John but his alias was Romulus at first remember?\"\"I don't get the point.\" said the brunette.\"Remus and Romulus were brothers, founders of Rome, they were raised by a wolf.\" explained Jim. Voices of realisation arose from the pack.\"That's why I told you folks to avoid talks directly supporting the Dark Lord.\" said the leader.\"You knew? Why let him stay?\" asked Jim.\"If the war took a turn, I thought, and if we supported the Dark Lord, minister and his dogs would hunt us down. Lupin boy directly reports to Dumbledore, probably –he would say that we didn't show clear support to the Lord, just tested the waters like everyone does– and would save our poor asses. And we'd have a good laugh at Greyback.\"\"Good thing we have a clever leader.\" said the Irish, laughing, the pack started chanting the leader's name in support.•It's late in the afternoon, Mary MacDonald is trying to enjoy a cup of tea sitting in the kitchen of Order's headquarters after a long day of work in St. Mungo's. I need to find a flat and move out, she thought. Living here is too painful.All of a sudden she heard an apparition sound from the entrance, who could it be, she wondered. Now that the war was over, the old cottage that was once the place they planned their next move barely had any resemblence of life –except for Mary who kept living there with Dumbledore's permission. With not-so-old habit of keeping a hand on her wand, she approached the door.It's Remus.His hair is overgrown and dirty, his clothes are worn out –and dirty. He is even more scrawny than the last time she saw him, Mary doesn't know how that's possible. He looks tired and unhealthy, but there is something sparkling in his eyes. And he stands there.\"Oh, Remus.\" she sighs in relief, rushes a few steps to hug him. He smells awful but she doesn't care. A friend that is still alive feels like a blessing.\nDoes he know they are– No, does he know the war is over to start with?\nMary lets go of him after a long minute, but now Remus knows something is wrong. Mary never hugs for that long, let alone that dearly.\"They say the war is over, is– is it true?\" he asks, his voice is overflowing with hope.\nHope.\n\"It's, oh Remus, it's over but–\" she can't do this. She can't tell him, not a chance. And Remus notices, \"Who?\" he asks. Can't be Lily and James, they are safe, he thought. \"Is it Sirius? Peter? Both? Dumbledore?\"There is tears in her eyes, her lips are twitching but she doesn't talk.\"Tell me something, please, for Merlin's sake.\"\"I'm sorry, I'm sorry, I'm–\" she crumbled to the ground crying, leaving Remus in shock. \"Traitor,\" she mumbled. \"Sirius, it's–\"\nSirius is... the traitor?\n\nThen– then James and Lily?\nHe apparates once again, leaving Mary crying in the entrance. This time to Godric's Hollow.The lovely house that was once held very dear memories is in a half-rubble state. \"No, no, no, no, no, no, no, no, no...\" he murmurs to himself rushing inside the building. He looks at the traces of the fight, looks at where his friends gave their lives. He wonders what happened to Harry, was he dead too? He assumed he was, unless they got Voldemort before he got Harry.There was still a lot he didn't know.He wanted to go home, to the flat he shared with Sirius. He wanted too see traces of regret and stress in there; a broken cup maybe, or the room left messy, or a note of apology.Because the Sirius that Remus knew wouldn't betray them. He must have been forced to do so. Because he wouldn't do that. He wouldn't.But the house was the same as it ever was.  There was no broken cups or a note that Sirius left. It was the same as always.But nothing else was the same.\nSirius did it.\nAs the truth hit him, he no longer could stand being there, stand where Sirius used to stand, be where Sirius used to be, he was furious.He hesisated for a split second to apparate back to the headquarters, he was gonna splinch for sure, but then the thought of it didn't seem that horrible. So he apparated.And he splinched.\"Are you back Remus?\" Mary called him from the kitchen. \"Fancy joining me for dinner?\"\"I splinched.\" he called back in pain, left side of his torso was covered in blood already. It wasn't bad, by Remus' standart for injuries, but it felt worse than it was in the situation.Mary approached the entrance for the second time that day, this time in a rush, and settled Remus into a couch quickly.\"It's not that bad.\" Mary said patching the wound after casting a ton of healing spells.\"Feels worse than it is.\"\"Everything does nowadays.\" she sighed. \"I cried over a broken plate yesterday.\"\"This somehow sounds familiar...\" said Remus, meaning another time Mary broke a plate and cried over it.\"Oh shut up!\" she hit Remus in the shoulder lightly, her frustration could be seen on her now pink face; slightly smiling but it doesn't mask her sorrow. \"I'm done.\" she exclaimed a while later. \"Don't re-open the wound.\"\"Thanks.\" he said getting up from the couch.\"Will you stay for dinner?\"\"I think I will. Thanks, again.\"They moved to the kitchen, Mary went back to her uncooked chicken on the counter and Remus sat in one of the chairs next to the table. There is a newpaper on the table.It has a photograph of Sirius printed on the front page. He holds one of the signs they give to prisoners, he wears those striped pyjamas prisoners wear.\nAnd he is laughing maniacally.\nHe reads a bit of the paper while it still lays on the table. \n\"...the murderer of Peter Pettigrew and 12 Muggles, Sirius Black, who has been caught by Auror Office on the same night he commited the crimes, 31th of October, is today officially centenced to a a lifetime in Azkaban...\"\nTime stopped for a few seconds and Remus snapped.\"FUCK!\" he yelled and threw a punch to the wall, causing Mary to turn around in panic. \nJames is dead.\n\nLily is dead.\n\nPeter is dead.\nHe threw another punch to the wall, his knuckles were bleeding–\nHe killed all of them.\n–then he threw another and another and another...\nHow could he?\n\nHow could he have done that?\n\nHow could he do that?\n\nHow?\n\"Remus calm down–\" Mary said, hesisant to reach him. She heard Remus talking about werewolf temper and how he could get uncontrollably violent before, but she never saw him lose it. Remus and anger was two things that didn't fit together.Remus turned around to face Mary \"CALM DOWN?\" he roared, Mary fliched back, \"I LOST EVERYTHING MARY, EVERYTHING–\" then he saw the fear in her eyes.\nFear.\nRemus took a few steps back in realisation, \"I- I didn't mean to, I'm sorry.\" he felt like vomiting now.He lost control.\nHe shouldn't have.\nHe rushed his hand through his hair, he felt tear filling his eyes. \"And I learn all this a week later, I couldn't even attend their funeral, I- I don't even know where their graves are.\" he took a deep breath in, and let it out slowly. \"Oh, Mary, what am I gonna do?\" he sobbed.Mary couldn't say anything for a few minutes. James, Lily, Peter... They were her friends too but Remus was the one who truly lost everything. And Sirius to turn out to be the mole...Remus wouldn't go and stay at their flat, Mary knew that. She also knew Remus enough to know he wouldn't move back to his father's house.\"You can stay here, with me.\" she said, attempted to wipe the tears off Remus' face with her hand but Remus drifted away.  \"There is a bunch of empty rooms here and loneliness has been killing me.\" she added.\"I can't.\" he managed to blurt out between his uncontrollable sobbing, covering his face with his arms. He slowly crouched and sat in the floor, tears still rolling down from his cheeks.\"You saw me.\" he said a while later. \"I'm unstable, and the moon's in four days. You won't be safe.\" \"For Merlin's sake, Remus, the building is made out of stone, not cardboard.\"\"But–\"\"And I am a healer, mind you, you need me.\"There was quiet.\"Thanks.\" he murmured, embarassed. \"Is the room at the end of the hall empty?\"Mary nodded.\"I'll go... And sleep, I think.\" Remus said, getting up from the floor.\"Dinner?\" she asked, knowing he would refuse it this time.\"I don't think I can stomach anything.\" he replied.\"Goodnight then.\" she said, knowing it was far away from a good night.\"Goodnight.\" he said, knowing it was the worst night of his life.",
	"45744622000": "I have heard it said that love turns people soft, but I have never been more brutal.\n\n— Elaine Kahn, Romance or The End.\n — It had never been a thing Sirius thought of very much, not because it wasn’t a thought worth having, but simply because in the midst of the war, 1976-1981, it didn’t seem so important. But Merlin above, Remus was beautiful. Now that Sirius knows the whole story, now that he understands how it was all going to end and he has time and time in spades, he thinks about it more. The soft curve of Remus’ lips. The way his eyes danced over pages too quickly when he read. The delicate features of him, and the hardened ones, too. The bits too soft to touch and too heavy to hold. Remus was coloured in siennas and greys, warm brown hair that was just a little too red in the right light, waxy skin sheened with sweat, amber eyes. He had a scar on his jaw, right here. Sirius reaches out into the cold of his cell and in the dim light of the moon, he can almost touch it. That little scar. They had been beautiful, hadn’t they? All of them. Remus and James and Sirius and even Peter. They were forces to be reckoned with, once upon a time. Sirius thinks about who they were before they were anything noteworthy, before the whole Wizarding World knew their names, and he thinks it should ache, but it doesn’t. Peter Pettigrew: died too young, with too much brutality, nothing but the smallest of his fingers left behind. A rat. A warning. A premonition of something far worse than a broken friendship. Peter was a lesson Sirius spent his whole life refusing to learn: it is only the people we love the most that can hurt us this deeply.James Potter: murdered. Murdered. Dead, though he was never meant to die. He was the protagonist, the hero, the star of the story; he was not meant to be doomed by the narrative. He was supposed to live. But now he’s dead, and the only glimpses of him Sirius can catch are in other people’s mouths, in clips of newspapers, and on rare, sunlit days. Remus Lupin: left behind. Discarded. Broken. As he always thought he was, as he always knew he would be. Remus is a self-fulfilling prophecy in the sense that maybe, maybe, if he hadn’t tried so hard to be alone, he wouldn’t be alone. He always bit with too much teeth. Snapped with too much force. Sirius should’ve expected this, and yet, at least Remus is alive. Sirius can forgive that, as long as Remus is alive. Sirius Black: imprisoned in Azkaban for a crime he might as well have committed. He doesn’t mind the solitude of prison — kind of likes it, actually. It makes him feel as though his life in Hogwarts was just one long, idyllic dream. It’s all soft and hazy around the edges anyway. Like squinting at the sun for too long. And Sirius doesn’t mind that occasionally he’ll hear Barty’s voice a few cells away, because Barty once belonged to Regulus, and for all of the grief Sirius has suffered, he misses Regulus like no other. Two dead. One missing. One alone. And one imprisoned. But Merlin, Remus was beautiful.  — Professor McGonagall, bless her soul, tries to defend Sirius. She does. She visits him in the temporary cell they’re holding him in and she shakes his shoulders and she tries to get something out of him. Do you know who the traitor was? Sirius, we’ve not got time, you have to tell me what happened. If you don’t speak, I can’t defend you in this trial. I know you didn’t do this. Tell me you didn’t do this. Sirius? Sirius!Sirius doesn’t speak. He can’t remember how to move his tongue.In the end, Professor McGonagall puts up a fight when they drag her out, but Sirius doesn’t look at her. Doesn’t think he can without thinking of her fond smile when James was appointed Head Boy, or the stern downturn of her lips when she gave them all detention. She’s a relic, anyway. An echo of a life Sirius wishes he never lived. He should’ve never met James Potter. Damnit, he should’ve never met James, the fucking dick, he should’ve never given the gold-speckled arsehole the time of day. Damn you, James, damn you to hell and back, you weren’t supposed to die. Why were you so easy to love? Why were you so easy to lose?Sirius doesn’t think about Remus. Refuses to think about Peter. All he can think about is James. Someone escorts him to a courtroom, and someone else unchains his wrists from the shackles but keeps the cuffs chaining his hands together. It takes a few nudges to sit Sirius down, but he does and thinks about how James used to take his tea. Two sugars, no milk. “... of the third of November, 1981, into offences committed by Sirius Orion Black,” the judge says. Barty Crouch, Sr. Sirius notes with disinterest. “The charges against the accused shall now be read into the record: the murder of Peter Pettigrew. The murder of twelve muggle witnesses. The murder of James and Lily Potter and the servitude of Voldemort during the height of the war.”Sirius observes the crowd of onlookers in the courtroom. They’re all confined to one side, where the ziggurat-shaped seats reside, carved from dark stone. That whole section of the courtroom is full, and Sirius, though his mind isn’t really there, can vaguely make out a few people in the mass. Professor McGonagall right at the front, thumb in between her teeth. Professor Dumbledore beside her, a dark look in his eyes. Some students Sirius went to school with — Sybill Trelawney, most notably, near the door. Parents of people that have died already, parents of people that will be dead soon. Mary Macdonald. Walburga Black. Harry Potter, in Petunia Dursley’s arms. “Are you Sirius Black?” Barty Crouch, Sr. asks. Sirius stares at him. A murmur washes over the crowd when Sirius doesn’t reply. He doesn’t know what would come out if opens his mouth. Maybe a scream. A curse. Most likely, he’d probably find that his voice is completely gone, just another thing he lost in the blaze of inferno. His tongue used to belong in between Remus’ teeth. No. He isn’t thinking about Remus. No. “Are you Sirius Black?” Barty Crouch, Sr. asks again. Sirius stares at him. Barty Crouch, Sr. sighs. “Did you sell James and Lily Potter out to Voldemort, Mr. Black?”Sirius stares at him. “Did you kill Peter Pettigrew?”Sirius stares at him. “Did you kill twelve muggles in the process of murdering Peter Pettigrew, who was just a boy—”“He was just a boy,” Sirius croaks. It’s the first time he speaks in three days. Barty Crouch, Sr. pauses, eyes wide, but Sirius no longer cares about him. His eyes are on Dumbledore, and Dumbledore alone. “James was just a boy,” Sirius repeats. Dumbledore’s eyes go wide, maybe as though he’s afraid, though Sirius can’t really tell and can’t honestly say he cares. He thinks about how when Snape got past the Whomping Willow, Sirius was just a little disappointed that the tree didn’t decapitate his fucking head off. He thinks about how he was the one to cut Peter’s pinky finger off. He thinks about how the first time he used a Crucatious curse he was five and it was on his own brother, who writhed and screamed and begged him to stop, his mother’s hand resting gently on his shoulder. There was always a lingering darkness within Sirius. Something he chose to ignore. But he looks at Dumbledore and he remembers the war and he remembers the start and he remembers the end and he remembers that if he had a knife sharp enough right now he would gouge Dumbledore’s eyeballs from his fucking skull for everyone to see. He clenches his fist and tries to recall how Regulus’ dagger felt in his hands.A figure moves from behind Dumbledore. Short, portly, with cropped, tawny blond hair. An upturned nose, rosy cheeks and bright blue eyes. He has the build of a Pettigrew and the features to match and Sirius doesn’t think, doesn’t even breath before he’s running towards the crowd and leaping at the man. He doesn’t need a knife for this. There are screams and cries and someone points a wand that Sirius grabs and stabs into Pettigrew’s eye, blood spurting out in chunks over the dark stone seats. Pettigrew howls and Dumbledore tries to haul Sirius away, but Sirius doesn’t remember being a person with mercy, so he digs his nails in and splits Pettigrew’s cheek and he rips a chunk of tawny blond hair out his head so hard that it bleeds. When Pettigrew dies, he dies a mess of sinew and sticky blood, splattered across the courtroom like a spectacle. In the end, it wasn’t Peter Pettigrew that was lingering in the crowd. It was Peter’s brother. Sirius spits on his body regardless as he’s being dragged out of the courtroom, and when he looks up, Professor McGonagall has the look of a woman who’s seen unspeakable horrors. Sirius’ nose aches where an Auror hit him, so he can’t really see through the watering of his own eyes, but he doesn’t need to see to know her hands are shaking. Sirius laughs and shows off the blood coating his teeth. He doesn’t get a trial in the end. They throw him into an empty cell in Azkaban and Sirius curls into himself on the cold, frigid floors, waiting to rot.  — James Potter’s body is cold when Sirius arrives at the scene. He only gets to hold James for a few moments before he’s snatched away, but in those few, measly moments, James’ body is cold. The dagger in Sirius’ pocket feels heavy. They cart James and Lily off in separate cots, a white sheet draped over their bodies, and for a brief, delirious second, Sirius thinks, don’t. Just that. Don’t. James wasn’t supposed to die. Sirius would have rathered anyone to die than James. James should’ve lived. Not Lily, not Harry, not even Remus. Just James. Sirius was prepared for all of their deaths, anticipated and even expected them. But not James. Never James. On the Christmas of their third year, James had written Sirius a letter that he never read, because his mother burned it before he could even touch it. When they came back from the holidays, Sirius pulled James aside and asked what he wrote to him. James had smiled, brilliant, cheeky, tongue-in-cheek, and said, I called you a wanker four times in that letter and demanded chocolate frogs in turn for our continued friendship. Sirius knew he was lying, but he smiled anyway, laughing and shoving James away. The winter Sirius ran away from home, James had wrapped him in blankets and wiped the blood splatters from his cheeks and admitted, I wrote you that letter because I was worried about you. The letter your mother burned in our third year. I wrote it to ask if you were okay. And Sirius had cried and sobbed and emptied himself dry and James held him all throughout, stroking softly through his hair, and when Sirius was hollow and the blood was dry under his fingernails, James helped him to the bathroom and washed his hands for him. There isn’t any blood when James dies. There is no massacre. No violence. Just a body, an empty hand where his wand should’ve been. They don’t let Sirius see Harry. Not even to hold him. He begs just to kiss the top of his head, but they refuse him. Maybe they’re right to do that. Because Sirius looks at Harry and sees James and sees Lily and sees the blood oozing from the scar on his forehead and looks down at his hands to find no blood. James didn’t bleed out. He was simply killed. He simply died. He can’t remember leaving Godric’s Hollow. He can’t remember scouring the streets looking for Peter, and he can’t remember finding him. It’s all just a blank.Sirius comes back to himself with his dagger to Peter’s throat. “Please,” Peter wheezes under him. He’s shaking, eyes wide, face pale. The dagger bleeds where it’s digging into his skin. “You killed James,” Sirius hisses, “and you think I’ll show you mercy?”“I didn’t mean to!” Peter cries. Maybe he’s right. Maybe Peter was coerced into violence, that he really didn’t mean to kill James and Lily, except James’ body is growing colder in a morgue and Peter is the direct cause of that, so Sirius doesn’t actually give a fuck whether or not he meant to. He doesn’t care if Peter didn’t have a choice, he doesn’t care that it’s a war and all any of them are trying to do is survive. James is dead. And Sirius will make Peter live to regret that decision. There are witnesses. Sirius can see them out of the corner of his eye. But if this is a show, he’ll make sure it’s worth watching. Sirius doesn’t kill Peter immediately. He wants to make Peter beg for his life just to kill him anyway, so he drags the dagger down to Peter’s hand and chops his pinky finger clean off. Peter screams bloody murder and Sirius remembers in that moment something Remus once told him during lunch, back when they were still in Hogwarts. Pinky fingers hold the whole hand together, he had said. If it’s taken off for any reason, the whole hand falls apart. You lose almost fifty percent of your grip strength if you lose your pinky. Did you know that?Sirius knows that now, and bless Remus for that information. He watches Peter’s hand twitch and bleed out from the severed pinky and thinks about how he should cut off the ring finger, too. Make sure that Peter can’t grab his wand. But before he can even raise his dagger back up, Peter wriggles out from under him. Which shouldn’t be possible. Except in Sirius’ blind rage he forgot that the fucking traitor is also an animagus, the smallest creature, a rat, and how fitting, too. He leaves an explosion behind, one that knocks Sirius so fack back that he goes unconscious, pain blooming in the nape of his neck. In the wake of it, Sirius blinks his eyes open and finds himself surrounded by twelve dead muggles and the stench of rot, no Peter in sight. He cradles his hands into his chest and wishes, wishes, wishes, he wishes there was blood.  — Remus is not the traitor. Remus is the traitor. Sirius paces and wears craters into the floor of their studio apartment from his pacing and mulls the evidence over in his head. Remus is gone longer than he is here. Remus keeps secrets now, secrets that nobody knows, secrets that don’t see the light of day but Sirius knows they’re there, a lingering shadow in their small, honest home. Remus doesn’t sleep anymore. He wakes up screaming into Sirius’ chest and he doesn’t cry when it’s over, just turns away and pretends to fall asleep again. He has shadows under his eyes and he’s half the weight he was when this started. He doesn’t want to have sex. He barely kisses Sirius at all. He’s beautiful. He’s just so fucking beautiful. If Remus is the traitor, Sirius may end the world. He may tear it apart with his hands. He may dig into his own flesh and pull his heart out of his chest, arteries attached, and throw it at Remus just to watch his blood coat Remus’ cheek. He can’t stand watching Remus covered with blood that doesn’t belong to him. Only I can touch him, the snarling monster within him hisses. I’m the only one he’s allowed to hurt. Except it’s not like that anymore, is it? Before, Sirius didn’t mind living in oblivion. He didn’t mind that Remus may have betrayed him, may have turned his back on the one thing Sirius thought they shared. He didn’t mind it, because before, the betrayal belonged to Sirius and Sirius alone. But now James and Lily are in hiding. They soothe an infant Harry to sleep in their solitude home, that place they were exiled to, the west country of England, because safety isn’t in numbers anymore but in distance. There’s this messy knot in Sirius’ chest now. A voice in his head. A lump in his throat. It feels and sounds and tastes like, don’t touch Remus. He’s mine. Don’t touch James. He’s mine. Don’t touch me. I’m theirs. Don’t come any closer. It’s so sticky in Sirius’ hands, all these ugly half-truths. He doesn’t want Remus to hurt anyone but Sirius. He doesn’t want James to get hurt at all. He doesn’t want them in danger, and he knows that they have to be, knows that he would kill anyone in a heartbeat for them. Knows that he would kill any one of them for the other. He doesn’t want to have that choice. He thinks maybe he’s already made it. Sirius paces. He thinks. He waits. Hours later, when the sky’s creeping closer to sunrise, their front door opens. Remus walks in, dragging his feet, back hunched. He has a new cut on his cheek. His nose is broken and bleeding. Every time he breathes in, it sounds wet with blood. Sirius stops pacing and watches Remus straighten, set his rucksack down, and walk into the kitchen to get a glass of water. Sirius doesn’t speak. He goes to the bathroom and starts preparing the gauze, takes out the blood replenishing potions and takes stock of their Skele-gro. Remus follows him soon after, sits on the toilet with barely a wince and hangs his head down. This is who they are now. They don’t speak. They don’t touch. They sleep in the same bed at different times and wake up only when the other is already gone. This is what war does to love. It turns it ugly. It makes it cruel. Sirius heals Remus’ nose and ribs and he gives him potions that he drinks with a grimace and then he sits back, on the floor with his back on the wall, and waits. He doesn’t heal Remus’ cut. Remus likes the pain and Sirius thinks he deserves it. “I’m sorry,” Remus chokes out. Sirius freezes. Remus’ voice feels foreign, sounds different, a month of space between now and the last time he heard Remus speak. There’s gravel in his throat that makes him sound raspy. It sounds painful. It sounds like he’s choking on his own blood.“I know it’s hard to see me like this and not know what caused it,” Remus continues, looking down at his hands. He’s picking at the calluses on his fingers, and Sirius watches him, waiting for them to bleed. “I know that I’m a violent man, and I know that you know that and you heal me anyway. I know that you’re a violent man, too. I know how hard it is to do this for me.”Sirius swallows. He can’t speak. He can’t move. “I wish I were better, but— but I’m not.”“I don’t want you to be better,” Sirius admits before he can help it. His voice sounds foreign to his own ears. He hasn’t spoken to anyone in a few days, so it comes out a croak, but Sirius doesn’t clear his throat. Let Remus see. Let Remus see what they’ve become.  Remus looks up. The whites of his eyes are yellowing, deep and ugly, but his irises are still that golden-amber colour, the one that looks like honey in the right light. His eyes don’t fill with tears — Sirius doesn’t expect them to — but they get close. Glassy. “I like you like this,” Sirius adds, a hoarse whisper. It’s a confession as much as a reassurance. I like you as you are. I like you violent. I like you hurt. Remus looks away. The muscle of his jaw twitches as he clenches it. “Have you heard from James or Lily yet?” he asks. “No, not yet.”Remus nods, and then— and then he crawls down to Sirius and crouches down in front of him. He’s holding back winces, Sirius can tell, and his joints crack when he bends them too fast. He doesn’t point it out. “I know I make it hard to be around me,” Remus says, his hand coming on top of Sirius’ knee. “That’s my own doing, really. But I just— can I—”Sirius knows what Remus is trying to ask for. But he stays silent anyway, waiting, watching Remus stumble over his words, even though it breaks something inside of him not to reach out and pull Remus into his arms. He wants to touch Remus, too, but there’s distance now. Distance Sirius would rather die than breach first. His desire and his pride war over each other, and Remus struggles in front of him just the same, teeth clenched tight. Remus tugs Sirius’ sleeve, pulls him closer until their knees touch, and then he tugs harder. Sirius loses his balance and nearly topples on top of Remus, but Remus catches his arm and tips his head up with his fingers. “Please,” Remus whispers. Their faces are inches apart. “Please, Sirius.”Desire wins out. Sirius pushes forward and cradles Remus’ face in his hands, pulls him in for a kiss even when their teeth clash. There’s a learning curve, an awkward stumble where Remus and Sirius aren’t melting into each other as they should, but then Remus grabs Sirius’ waist and hoists him into his lap, and Sirius gives in. He cards his fingers through Remus’ hair and he nibbles at his bottom lip and in his head he prays, let this be my last night. Let me die here, while he’s still holding me. Let his lips be the last thing I feel. Remus lays Sirius down on their bathroom floor and crowds up on top of him, not once breaking the kiss. Remus kisses like he breathes, like he kills, like he wants his lips to be blood-red by the end of it. He uses too much tongue and he doesn’t come up for air even when he’s panting. It’s a little too wet and slippery, a little too much to be anything at all, but it’s a kiss. It’s Remus’ bottom lip between Sirius’ teeth. Remus kisses and kisses and kisses him and he does it all with his hand up Sirius’ shirt. Sirius wraps his legs around Remus’ hips and pushes him down, pushes up into him, chasing something that’s just out of reach even though there’s at least two layers of fabric between them. He’s just a little too desperate for it and a little too ruined to hide it. Remus shushes him softly, little cooing noises, trailing his lips down Sirius’ neck. Sirius’ shirt comes off and Remus’ shirt comes half-off and neither of them pay any mind to the hanging fabric, because Remus’ tongue trails down Sirius’ chest and fuck the shirt, actually. Sirius grabs onto the closest part of Remus — his shoulders, his neck — and he digs his nails so hard that he’s scared his fingernails might break skin. Remus makes a muffled noise into Sirius’ sternum that he feels reverberate through him like a sonic boom. Right now they’re nothing but physics and chemistry and biology. Need and need and need. When Remus is too far down to grab onto anymore, Sirius grapples for the next best thing. The walls. The tiles. The edge of the shower floor behind them. He shoves his fist in his hand and bites so hard he tastes blood. Moans into it. When Remus comes back up, he pulls Sirius’ hand out of his mouth and replaces it with two of his fingers. They were never like this in Hogwarts. They were gentler. Easier. They laughed more and they would crack jokes in between blowjobs and there was a learning curve much bigger than this one, but neither of them were frustrated by it. It was exciting, and a little daunting, but it was mostly fun. This isn’t fun. Fun implies that it’s not a necessity to their very functioning, and that’s simply not true anymore. Maybe it was fun before. Maybe it was something they wanted to do. But Sirius kisses Remus and takes his shirt off properly and shoves his hands in the back of his trousers and it’s no longer something that Sirius simply wants. He needs this. He needs. “Sirius,” Remus pants, tears in his eyes. Sirius shakes his head. He bites Remus’ shoulder and whimpers when he feels where Remus’ finger is trailing, his vision nearly whiting out. Remus pushes in slowly, slower than Sirius would like, so Sirius wraps his legs around Remus and drags him close by the heels, hard enough that Remus seems to take the hint. Sirius, in some masochistic way, wants this to hurt. He wants the evidence that they ended up here even after Remus goes away again. He wants this to be irreversible.  And Sirius cries. He cries and he sobs and he begs Remus and Remus coaxes it out of him firmly, gently, and Sirius thinks, damn you, Remus, you traitor, you cunt, you’re going to have me killed. You’re going to kill me. You’re going to kill all of us. You’re going to get yourself killed and I will never, I will never forgive you for it. If you die I will burn the world down and I will spell your name in the ashes. You traitor. Don’t be a traitor. Please be a traitor if it keeps you safe. I can forgive you if you're alive. You traitor. Don’t touch James. I love you. You traitor. What neither of them say is that Remus gets off on this just as much as Sirius does. They both harbour an unhealthy obsession with one another. They both bite too hard and leave marks where anyone can see. They’re both maniacal and batshit crazy. They’re both in love. Sirius screams when it’s over. He breaks down into sobs. He thinks he may need this, maybe even deserves this, and Remus gathers him in his arms and holds him, kisses the top of his head in sporadic little bursts that make it easier to breathe. When Remus buries his face into Sirius’ hair, he can feel the tears there. Remus is trembling, too. They’re both trembling in time with one another.Remus cleans Sirius with a cloth and warm water and Sirius slumps, tired, pressing occasional, grateful kisses to Remus’ shoulder. And then they go to bed, side by side. Remus’ head on Sirius’ chest. When Sirius wakes up the next day, he wakes up alone.  — The first time Sirius killed something, he was seven. It was a bird. An owl. It got sick, too sick to fly, though his parents didn’t care about that. Nobody could figure out what was wrong with it, but Sirius guessed that it was probably because his mother would use Cruciatus curse on it whenever it didn’t deliver a letter on time. She was a very exacting woman, Walburga Black. If the owl didn’t come back on time, she would hex it and sometimes she would make Sirius and Regulus stand in a line and watch. Birds cry, too, apparently. They scream. Sirius didn’t want to know that but he does. There was a day where Regulus and Sirius were home alone for some reason or another, and the owl came back from delivering a letter, its wing bent awkwardly and broken. It didn’t even make it to the window. It just collapsed in their garden, letting out little cries of help. Sirius and Regulus ran to the garden, but it was too late and the bird was clearly dying. Its bone was poking out, and it was bleeding out onto the grass like a little massacre, the first sign of war. Sirius didn’t love the bird. It didn’t even have a name — Walburga didn’t want them to get attached to it. He didn’t love the bird, but he cared for it. He cared that it was in pain when it didn’t deserve it. Birds don’t know anything about war. They don’t know how to start one. They just are, until they bleed out onto the grass of someone’s house, and then they aren’t anymore. Sirius remembers how Regulus tried to pick the owl up and how it shrieked, flapping its good wing and trying to bite Regulus’ fingers off. Sirius had to pull Regulus away before the bird did any damage no matter how much he struggled. Regulus threw up in a nearby bush, and when he came back, he did it trembling. The first Avada Kedavra Sirius ever used was on that bird. He didn’t want it to be in pain any longer, but more importantly, he didn’t want his mother to return and heal the owl’s broken arm just to put it through more hell. It deserves peace. Even now, looking back on it, Sirius doesn’t know whether he was the one to give it that.When his wand flashed green, Sirius flinched. Regulus didn’t, his face stoic but pale. Sirius didn’t shed a tear. Regulus didn’t either, at least not initially, but he crawled into Sirius’ bed in the middle of the night and sobbed, and Sirius pretended to be asleep so he wouldn’t have to give him a hug. The owl isn’t Sirius’ last kill, but it is his first, and that feels important enough to note down with the way Sirius has been acting lately. The war takes more blood than most of them thought it would. Sirius remembers how excited they were to make a difference. To be on the good side. James had grinned all throughout their first Order meeting. It feels almost laughable now, how naive they were even just a year ago. They were so fucking stupid. Now, things are different. Now, Regulus is dead. James doesn’t smile anymore. Lily is pregnant and snappy and fucking mean, which Sirius can appreciate in a time like this. Remus is becoming distant. Peter doesn’t look them in the eye anymore. And Sirius is the most brutal Order member the world has ever seen. Nobody talks to him anymore. They flinch when he moves too fast. He and Fabian went on a mission once, something that was supposed to be simple and ended up not, and when they came back Fabian had put himself in front of Gideon as if Sirius was going to kill them, too. Sirius knows what death feels like. It’s covered in blood. It makes squelching noises and it chokes on itself. The only person that doesn’t seem to flinch at the blood on his hands is Dumbledore. He sends Sirius on every possible mission and because it’s Dumbledore, nobody questions his authority. So Sirius goes and he murders and he rages and ravages and he comes back covered in blood. Dumbledore does nothing. He lets Sirius roam free like the savage dog he is. It’s Peter’s turn to go on a mission with Sirius now. Because that’s how they do it. They have to take turns babysitting Sirius lest he raises hell on any motherfucker who stands in his way, because that’s the compromise McGonagall and Dumbledore came to when they were still deciding what to do with Sirius. The whole thing is a little insulting, but not unprecedented. Sirius feels a little as though he unravels more and more every time he kills someone, waiting for the final string to come undone and reveal the black, hideous core of him. The Black in him. The horror he inherited from his mother. The mission is simple, as they always start as: Peter and Sirius have to clear out a safehouse in Amsterdam, because there’s a rumour circulating that the Death Eaters know its location now. It’s full of displaced muggleborns, and it’s vital that all of them survive. That’s what Kingsley says, at least. Sirius wouldn’t necessarily say it’s vital, per say. Though nothing to him is vital anymore. His brother is dead. That’s all there is, now. It’s mostly a stealth mission. They sneak into the safehouse from the back and start clearing it out one by one using portable Portkeys. Children first. Sick and wounded second. The rest last. Sirius sees a child with black hair and blue eyes scribbling on a piece of burnt parchment and gets her out first. It doesn’t matter that she has pigtails and cries when she has to leave her mother. She looks like Regulus, so Sirius gets her out first. It’s as they’re clearing out the last of the people that Sirius hears a hiss from outside. “Do you hear that?” Peter whispers.Sirius holds a hand up. He makes his way to the window and crouches down just enough to see outside. In the distance, he can make out the army of Death Eaters approaching, at least a dozen of them, all wearing ink-black robes and dark, silver masks. At their forefront is a snake, big enough to intimidate. Small enough to kill. “Get the rest out,” Sirius hisses, grabbing his wand. Peter immediately starts ushering people to the Portkey, ten at a time even though it’s dangerous, and Sirius makes his way down the stairs and out the back, slowly. He’s good at this part. The quiet beforehand. Maybe even better than the killing, because he grew up in a house with Walburga Black for a mother — he knows how to sneak around. The Death Eaters are quick, but Sirius is quicker. He kills three men without his wand and two with it in under a minute. One tries to sneak up on him and Sirius snaps his neck clean. It makes an ugly crack, something that should chill Sirius down to his bones. Not invigorate him. The sound shouldn’t make a delighted shiver crawl up his spine. Sirius wasn’t always this ruthless. When Regulus was alive, he never hurt Death Eaters more than what could be salvaged, just in case. Just in case it was his little brother behind the mask. But now Regulus is dead, gone somewhere even Sirius can’t reach, so he doesn’t care to be careful anymore. These were the people that had Regulus’ back, that were supposed to make sure he was safe. Once, that was Sirius’ job. But neither of them could keep Regulus from harm, and so Sirius turns his anger to the people responsible: Death Eaters. Voldemort. Himself, though he can’t do much about that, can he? He can kill and kill and kill and it won’t make the fact that Sirius couldn’t save Regulus any less true, won’t make the fact that Regulus died at eighteen years old just shy of his birthday, alone and probably scared, in a position he never should have been in. Of the two of them, Regulus was the better person. Sirius can admit that. He loved their mother even though she didn’t deserve it, and he loved Sirius even though he probably didn’t deserve it, either. He made the decisions he made because he cared. Sirius would even bet his life on the fact that Regulus died because he cared too much. Sirius doesn’t care. Not enough to stop. Eventually it’s just Sirius and one Death Eater. Sirius cracks his neck and lunges before the Death Eater can so much as think to run away. He slams the Death Eater to the ground and stabs the person’s own dagger through their leg. The cry the Death Eater lets out is eerily familiar, and yet Sirius doesn’t care, dragging the blade through muscle all the way down the top of the knee joint. “Are there more Death Eaters coming?” Sirius seethes. “Fuck you,” the Death Eater spits, so Sirius pushes down on the blade until their knee cap is just about to pop off. There are more screams, more cries, and Sirius doesn’t care. “Are there more Death Eaters coming?” Sirius asks again, a bite to his tone. This time, the Death Eater doesn’t respond, too busy grappling with their mask, and when they finally get it undone and pull it away, Sirius nearly freezes. Nearly. It’s Evan Rosier. His face is pale, paler than usual, yellowing quicker the more blood he loses, and his head is bleeding where it slammed to the ground. His eyes flicker to Sirius and there’s a desperation there, a miserable sort of pleading, as though he knows it will be pointless but he will try anyway. Evan Rosier once belonged to Regulus. Which makes Sirius hesitate. But then he remembers that the man before him was meant to be Regulus’ best friend, was meant to protect him, and somehow Regulus still died and that’s— that’s on him. He yanks the dagger out roughly and revels in the way Evan screams himself bloody hoarse. “I’m sorry—” Evan groans, tears in his eyes. “I’m sorry, please, Sirius. Don’t— don’t kill me. I just— please, Sirius, please.”Sirius picks up the dagger. Evan’s dagger, apparently, except Sirius recognises the carving on the handle. He remembers giving this to Regulus when they were kids, just in case. He had bought it with his own money, bits and pieces that he was stealing little by little so that his mother wouldn’t notice any of her money was gone. It’s a piece of Regulus Sirius never thought would return to him, and yet here is it, in the palm of his hands. He lifts the dagger up. “No, no, no, no, listen!” Evan screams, trying to push himself up. Sirius watches with cool disinterest, dagger still raised. “Listen, that— that was Regulus’ knife. It was his. He gave it to me. He— he told me to protect it.”Sirius hums. “Really?” he drawls sarcastically. Evan nods. “Yeah, yeah, it is. It’s his. You— you can take it. It’s yours. Just please, please don’t— don’t do this. Regulus wouldn’t have wanted this.”\nDon’t tell me what he would have wanted. I know that better than you. I know he would hate me for this.\n“Regulus is dead,” Sirius hisses. “I’m sorry,” Evan sobs. “I know, I know, I’m sorry. Please, please, just— just let me go, please. I won’t tell anyone. I won’t— Sirius, please— you weren’t like this before he died, you weren’t— please, Sirius, please, I’m begging you—”“Are you done?”“I just want to go home,” Evan cries. “I just— please, Sirius, no, no, no—”Sirius drives the knife into Evan’s throat before he can even finish pleading for his life. Evan is right— was right. Sirius wasn’t like this before Regulus died. His murder sprees started a month after Regulus was confirmed dead, and before that, he had barely killed anything at all. Just that owl, really. Sirius pulls the dagger out of Evan’s throat. Wipes the blood on his trousers and then pockets the dagger. Vows to keep it with him at all times. He gets up and turns around to find Peter standing there, eyes wide. What a sight Sirius must be, then, covered in blood, surrounded by bleeding bodies. There’s a man still twitching in the corner, paralyzed. Sirius is quite sure he’ll be dead in two minutes. Despite the shock on his face, Peter doesn’t look scared. He looks… apprehensive, maybe. Cautious. Something else that isn’t either of those things but that Sirius doesn’t have the capacity to name at the moment. “Did you get everybody out?” Sirius asks. Peter nods, and that’s that. They go home. He’ll find out years down the line that it wasn’t just apprehension and caution on Peter’s face. It was also a realisation. He’ll find out in some nebulous point in the future that two weeks after Sirius killed Evan, Peter had joined Voldemort’s ranks and became a spy for the order. He’ll find out, but not before James’ body falls, already dead before he hits the ground.  — They don’t find Regulus’ body. At first, that fills Sirius with hope. If there’s no body, then he can’t be dead. Just missing. Gone. Not yet found, and maybe never found. Sirius hopes and hopes and hopes and feels stupid for hoping the longer the weeks drag on. But Regulus might still be alive. He might’ve just ran away. Merlin, Sirius hopes he just ran away. James helps. He stays on Sirius and Remus’ couch and cooks meals when Remus is gone on mission, coaxes Sirius into showers and makes sure he brushes his teeth. If it weren’t for James, Sirius would probably rot in his bed, but James would never allow that. The weeks stretch on. Sirius grows more and more catatonic and James doesn’t leave, and sometimes Remus is there and sometimes he isn’t and Sirius loves him, he loves this man with a conviction like no other, but he can’t be a person who’s easy to love back right now. He is not a lover anymore, or a friend. Just a brother. When the three week mark hits and there’s still no sign of Regulus, the Daily Prophet declares Regulus presumed to be dead. Sirius burns every edition he can find and nearly lights their coffee table on fire. Regulus Black: presumed to be dead. If they do find a body, would there be a funeral? Would Sirius be allowed to attend? He doesn’t think he’d want to, or that he should, because it’s his little brother, little Reggie. Regulus used to cry whenever Sirius killed bugs and cried when Sirius caught them instead to release them back out. Sirius remembers being so annoyed at Regulus for crying about something so stupid, especially because he’d seen Regulus take worse for less. He remembers berating Regulus for crying when they had to let go of a spider. It’s just a bloody bug, Sirius had sighed, and Regulus had wiped his tears away roughly and turned away from Sirius. Sirius was so fucking stupid. He should’ve given Regulus a hug. Should’ve comforted him. Maybe then, Regulus wouldn’t be missing/presumed to be dead. A month passes by, and Sirius gets a letter. He doesn’t get to see the owl that delivered it, but there are little blood splatters where its nails were digging into the letter, so he knows before he even reads the return address that it came from his mother. The letter, which Sirius rips open with tremors in his hands, is quite straightforward.  \nSirius Orion Black,\n\nThe Noble and Most Ancient House of Black expresses our greatest sorrow to inform you that Regulus Arcturus Black is confirmed dead. His date of death has made itself known on the Black tapestry in 12 Grimmauld Place, 23-29 Claremont Square, Islington, London on the 28th of November, 1979. As there is no body to be found and buried, there will be no funeral, but there will be a wake on the 4th of December should you choose to attend. \n\nAll the best, \n\nThe Noble and Most Ancient House of Black. \n Sirius reads the letter again, and again, and again, and then he checks the calendar on the wall that reads December 21st, 1979. This must be a mistake. This— this— he can’t be— Regulus isn’t—“Padfoot?”Sirius looks up from the letter and finds that he can’t see James properly through his tears. “It says he’s dead,” Sirius croaks, and then he crumbles to the ground. James has to gather the remains of Sirius in his arms and hold him, but Sirius doesn’t sob. He registers the tears absentmindedly streaming down his face, and he thinks he may be shaking, but he can’t really feel it. He can’t really feel anything anymore. He thinks the part of him that was human was a brother, and now he isn’t. He isn’t a brother anymore. Regulus is dead. He’s been dead for a month, and Sirius didn’t know. Shouldn’t he have felt it? Shouldn’t he have known that Regulus was gone the moment he passed away? Sirius always thought that when the time came, he would know. But even now, even with the confirmation crushed in his hand, he can’t really believe it. Regulus Black is dead. Regulus is dead. Little Reggie is dead. The days pass on and Sirius does nothing. He tries to wrap his head around the words Regulus is dead and finds that he can’t manage it, because how, how is Regulus dead? He was right here. They played in the snow together just yesterday. Didn’t Sirius just give Regulus the last slice of pizza? It all feels close enough to touch. Sirius reaches his hand out into the empty space and can almost feel his fingers carding through Regulus’ hair. He was just here, wasn’t he? He was. Except Sirius hasn’t properly talked to Regulus since graduating from Hogwarts. Years down the line, Sirius will find that he can’t remember most of his grieving process, save for one day. It happens two days after Christmas. Sirius is left home alone for some reason or another, but he can’t really remember why. James said he was going to get food, so maybe it’s that? Except James could have said that days ago and Sirius wouldn’t have noticed. Where is James? Remus? Sirius wants to go check for them, but he doesn’t think he can’t. He wants to see the tapestry. He wants to see the confirmation right before his eyes.Sirius is apparating to Grimmauld Place before he can think better of it. When he lands with a heavy thud, Sirius looks up. The house looms over him like a premonition, dark and imposing, black brick that reeks of dark magic. All the curtains are shut, and it’s dark, all dark. Sirius didn’t realise it was nighttime. How long has he been waiting for this? What is he doing here? He shouldn’t be here, his mother might see, he might put Regulus in— oh. Regulus is dead. Regulus is dead. He’s no longer in danger. Sirius doesn’t have to care anymore. A figure peaks out from one of the windows, who Sirius recognises as Kreacher. He slips away before Sirius can get a good look, though. Sirius picks himself up and dusts off his pyjamas. On shaky feet, he starts walking to the front door. He doesn’t bother knocking — Kreacher probably told Walburga that he’s here, so he might as well do as he fucking please. He opens the door and walks in, making a beeline for the living room. “Sirius.”He freezes. Orion is slumped on one of the arm chairs. His previously black hair is streaked with grey now, and where he was once large and imposing, he is now hunched, thinner, frail. His cheeks are sunken in. There are deep bags under his eyes. Beside the arm chair he’s sitting in is an intravenous pole, an IV bag hanging off of it. He’s not wearing the typical suit and tie Sirius remembers him constantly wearing, even in the house. Instead, he’s in a plain shirt and pyjama pants. The sight is so jarring that Sirius blinks, trying to remember where he is. “Father,” Sirius bites out. “You should find yourself lucky that your mother isn’t home today,” Orion muses blithely. “She would’ve had your head on a platter.”Sirius inhales. “Where is Regulus?” Orion gives him a look that could be akin to pity, except Sirius has never seen pity on his father’s face before, so he doesn’t know what it actually looks like. “Regulus is—”Dead. Oh. Yeah, he is. “The tapestry, I mean,” Sirius corrects. He’s surprised by the strength of his own voice. Orion gestures vaguely to the wall in front of him, “Go ahead. You remember where his name is, yes? I won’t get up to show you if you forgot.Sirius doesn’t answer. He walks up to the tapestry and traces the names, following the branches down to the recent generation of children. Narcissa. Bellatrix. The scorch mark where Andy used to be. The scorch mark where Sirius used to be. Sirius touches his own name, the place where it says 1959– and no death date. He moves on. He finds Regulus easily. He’s the only one out of the cousins with a skull instead of a face. Sirius swallows, looking at the inscription. \nRegulus II. 1961-1979.\nRegulus is dead. Regulus is dead. Regulus is dead. Regulus is—“Found him?” Orion asks. Sirius swallows. He turns slowly to Orion, something thrumming in his veins that he doesn’t understand, but it doesn’t scare him. “He never should have died,” Sirius whispers, eyes burning with tears. Orion clicks his tongue, shaking his head. “He wouldn’t have, if you had taken the Dark Mark instead. It’s a shame, really, that the wrong son died, but maybe it was for the best. He was pathetic sometimes. Defending you when he could. I pity him for ever having loved you.”Sirius doesn’t know what happens next. All he knows is that one moment, he’s pulling his wand out, and then he blinks, and he’s covered in blood. Where Orion sat not even a moment ago is now a display of torn muscles, tangled organs, shreds of skin hanging off the bones, dripping red. Ligaments and tissue hang off every surface as if this place is a slaughterhouse and not a living room, a squelching, rotting carnage. His skull is smashed in, and the mush that once used to be his brain drips out slowly, drip, drip drip. A bloodbath. Decimation. It is the brutalist of executions. There’s not even a body to salvage, not even a finger left untouched in the wake of it all. A wild animal has torn Orion Black apart. Sirius stares down at his hands. There’s blood under his fingernails where his claws are retracing. He touches a hand to his hair and they come back crimson with blood. He rolls his neck and it feels stiff, the same way it always feels when he transforms back from Padfoot. He is covered head to toe in blood. A wild animal has torn Orion Black apart. He picks up the nearest part of Orion — it looks like it used to be his liver. Flesh feels soggy, Sirius notes, when saturated with blood. Sirius drops the pound of flesh and doesn’t flinch when it falls with an ugly splat. A gasp comes from behind him. Sirius whirls around and finds James standing by the door, frozen. “Sirius, what did you do?” James curses. “I don’t know,” Sirius says, or at least he thinks so, because he can’t actually hear his own voice. He’s not even sure he spoke aloud to begin with. He looks back at the bloodshed. Can’t tear his eyes away, really. He did that to a person. He did that to his father. “Sirius, hey, hey. Look at me. Look at me.” When Sirius doesn’t look up from the massacre that used to be his father, James grabs him by the face and forces their eyes to meet. “Sirius, you need to breathe.”Sirius isn’t breathing. His vision is starting to fray at the edges, oxygen deprivation, but his lungs refuse to work. He thinks he might be gasping. He thinks he might be dying. In all the duration of the war, Sirius hasn’t killed a single person. Not one. And now his father is unrecognisable. James grips Sirius and apparates them back to his apartment. Not Sirius and Remus’ apartment, Sirius notes, stumbling. No, James’ home. James sits Sirius down on the couch and doesn’t seem to mind that he’s getting blood everywhere, spreading it around like a disease. Sirius curls into himself and tries to remember how to make his lungs work again. James apparates away with a click, not even a goodbye. Sirius would be worried, but this is James’ apartment. He has to come back at some point. James is gone. Regulus is dead. Sirius— Sirius killed—Regulus. Sirius killed Regulus. Sirius killed someone that had Regulus’ nose, had his hair and his jaw and his smile. Regulus is dead. Sirius couldn’t save him, couldn’t get him out, didn’t even try to get him out. Regulus was always the smarter one out of the both of them, and now he’s dead. Sirius might as well have killed him. Regulus is dead. He’s dead.He’s dead. Regulus is dead. When James comes back in the early morning light, blood smudged against the front of his shirt, Sirius still hasn’t moved from where he’s curled up on the couch. The blood is sticky now, drying to his clothes and hair, making them stiff. Sirius watches James wipe the blood from his hand with a kitchen towel calmly, a pensive look on his face. “What…” Sirius begins to ask, and when he can’t find the words, he points at James’ shirt. “I cleaned it up,” James states simply. Sirius doesn’t ask what it is. He nods. James doesn’t flinch when Sirius gets up. He doesn’t move when Sirius approaches him, standing next to him, taking the kitchen towel to clean James’ hands himself. His hands are trembling, but James doesn’t stop him. He just holds his hands out and lets Sirius smear the blood around, making a mess. “Aren’t you scared?” Sirius finds himself asking. “What?”Sirius swallows. “I killed him, James.”“I know.” “Why are you so calm about this?” James pauses, considering, and he states quite plainly. “If your mother were there, I would have killed her for you.” Sirius blinks. He blinks again. He sits with the sentence a little bit, but it doesn’t change. \nIf your mother were there, I would have killed her for you.\n“I’ve hated your parents for as long as I’ve known you, Sirius,” James continues, taking the towel out of Sirius’ hands. “So I can’t say I’m not even the least bit pleased that Orion is dead. I would’ve killed him myself if I had the chance. I would have done the same and maybe more, just for the way he treated you— you and Regulus.”Sirius winces at his brother’s name, but James is undeterred. “I’ve had this image in my head for a while, your mother and father dead and me on the other end of the wand. I would’ve done the same, Sirius.” He shrugs. “So no, I’m not scared.”Sirius nods, he nods and nods and nods and then he starts crying, the first time he can remember doing so since the initial news of Regulus’ death. He lets the tears stream down his face and James stands there and lets him, steady, strong, unbreakable James. Immortal James Potter. Indestructible. When they sleep, it's in the same bed, Sirius curled up as Padfoot in James’ arms.  — The war is gruelling. It’s only the beginning, Sirius knows that. He knows they've seen nothing yet. But it takes more out of him than he realised, more and more and more. He tries to remember what they’re fighting for. He tries to remember that war is good. War is good. That’s what Dumbledore says, at least. War brings change. War is good.  People keep dying all around him. Sirius keeps count. He never wants to be so closed off that death doesn’t hurt. He wants to care, if only for the sake of caring. He wants to care. He does. Caradoc Dearborn is the first to go. There’s no body, nothing to confirm that he’s dead, but when six months past and there isn’t even a whisper in his voice, Dumbledore sighs and tells them all that maybe holding out hope for Dearborn is fruitless. Lily cries, silent tears streaming down her face. James doesn’t speak for the rest of the meeting. Remus squeezes Sirius’ hand under the table, and Sirius swallows down the lump in his throat. The Bones family dies next, and this one is so much more brutal. Edgar Bones, his wife and his three kids are all found dead in their home, bodies already gone cold. Edgar’s face is frozen in a mask of anguish, and there are dried tear tracks on his son’s cheek. The oldest child was ten. The youngest just an infant. Peter and Dorcas are tasked to carry out the bodies, and when they come back, neither of them stay for the briefing. They just leave, silently, and they come back the next day as though nothing is amiss. Benjy Fenwick doesn’t just die; they find his remains scattered across three different rooms, his heart hanging on a pyre in the kitchen. His death wasn’t quick — everyone can tell. There’s an eyeball on the ground. A finger near a chopping board. He didn’t even die in his own home. He died in a safehouse he was supposed to be setting up, a hollow, draughty place. Dumbledore tells the public it was a Blasting curse, and everybody believes him, but Sirius and Lily were the ones to find him. They had to get a bin bag to collect him all. The death that hits the hardest is Marlene and the rest of the McKinnon family. The whole family, once alive, now dead and growing cold. Sirius counts the deaths in his head: Marlene. Her three brothers. Her mother and father. Her uncle. Her aunt-in-law. Their four kids, Marlene’s cousins. Her grandmother. They all die on Boxing Day, screaming in pain and begging for their lives. Lily cries so hard she throws up and Remus doesn’t get out of bed for three days, no matter how much Sirius tries to coax him out. And then Dorcas dies. Now it’s James’ turn not to get out of bed. He was with her on a mission when she snuck off, killing an army of Death Eaters in her wake. It was the first bloody battle of the war, and Dorcas has started it in the name of putting Voldemort’s head on a platter. He had to kill her himself. The last thing she’d ever said was a small, choked Marlene, and then her eyes glazed over and she was dead. James blames himself for it, Sirius knows it. He tries to tell James that there was nothing that could have stopped this, but then he realises that nothing he could say would take away the pain. There’s nothing to do but hold James. So he holds James.  Dougal McGregor is next, the first death after a relatively calm three months. McGregor, his wife and his two children. Graham and Bill. They were twins, and Sirius remembers them being so ridiculously shy. Sirius hasn’t stopped counting, but he doesn’t care as much. He adds four to his mental tally and moves on. Sirius hates all the death, but selfishly, he doesn’t think it’s so bad. James is still here. Remus. Lily. Peter. Even Regulus, who Sirius keeps tabs on occasionally. Yes, Regulus is a Death Eater, yes he kills with ruthlessness Sirius didn’t think he was capable of, but he’s still Sirius’ little brother. He keeps tabs, and secretly, he finds himself a little grateful that Regulus is a Death Eater. The Order members are dropping like flies, and Sirius would rather Regulus be safe than good. He’d rather him evil and alive than noble but dead. Once, Sirius wanted to save the world. Now, he just wants to save his world. His people. He’ll make sure nobody touches them, no harm comes to even a hair on their heads. His mind is now a tirade of chants, over and over and over:\nNot Regulus. \n\nNot Lily. \n\nNot Peter. \n\nNot Remus. \n\nNot James. \nAnyone but them.  — Sirius and Remus get their own studio apartment. It’s a small, bare thing, not entirely furnished and too scarce to be properly livable, but it’s theirs. They’ll make do, together. It’s been a hectic summer. There was apartment hunting and job hunting and saving up money for said apartments, furniture shopping in between nights out at muggle pubs, live music and drinking and dancing. On one such night, James kisses Lily and she kisses him back, both insisting that it was nothing, but James spends the rest of the evening glancing at Lily from the corner of his eye. He used to glance at Regulus like that. Before. In between nights out and moving and dicking around in the London heat, they attend their first Order meeting. It all feels so exciting, saving the world. Fighting evil. Being on the good side. Sirius can’t say that he’s ever been a good person, but maybe this war will get him closer to it.James grins throughout the entirety of their first Order meeting. Sirius doesn’t, but he wants to. Remus makes fun of them both for it later, and Peter laughs. Lily swats them all over the head and tells them that a war is not to be joked about, but Sirius can see her biting back a smile, so it can’t be too bad. Sirius and Remus throw a housewarming party on the last night of the summer. August 31st. It’s mostly them drinking and getting high, Remus passing joints and Sirius pouring wine into everyone’s glasses. Marlene and Dorcas cuddle up on the couch and Mary watches wistfully as Lily and James talk in the corner. Peter does card tricks and beats everyone in chess, always three steps ahead when it matters most. James insists that one day he’ll win against Peter, but they all know that time will never come. They order pizza from somewhere close and practically inhale it. Marlene throws a full slice at Sirius, and it lands on his face with an ugly splat that makes him screech. Everybody laughs. Sirius pouts even though he doesn’t really mind it all. He likes the laughter. He likes that it warms their home a few degrees. “Come here,” Remus murmurs, and Sirius lets him clean the mess of cheese and tomato sauce with a barely-contained grin. When Remus touches him, it feels like a dynamite explosion. Catastrophic. Sirius wants to touch Remus again and again and again and he never wants to stop. Again and again and again.  After, when Sirius’ face is clean, Remus smiles fondly at him and tips his chin up for a kiss. James whoops and Marlene boos and Dorcas and Lily groan and Peter and Mary laugh and Sirius can’t help but giggle into Remus’ lips. Remus pulls away, but Sirius isn’t done. He gives him one, two, three pecks, before pulling away and grinning. The mood doesn’t get solemn intentionally. But the end of the night creeps in, and the wine and weed wear away, they all sit in the living room, smiling at one another, basking in what they must’ve all realised would be their last good day. “Do you think it’ll be okay, in the end?” Marlene asks, her head on Dorcas’ shoulder. “After all this, I mean. After the war. Do you think we’ll all be okay?”James takes Marlene’s hand and squeezes. “Why wouldn’t it be?” he asks, and Marlene looks away, a frown on her face. “I wonder how long the war will last,” Peter muses. Mary shrugs. “Not too long, I hope,” she says, soft, and Lily looks up at her with a reverent look in her eyes. “I want to be able to come back when it’s all over, so don’t make me wait too long, okay? End it all quickly so we can go back to being us.”“I hope it isn’t brutal,” Peter adds. Marlene nods. “Me too. I don’t want to die in some mucky battlefield and leave my brothers behind. I don’t want— I don’t want my parents to have to bury their only daughter.”“You’re not going to die, love,” Dorcas chastises, kissing the top of Marlene’s head. “You won’t. Not if I can help it.”“I just want to see Regulus again,” Sirius admits, because he wants to be able to say it to someone. He wants someone to hold him accountable, make sure he keeps his word when it’s all over. “And keep you all safe. But mostly see Regulus.”“Are you saying you wouldn’t die for me, Pads?” James quips, a hand on his chest. “The betrayal.”Sirius rolls his eyes. “Shut the fuck up.”James laughs, but then his smile turns sad, and he looks at all of them with a melancholic smile on his face. “I would die for you,” James confesses. “All of you. I would die for any one of you in a heartbeat.”“Don’t be morbid, James. None of us are going to die,” Lily admonishes. “Soon the war will be over and it’ll all feel like just one bad dream,” Remus adds, wrapping an arm around Sirius’ shoulders and kissing his temple. Sirius leans into Remus’ warmth and can’t imagine a life where he and Remus are in the same room but not in each other’s arm. “And we’ll all be together?” Sirius asks. James smiles his brilliant, wonderful smile. “We will.”All their guests start filtering out soon after, until it’s just Sirius and Remus, getting ready for bed together, hips knocking as they brush their teeth. Remus holds their blanket open and Sirius crawls into bed, unreasonably excited to wake up with Remus tomorrow. Remus falls asleep first, the moonlight illuminating their room a soft, simple white. Sirius traces the scar on Remus’ chin, softly, careful not to wake him, and Merlin, Remus is beautiful. If Sirius had known how it would’ve all ended, he wouldn’t have let anyone leave the house. He would’ve kept them in the kitchen and he would’ve ordered more pizza and wine and he would’ve— he would’ve dragged their last good day on and on and on, forever, as long as he could manage to get away with. He would’ve kissed Remus a few times more and he would have hugged Lily to his side and held her for as long as she’d allow. He would’ve taken James’ hand, and he would’ve said yes, yes I would die for you, in a heartbeat, in an instant, and even if I don’t die saving you I will die for you. My death belongs to you. If Sirius had known, he would’ve invited Regulus. He would’ve pulled his brother in for a hug and kissed the top of his head, and he would’ve gotten him an owl. He would’ve invited Regulus to stay, and then he wouldn’t have let him leave. Oh. If only they had known.",
	"45744598000": "“Don’t do anything I wouldn’t do!” Sirius bellows at them as they drive off into the night and head towards the airport. James chuckles and winks at Regulus, who bites his lip and smiles. Barty rolls his eyes and glues his forehead to the window to watch the passing buildings. Gloomy England says its goodbyes to them for two long weeks. Tenerife awaits. Evan has his AirPods in, he’s mindlessly humming to some tune that Barty doesn’t recognise. James and Regulus sprawl in the front seats and whisper sweet nothings to each other. James is driving with one hand and the other draws circles on Reg’s shoulder. Barty relaxes and closes his eyes, tuning out his surroundings. It was a well deserved vacation, long awaited and meticulously planned by control freak Regulus, and funded mostly by James and his ginormous trust fund.  At first, Barty was in two minds about this whole idea, but Evan, slowly but surely, coaxed him into it.“It’s Tenerife. We can do fuck all, lounge about the hotel, stuff our faces, and then go out to get plastered and hit on randomers in bars. Half of the UK population’s going to be there, so you’ll get your pick of pasty white guys, I’m sure of that.” Barty snickers at the memory and peaks at Evan through his eyelashes. His profile is illuminated by the streetlamp lights and he looks serene, immersed in his beloved music, lips moving silently to the lyrics. In the recent months they’ve all been inordinately busy. Barty with his training studio, Evan with his teaching school. They’ve met on occasion, for a beer and a heartfelt chat, and more often than not, a quick fuck on top of the covers, and then in the shower before Evan had to leave for work the next morning, just for good measure. Barty is eternally dumbfounded by their inexplicable ability to keep their friendship intact after their failed attempt at dating, and now, with all this casual sex that just keeps happening. There’s no hard feelings, he assumes, or rather hopes that’s the case. Evan has always worn his heart on his sleeve and never shied away from brutal truths. If Evan had an issue with how they carried on after the breakup, Barty had all the reasons to believe he would have brought it up. But that hasn’t happened yet, and they remain trapped in this cosy, convenient limbo of being… them. The flight is rather uneventful, aside from a snafu with the poor, traumatised flight attendant who has to drag James and Regulus out of the toilet half way through the journey. She refuses to look them in the eye and asks her colleague to attend to them for the rest of the flight. “Fucking mile high club… Really?” Evan scoffs, shaking his head.Regulus sits down next to Barty, looking debauched and dishevelled, sinfully fucked out. Barty squirms in his seat, trying not to stare at his pink cheeks and ruffled hair. He can smell James’ cologne off him, as if James himself was sitting to his right and not across the aisle with Evan. “She totally blueballed us,” Regulus complained, scrunched his pretty nose at the front of the cabin where the flight attendant was currently hiding.“She’s doing her job, you psycho,” Barty jeers and returns to his book. His hard-on goes down after a series of calming breaths.  Mind over matter,  Barty muses as he thumbs through the book. Regulus wiggles in his seat and finds a comfortable nook to collapse in. His head is resting on Barty’s shoulder. Barty wants to shake him off, but the reassuring warmth emanating from his skin and the tickle of his black locks on Barty’s neck is too good to pass on. He suffers through the discomfort. His thighs twitch as he slides down the seat, posturing his body to create the comfiest pillow possible out of his stiff shoulder. Regulus hums contently and nods off seconds later. Barty peaks at James curiously, expects a death stare and a snarky comment, but James is engrossed in a conversation with Evan, swiping on his phone like a man possessed. Evan snickers and whispers something right into his ear. They both collapse in a fit of giggles. Barty elects to ignore them and make a valiant attempt at digesting the words he sees on the pages. He fails miserably, his mind in high alert and centred on every breath Regulus lets out and every slight twitch of his sleeping body.They spend the better part of their flight like that, snuggled against each other. Barty savours the moment. They’re in the final approach when Reg stirs and jerks away, darting his eyes around the cabin, disoriented. James is searching for their luggage in the overhead lockers. He strokes Regulus’ cheek affectionately. Regulus murmurs into his palm and presses his face into James’ stomach, wraps his long arms around his waist. “Did you sleep well?” James chuckles and cradles Regulus’s head, stroking him leisurely behind the ear. Regulus mumbles his response into the patch of skin above his navel. Barty presses his lips into a thin line and pretends not to pay attention, his eyes glued to the pages. As soon as the hatch door opens and the holidayers spill onto the concrete airport and into the scorching sun, Barty loosens up and forgets about Regulus. At least till they’re on the bus to the hotel and Regulus lumps himself into the seat in front of Barty, with James glued to his side, his wandering hands slipping under Regulus’ shirt. Barty soaks up the views. He was lucky enough to get a window seat. He drags his eyes across the shoreline. The water is ridiculously blue, the waves high, and the air smells like a promise of days to come. He tries to drone out Regulus’ snickers and James’ impassioned commentary, but they spill mercilessly over the seat and into Barty’s waiting ears. “I fucking hate them sometimes,” Evan rubs his forehead and exhales loudly. He speaks in a hushed tone, which is not necessary, Barty thinks. Both Regulus and James are too occupied with each other to eavesdrop on their mundane conversion. “Fuckers can’t behave in public.” “You’d think they’d stop by now,” Barty grimaces. “It’s been over a year of this shit.” When they get to the hotel and drag their suitcases to the lobby, Barty is more than ready for some alone time, and by alone, he means no love birds around. Evan he can handle. Regulus and James stay in the room for a quick fuck to relieve the tension after the arduous journey and the blueball incident. Barty and Evan make their way down to the hotel pool. Evan grabs them a pair of towels from the reception and gets into a spat with some kid who tries to one up them and swipe a pair of sun lounges right from under their noses. They get to plop down eventually, stretched out in the sun. Barty takes a deep breath, his lungs flooding with a grating smell of chlorine and burnt burgers coming from the hotel bar.  Perfect. Could not have planned it any better. Evan is at his side, humming contently, and Barty’s holding a full martini glass in his hand, swirling it around. He sips from it as he adjusts his sunglasses. He cracks his spine loudly and cackles at the juicy string of expletives that pour out of Evan. “Can you not do that, for fuck’s sake?” Evan spits out and sticks his AirPods in aggressively. “It freaks me out.” “Sorry, darling.” This is exactly what he’s been waiting for, Barty thinks to himself. He just has to stay on his game and not slobber over Regulus when he gets to watch him strutting around in swimwear, bathing in the sunlight, or licking ice cream from his, and probably James’, fingers. It’s going to be tricky, but not unfeasible. Evan’s presence sweetens the deal. It’s them against the world.  ⦽⦽⦽⦽ They spend most of the time mooching around the hotel and the neighbourhood, checking out the nearest beach first chance they get. The food at the morning buffet is exquisite. Barty stuffs his face until he can no longer move. They always sit together at breakfast, chattering and sampling the dishes. Barty admits that when Regulus and James are not sucking on each other’s necks, they’re actually decent company. On the third day Regulus gets antsy and makes them all take a trip across the island and up a mountain trail. They get back to the hotel sweaty and spent, craving bed more than any of the pleasures the island has to offer. To Barty’s discontent, James has enough energy to make Regulus come before they fall asleep in the adjacent room inside their luxurious suite. Together with Evan, they get to listen to Regulus’ swallowed whines for a good ten minutes before he arrives at the long awaited completion and blessed silence surrounds them once more. Barty almost suffocates himself with the pillow, trying his damn hardest to muffle the sounds. He has to roll over onto his stomach to conceal his hardening dick from Evan’s wandering gaze. “Get up,” Barty hears feet shuffling to his right and then Evan’s hand is pulling him off the bed sheets. They end up in the shower, cool water washing the sweat and sticky mud off their worn bodies, while Evan sinks to his knees and sucks him off, quick and dirty. Barty comes in the back of his throat with a stifled moan, his head banging painfully on the tiles. Evan wipes his mouth, climbs back on his feet and brushes the tip of his nose up the column of his throat. “Better?” he chuckles and licks some of the come into Barty’s parted mouth. “Much better,” Barty cups his cheeks and swipes his tongue out, licking on his bottom lip. They wrestle under the water stream, until Evan has him pressed against the wall, his warm breath tickling his nape. Barty gets fucked, torturously slowly, meticulously, as if Evan’s trying to take him apart with his cock, and with his broken moans and obscene words. They wash the come off their bodies and slip out of the shower. The apartment is dead silent when they slip under the covers. They elect to ignore Barty’s king and end up in the twin bed, their limbs tangled comfortably. The weather outside is stiflingly hot, but with the aircon buzzing quietly in the corner, their room is blissfully cool. “You got to rein it in,” Evan’s stroking his shoulder affectionately. His hair is still damp and he smells of citrus. Barty glues his eyes to the ceiling and remains silent, at first. “Whatever do you mean?” “Your schoolboy crush is showing,” Evan doesn’t budge and drills down. “James is not going to like it.” “What about Regulus,” Barty snaps, his brows furrowing. “I think I’m more worried about him.” “I have a feeling,” Evan hesitates and then says, “that our dear Regulus knows.” Barty twitches in Evan’s arms, feeling flustered. “Are you serious?” “I think he puts on a bit of a show for you, if I’m to be completely honest.” Evan broods, tapping a finger on his chin. “He definitely suspects.”Barty drags a hand over his face and whines defeatedly. “That means James knows,” he murmurs. “That little fucker tells him everything.” “I’m not so sure. I feel like if that was the case you’d be walking around with a broken nose by now.” “Nah, he can be a jealous bastard, but he’s not unreasonable,” Barty shrugs and turns towards Evan, burying his face in his smooth neck. “He would only have a go at me if I tried something. I’m not that stupid.” Evan chuckles and pulls him closer, his fingers skimming over his bare back, nails scratching the skin. “Well, I might be wrong. Regulus is pretty observant, even when he’s seemingly not paying attention.”They drift off after that, their faces inches away. Barty can feel his worn muscles thrumming under the covers, his taut body relaxing after the spectacular orgasm and the rest of the salacious events under the shower. Evan starts snoring, which is his cue to turn to his other side and attempt to get some sleep. He floats away into nothingness and dreams about Regulus and Evan going down on him at the same time, their tongues lapping at his dick and up his shaft, their teeth grazing the veiny underside. He wakes up with another raging hard on, which he gets rid of by humping Evan’s hip. Evan stirs awake and immediately bursts out laughing, but sticks his ass out obligingly and lets Barty rut against him till he comes in white streaks over the sheets and between Evan’s legs. “You’re so amped up these days,” Evan sniggers while wiping the come off the bed with his sweaty shirt from the hike. “What are you, sixteen again?” “I honestly have no idea.”  ⦽⦽⦽⦽ Minutes, hours, and days seem to pass at an accelerated pace. Before they know it, it’s ten days later and the dreaded flight back home is just around the corner. They went sightseeing, they hired a private boat to take them to see Los Gigantes which, in Barty’s humble opinion, might have been one of the most exhilarating experiences of his short life. They swam with a pod of dolphins and saw a massive sea turtle wobble past their boat. That whole afternoon was glorious. Evan stuck by his side, and Regulus and James were surprisingly amiable, too mesmerised by the views and the fauna circling their boat to pay heed to each other. The next morning, they decide they desperately need a ‘laze around and do nothing day, with no concrete plans whatsoever.’ They go their own ways and agree to bring beers and smokes to their favourite beach on the outskirts of the town. The beach is never crowded and ideal for late night ventures and drinking with a majestic sunset providing a perfect accompaniment. Evan brings a bottle of white in a cooler he bumped from the hotel bar, and Barty treats him to his freshly purchased tobacco. They smoke and drink in comfortable silence until James and Regulus turn up with a case of beers under James’ arm. Regulus decides to venture out for an evening swim and Evan jumps on the occasion. James slumps to the ground next to Barty, bumps his shoulder companionably, a wide grin stretched on his handsome face. “How was your day?” “Not bad,” Barty leans back and props himself up on his elbows, eyes searching for Evan and Regulus’ heads popping from between the waves. “What about you?” “It was great. I needed that for sure.” James cracks open a can. “We ate our fill at this lovely seafood restaurant and then went back to the hotel. Slept some more and then just faffed about.” “Lovely,” Barty responds, his train of thoughts inevitably leading him to to ponder the amount of fucking they must have done in that empty suite while Barty and Evan were out. They probably fucked on their beds. Disgusting. The only upside was that when Barty retires for the night he’ll get to stick his nose into the pillow and smell Regulus all over his bed sheets. “What did you guys do?” James wiggles his eyebrows and points his head towards the waves. Barty scoffs, “You know we are not together, right?” “You sure seem like a couple, and I mean that as a compliment. You’re cute together.” Barty grimaces and gives James a scornful look. “Cute is not the word I’d use,” he says. “We’re just friends, who somehow get on after a break up and enjoy a casual hook-up. It works. I wouldn’t want to change that.” “Fair,” James shrugs his shoulders and nods. “I get that. I admire it, even. I don’t think I’d be able to stay friends with Reg if he ever broke up with me.” “What if you broke up with him?” “Not likely,” James hums and takes a sip of his beer. Barty drags his eyes over his exposed shoulders and muscular back. He’s always been hot as hell, maybe not Barty’s type, but undeniably attractive. Barty gets it, really. “Never say never,” Barty mumbles into his plastic cup and averts his gaze. James turns to face him, a curious gleam in his eye. Barty tries to ignore the swooping feeling in his stomach. If Evan’s right and Regulus knows about his innocent crush… He’s fucked. James looks suspiciously calm, though. “Right now there’s nothing he could do or say that would make me break it off,” James states in a serious tone. “He could probably come up to me and say he’s murdered someone, and I’d ask him if he needs help disposing of the body.” “That’s so sweet of you,” Barty jeers. “But maybe don’t say shit like that, it’s like you’re tempting fate.” James laughs heartily and wraps his arms around his knees, looking longingly at Regulus’ slender frame emerging from the ocean and climbing up the strip of beach towards them, with Evan in tow. They are both dripping wet, salt crusting over their bodies. They prod and push at each other playfully, and Regulus has a gorgeous blush creeping up his neck and cheeks. The tip of his nose is burnt, the skin flaking off, but somehow, it makes him look even more attractive than usual. Evan gives Barty a warning look over Regulus’ shoulder. Only then he realises he’s been gawking at them shamelessly. Barty swallows, feels his tongue get thick in his mouth. He darts his eyes to the right and catches James’ inquisitive look. Barty swears and tries to hide his face in his cup and behind a freshly rolled cigarette. The four of them watch the sunset in silence, too stunned by the spectacle to utter even a single word. After that, the hum of the sea and the warm evening air stroking their skin lull them into a subdued conversation about everything and nothing. The night is peaceful, tranquil, only the muffled sounds of the nearby town intrude on their little corner of the world. Barty makes a trip to the nearest shop for another wine bottle, and when he’s back, the conversation has steered in a new direction. “It’s not that we mind, really, I’ve heard worse things. But I thought I’d mention it, in case you’d feel uncomfortable.” Barty feels hair stand on the back of his neck. “What are you talking about?” They are veering into dangerous waters and Barty’s not pleased. “I’m letting our dear Regulus know he’s being a little too vocal at times. I bet James is a talented man, but you could try to bite your tongue sometimes, Reggie. Especially when you know there are people next door.” Regulus burns red and sticks his head under James' arm. James coos at him soothingly but there’s an evident smirk on his lips. “I will try to keep it down,” Regulus promises reluctantly, peaking at them through his luscious eyelashes. He catches Barty’s stare and reciprocates with equal intensity, a pointed expression on his pretty face. Barty can feel his cheeks heating up as well. He pulls on the collar of his shirt, his skin prickling with foreboding. “I’ll take part of the blame for that one,” James raised his hand. “Don’t get too cocky, I’m not going to hear the end of it,” Regulus gibes and wiggles in James’ arms, slotting his ass deeper between his parted legs. Barty sips on his drinks and rakes his eyes over Regulus’ long legs, bare and still soaking wet, sand forming a thick layer on his skin and crusting off as Regulus rubs his calves against James’ outstretched leg. Barty grinds his teeth on the edge of his cup, watches as Reg’s toes curl in the sand, the sole of his feet dragging over the coarse grains. “Anyway, I do apologise,” James nods at them, his fingers carding though Regulus thick curls absentmindedly. “Like Evan said,” Barty decides it’s high time he joins in on the conversation and acts as casual as possible. “Not the worst thing I’ve heard, not the worst I’ve done.” Evan barks out a short laugh, face twisting in a mocking grimace. “Please, enlighten us.” Barty stretched out on his towel and stroked his chin, racking his brain. “There was one time I went away with a bunch of friends, and I had to listen to two of them act out a whole roleplaying scene through the thinnest wall possible. It was so bad, I could barely contain my laughter. I’m sure they had a lovely time, but I suffered that night.” Evan sent him a questioning look. “Who was it?” “You don’t know them,” Barty waves a hand at him dismissively.“You think that’s bad,” Evan swirls the cup in his hand and dabs his tongue in the liquid, savouring. The wine was actually not terrible. “I went to this conference last year, with my boss and his mistress.” “Your boss took his mistress to a work conference?” James questions, incredulous expression on his sun kissed face.“Aye, he did. I think he and his wife were already in the midst of a nasty divorce battle, but still... Weird guy. Anyway, we ended up in adjacent rooms, and god almighty, when I tell you I couldn’t sleep three nights in a row it wouldn’t be an exaggeration.”James shakes his head. “What a prick. I’m hoping you told him, right? Or at least went to HR?” Evan smirks under his nose and glances at Barty. Barty knows this story, he waits with bated breath for the rest of it.“I did tell him, and his lover. We were out on the last day, hitting up bars and just kicking about London. It was great, they’re actually lovely people, I had a blast. We had a couple of drinks, and I felt brave enough to insinuate I was more than aware of their nighttime activities. They were surprisingly cool about it.”“And? I feel like there’s more to this story,” Regulus chimes in. “We got talking,” Evan continues with a lecherous smile. “And they asked me if I wanted to join them that night.” James lets out a joyous laugh and Regulus' eyes spark with interest. “Did you?” “Yes, I did. Let’s just say it was a fun night. The girl had the right to be this ridiculously loud, the guy’s tongue was from another planet.” “Your boss’ tongue, you mean?” Barty scoffs. “Yes. He wasn’t my boss for long after that. I started the school business a couple of months later. But we’re still in touch.” James whistles and raises his bottle. “Not bad, Evan, not bad.” “Barty,” Regulus drawls with a wicked smile on his face. “Have you ever had a threesome?” “Nope,” Barty rasps out, desperately trying to avoid Regulus’ gaze. “You’d enjoy it, for sure,” Evan winks at him. “Next time the guy calls, I can ask him if they’re not looking for a fourth.” James grins and hides his face in Regulus’ curls, and Barty swallows audibly. “Please, don’t,” he says levelly, doing a decent job at disguising the tremble in his voice.“What about you two?” Evan points his chin at the couple. Regulus purses his lips but remains silent. James spills immediately. “ I have had the pleasure, more than once.” “Do tell,” Evan spurs him on and Barty’s ears perk up. “In my last relationship, we’ve done it with some friends and a couple of random hookups. It was great.” ‘With friends? Isn’t that risky?” Evan probes further while casting a funny look at Regulus. Barty risks a quick glance himself. Regulus' stone expression indicates he’s not enjoying the current topic of conversation, but he doesn’t intercede. James’ nimble fingers stroke his neck and the line of his jaw as he continues. “Yeah, it was risky. We ended up cutting the ties with one of them, but it wasn’t really due to the sex. We had other differences.” “That previous partner you did all that with, was that Lily?”James nods. Regulus twitches in James’ arms and scrunches his nose. “Sorry, baby,” James noses his cheek and places a chaste kiss on his temple. “It’s fine, we’re just talking. You’re allowed to talk about your exes.” Regulus spits out, but his cold eyes seem to be telling a different story. “So, it would seem we’ve all done some stuff,” Evan seamlessly shifts the topic of conversation and Regulus visibly relaxes. “What’s something you’ve not done but want to do?”“You’re just full of delightful questions today,” Barty sneers and sparks another fag. “I guess a threesome would be nice. I tend to just go with the flow. There’s not much I’d say no to.” James presses his lips together, his jaw twitching. He’s obviously trying to hold in a smirk, and Barty doesn’t know what to think of that. Regulus doesn’t lift his head, but there’s something akin to glee flashing in his grey eyes. Barty’s utterly confused by this point. “Yeah, you’re a depraved motherfucker, that’s about right,” Evan muses and earns himself a slap on the back of his head. “I always wanted to do it with two girls at once. And I’m curious to know how it feels to get dominated by a woman.” “It’s delightful,” James declares with joy. Regulus' eyes flash dangerously and he elbows him in the ribs. James lets out a pained moan. “Ah, sorry, baby.” “You’re so whipped,” Evan murmurs under his breath but doesn’t press for details. “What about you, Reggie? What deep and dark fantasies do you entertain?” There’s a crack of electricity in the air, Barty swears it. The atmosphere shifts, James gets serious and Regulus straightens up, lifts his chin and turns to look at James expectantly. Barty has no idea what awaits them around the metaphorical corner. It most assuredly is not the confession that spills not from Regulus’ but James’ lips. “Regulus has a little fantasy he shared with me recently,” James starts, hand sneaking up to Reg’s waist and squeezing reassuringly. “He’s never had a threesome. But that’s not really what he’s looking for either.” Barty and Evan exchange bewildered looks. “Mate,” Evan butts in, his brows furrowed. “He is sitting right there. Can’t you speak, Reggie?” Regulus darts his gaze towards Evan but his lips remain sealed. He twists his neck and hides his face in the dip of James’ throat. James hums approvingly and strokes his ruffled hair.“That’s right darling,” he breathes out, almost whispers into Regulus’ ear. Barty can see a visible tremor run through Reg’s body. He rubs his feet together, his toes digging into the sand. Barty swallows audibly. “Reggie asked me to share this one. He doesn’t want to speak. He wants to sit here, quietly, and just... enjoy himself.” “Okay,” Evan looks intrigued now. Barty is lapping up every word that falls from James’ mouth. “We’re very open about what floats our boat, so to speak. The things that Regulus hides in this pretty head of his. As soon as we felt comfortable around each other, he shared this little fantasy with me. I had to mull it over, I admit, but ultimately, I’m on board.” “Fucking hell, you’re keeping us on the edge of our seats. Just come out and say it,” Barty spurs him on. If he doesn’t find out what Regulus wants he’s going to combust. James takes a deep breath. “There’s one particular need I can’t satisfy, or rather, I need some help in order to fully satisfy it.” Evan’s jaw drops, but Barty’s brain is hazy, he’s not caught on yet. “Reggie would like to get fucked by other people, under my supervision,” James finally says and breathes out, his jaw clenching. The hand that rests on Regulus’ waist squeezes hard, nails biting into the skin. Regulus squirms and lets out a startled gasp into James’ neck. Barty gapes at them, saliva pooling in his mouth. Evan lets out a nervous giggle and swallows audibly, rubs the bridge of his nose before he even attempts to speak. “That’s interesting. Are you, ah, actively trying to look for someone to join you?” “Yes,” James minces his words, and Barty has had enough. He has to hear it, James has to spell it out for him before he goes insane. “And how is that going for you?” Evan prods.“No idea,” James raises his eyebrows at him, and then at Barty. “You tell me.” “You’re serious?” Evan is sitting up straight now, his plastic cup abandoned, wine dripping out and soaking into the sand. “Are you asking for what I think you’re asking? Regulus?”James clicks his tongue and shakes his head. “Don’t address him directly.” Barty feels lightheaded. The world around him tips to the side, his hands get clammy and his mouth dry as the sand they’re sitting on. His dick must be half hard by now, straining against his swim trunks. He has to lean forward and surreptitiously place his palms in his lap to disguise it. Evan’s not doing any better judging by his tense shoulders. “Is that part of the play?” “Yes,” James caresses Reg’s arm, all the way down to his elbow, with such delectable fondness and tenderness. As if he hasn’t just divulged the details of how his boyfriend wants to get fucked while he watches and directs the scene. Barty has to actively tell himself to take in another breath, otherwise he’d suffocate. For a second, James looks sheepish. He glances down at Regulus, who lifts his chin and noses his neck, murmurs something, too quietly for Barty to catch. James’ eyes glimmer in the night lights. His expression shifts and when he turns to them again, he’s determined.Evan is the one to break the silent spell.“You want us to join you? I’m sorry if I’m being Mister Obvious here, but I want to hear it loud and clear.” “Yes,” James nods, his grip on Regulus’ arm tightening. Evan and Barty exchange a fleeting glance. “Wouldn’t that… be risky? We’re friends, all of us here. You just said that doing it with friends is not always the best idea.” “Reg and I discussed it. We think out of all the people you two are the best candidates. I believe we can handle it.”James gestures towards Reg, who’s still cozied up under his arm, his eyes boring into James in reverence. A spike of jealousy runs through Barty, but it’s short-lived, transient. He’s made his peace with the fact that Regulus is unattainable. Now, fate has decided to grant him a chance to learn what he’ll feel like under his wandering hands, how he’ll squirm and writhe, how he’ll moan his name when Barty makes him come, same as he does for James. Maybe not the same, but it’s close enough. Beggars can’t be choosers. Barty gears himself up to speak but he’s only able to utter an incoherent grunt. “I’m game,” Evan beats him to the punch. Barty exhales loudly, relief washing over him. They will do this together. Them against the world, in everything, including shagging their friends, apparently. “Splendid,” James beams at them. He’s the picture of innocence, utterly inappropriate considering the circumstances. “What about you, Barty?” “I think you know the answer to that question,” he manages to rasp out, words struggling to crawl out of his throat. He coughs into his arm, eyes skipping over James’s delighted grin and down towards Regulus. Look at me , Barty implores silently. He wants Regulus to acknowledge him, acknowledge what he’s just asked them to do. Regulus doesn’t budge. He only has eyes for James. Barty grinds his teeth. He can handle this, he’s a big boy. He can fuck one of his best friends while taking direct orders from his boyfriend, and then walk away unbothered and unchanged. Sure, he can. “Great,” James puffs his chest out proudly. Barty almost rolls his eyes. It was downright pathetic at times, how far James was willing to go for Regulus. He briefly wonders if this is all Regulus’ idea and James is a rather unwilling accomplice. But no, that can’t be it. James is eager and animated, aroused even. He steps into the role like he was born for it. “We have to set some ground rules first. Like I said, this is a fantasy that we’re trying to tick off the list. This doesn’t carry over to our everyday life. And you’re right, Evan, that kind of shit can ruin friendships, so if at any point you feel like you want to tap out, you say it and you leave. Understood?” Evan and Barty nod and lean towards James, soaking up every word. Barty almost plants face first into the sand, but catches himself at the last second.“I have to hear you say it,” James implores. “Yes,” they both exclaim in chorus. “Great. Now, safe words. We’ve been using them for a while, and they’ve done a decent job. It’s simple - green is for enthusiastic consent, yellow signifies that we might be edging towards a potential hard limit, but we can continue. Red means you cut it out immediately. Is that clear?” “Couldn’t have been clearer,” Evan raises his thumbs and Barty hums in approval. “Next, this is Reggie’s play. It might seem like he’s not the one in control, and for the purpose of the scene, he’s not. We’ve discussed this and he trusts me. He can always back out if he feels like it. I have the intimate knowledge of what will fly and what won’t. You can ask for anything your heart may desire, and I can agree or knock it back. You don’t have to limit yourself, but remember that your wish might be declined.” Barty’s mind is swimming. James’ words reach him and pierce through his thick skull, but he feels like he’s sitting behind a wall, or a film of some sorts, that’s muffling the sound and forcing Barty to work excessively hard to digest the instructions. He can ask for anything, and his wish might be granted. He’s fearful of what dark fantasies his mind might concoct. “Any hard limits we should not even mention?” Evan asks. He seems unruffled. Decidedly more relaxed than Barty, his laid-back attitude paying off even in the most unusual of circumstances. “Nope, you go for it, I will tell you if it's green or red. If Regulus doesn’t agree with my directions, he can use the safeword.” “You’ve really put a lot of thought into it,” Evan is visibly impressed, dazzled even, by this whole idea. The initial shock dissipates and he’s verging on giddy when he tilts his head and bores his eyes into Regulus. “And what about the rule of not being able to address his highness directly? I feel like we might need a tad more here. Don’t want to cross any of your precious boundaries.” James stokes Reg’s bony shoulder with his thumb as he explains. “Right, you can’t. You can interact with him while you’re engaging in… sex. But don’t ask him if you can do this or that, ask me. You can engage with him, and with each other, that's a given. But Regulus should remain the focus of the scene, at all times.” “You’re really getting off on this, don’t you?” Barty scoffs at Regulus. He doesn’t mean to sound curt, and James jumps down his throat immediately. “Don’t,” he warns, brows furrowing, “address him directly. You can ask me the same question. And yes, he is getting off on that. You’re not any different, I reckon.” He points his head at Barty’s crotch and smirks. Barty turns red as a beet and hides his face in his shoulder, and Evan snorts into his freshly filled cup. “Once again,” James puts them in their place with a stern face. “If you don’t feel comfortable with these rules, tap out now. If at any point you start feeling uncomfortable, you do that as well. Don’t disappoint me, and especially, don’t disappoint Regulus.” Regulus quivers in James’ strong embrace and Barty twitches violently when another shiver runs down the length of his spine and straight to his half-hard dick. “I have one more question,” Evan scratches his nose and smiles politely at James, as if they’re discussing the weather. “I get that you’re the authority, and we should ask you for your permission, so I’m asking. We can’t direct our questions at Regulus, but can we… address him in the throes of passion?” Evan looks smug when he adds, “Can I praise him or tell him what a good boy he is? Can I throw in some dirty talk, maybe a couple of degrading words here and there?”“That’s allowed,” James murmurs and bites his lip, hard. “Reggie enjoys that, immensely.”  “Oh, I know he does!” Evan snorts and downs the rest of his wine. “We had a distinct pleasure of listening to your esteemed performance in the last week, not once, and not twice. I want to say…” “Many times,” Barty interrupts. “That’s some vocabulary you have, James.” “Thanks, I guess?” James grins at them, showing off his white teeth.“Right, I think we should… head to the hotel, then?” Evan shakes the sand off his trunks and starts packing their swimming gear, half finished bottle of wine tucked under his arm. “If we don’t go now I think poor Barty will get an aneurysm.” Barty growls at him and jumps to his feet, his backpack strategically placed on his crotch. James places another soft kiss on Reg’s ruffled curls and pulls him up gingerly. Regulus is like putty in his hands. Barty’s in a constant state of haze on their way back. Regulus and James walk in front of them, arms wrapped around each other like tendrils.Barty gapes, rakes his eyes over their figures bathed in streetlamp light. He can see a sliver of skin just above Regulus’ trunks, coarse sand still sticking to his pale skin and flaking off as James rubs his thumb over his hip. “Barty, you’re with me?” Evan nudges him in the shoulder as they walk back to the hotel, a jump in their step that Barty thinks must be conspicuous enough that all the passersby know they’re going back to the hotel for a foursome. “Yeah, what’s up?”“Are you sure you want to do this?” “Are you insane? Of course I do,” he croaks and clears his throat. Too eager. “I know you want to fuck him, I’m not an idiot,” Evan concurs with a slight irritation in his voice. “I am just questioning whether you’d be able to function after the scene ends. Did you listen to what James said? This does not extend outside of the bedroom, and outside of this day even. Next morning we wake up and it’s over. It’s very likely they will never make the same offer again.” “I know,” Barty spits out through clamped teeth. “And I am fine with it. Are you?” “I know I am,” Evan huffs and rolls his eyes. “I’m trying to take care of you, you numpty.” “I appreciate that, really. I’ll be fine.” “Good,” Evan concedes and brightens up. “Don’t come to me crying if it doesn’t end well for you. I mean, do come to me crying if you feel like it. I’m still your friend. But I’ll be able to say  I told you so !” Barty doesn’t respond and Evan graciously doesn’t mock him further. “Anyway,” they reach the hotel and climb up the staircase to their suite. The elevator was packed and James and Reg took up all the available space. “I did not expect the night to go like this. Did you?” “No,” Barty fishes out his key card and slides it through the slit in the door. They slip into the apartment and find James and Regulus already there, sprawled on Barty’s bed. “Give us ten minutes,” James points his head towards their room and takes Reg by the hand. “We’re just going to have a little chat and I’ll invite you when we’re ready. I suggest you shower, we’ll do the same.” “Right,” Barty rubs his clammy palms together. “Evan?” “Sure,” Even throws a fresh towel at Barty’s head and careens towards the bathroom. Barty follows. It is the speediest shower Barty has ever taken, and Evan is not far behind. He’s thorough but not indulgent. His dick won’t go down, which Evan finds hysterical for some reason.“Want me to get you off before we go in?” he jeers and licks his lips in a mocking gesture. “Fuck off,” Barty grumbles as he pulls on a fresh shirt and boxers. They sit on the bed, criss-cross, both tapping their hands on their knees in anticipation. A thought flashes through Barty’s mind, a sudden doubt, a crippling fear that activates when you know you’ve made a mistake but there’s no going back now. Evan brushes his knee with his fingers and squeezes reassuringly. “You can back out.”“I can’t,” Barty takes a calming breath, counting to three. “I have to have him. I have to know.” “Healthy,” murmurs Evan and he goes back to watching the door.“How are you always so self-possessed?” Barty snarls, but before he has a chance to hear the answer, James shoots through the door. His hair is dripping wet and he’s got a fresh set of clothes on. Evan shamelessly checks him out.“Can I just ask, what do you get out of it? I got the impression Reg is the driving force behind this whole idea?” “Oh, don’t worry, I’ll get my fill,” James returns his gaze head on. They follow James into the room. Barty’s heart is threatening to beat out of his chest. The moment they step inside, all his blood drains south. Regulus is kneeling on the floor, knees splayed open and his naked ass brushing the carpet. He’s clasped his fingers behind his back and his back is arched, chin lifted. He risks a quick glance in their direction and Barty can almost hear his pulse quicken, his chest now rising in an uneven rhythm. Barty latches his eyes to his hard, pink, nipples and he wants to crawl on his knees and swirl his tongue over the pink glands. He wants to suck hard and bite, test the boundaries of what Regulus can take. He knows he has to wait his turn. They halt at the entrance, both him and Evan looking at James expectantly. “How are we, Reggie?” James hums and saunters closer, cups his cheeks in his palm and strokes his bottom lip tenderly with the tip of his thumb. Regulus parts his lips, lets him slide the thumb into his mouth. He suckles on it, moans quietly. Barty’s eyes dart to the space between his spread knees, where his cock twitches to life and rubs on James’ leg. Barty swallows, wipes his forehead with the back of his hand. He is rock hard now, blood thrumming in his veins. To his right, Evan sucks in a loud breath and jerks closer. “Green,” Regulus mumbles around James’ thumb, his pink tongue darting out and swiping over his neatly trimmed nails. James retreats and Regulus whines quietly at the loss, rubs off the drool that trickles down his chin on his shoulder. He straightens out, his unseeing eyes bouncing back to James’ face. “Good,” James purrs out his praise, and Regulus melts, his knees sliding further apart. “It’s your turn now. What do you want to do?” He swirls around and his eyes land on Barty and Evan, who are both hyperventilating on the other side of the room. Evan gives him a heads start and waits patiently, but Barty’s words get lodged in his throat. Evan comes to his rescue, as is his nature. “Can you show him off?” Barty's eyes go wide but Evan doesn’t falter. He drawls on, his pupils going dark. “Get him on the bed and spread his legs. I want to see what he’s got to offer.” Barty’s cheeks are flaming red, and he is not the only one. Regulus lets out a choked moan and grinds on the carpet, his dick chafing on the course fibres. James and Evan exchange a burning look, a thread of understanding forming between them. There’s appreciation and mutual respect in there, and Barty seethes, jealousy curling around his heart. There’s not enough time for him to stew in that feeling; he’s promptly distracted by James dragging Regulus up to his feet by sliding his fingers into his hair and pulling gently. “That’s right,” James encourages and pulls him closer. Reg’s now standing on his two feet, thighs visibly trembling, back still arched and hands clasped behind his back. James places a wet kiss alongside his jaw, pinches the skin with his teeth. “Reggie, I’m going to sit down and you’re going to come to me when I call,” James commands, takes a step back and edges towards the bed. Regulus stays put. “Can I touch him?” Evan blurts out, while his fingers are working the top button of his shirt. “Before?” “Yes,” James throws himself on the pillows, posture relaxed. He spread his legs slightly, in preparation to receive Regulus’ pliant body. Barty watches with rapt fascination as Evan strolls towards the centre of the room and stands in front of Regulus, his breath ghosting over his face. His shirt is unbuttoned now, and he shakes it off carelessly. He reaches out and strokes Reg’s collarbone, his fingers dipping into the skin. He gradually edges down, takes in a sharp breath when the tip of his fingers catches on his stomach and brushes through the thick thatch of black hair trailing towards Reg’s crotch. Regulus mewls quietly and shivers, the muscles of his thighs straining as he tries to hold still.Barty floats towards them, coming to a halt when he’s close enough to witness Evan wrap his fingers around Regulus’ half-hard cock. Everyone in the room utters a quiet gasp when Regulus goes rigid under the touch, thrust his hips forward and parts his lips, invitingly. Evan swallows and rasps out, “Can I kiss him?” “Blanket permission to kiss him,” James’ voice seems distant, steady and strong amongst their hitched breathing and pounding hearts. Evan lunges forward and captures Reg’s mouth in a searing kiss, nips on the bottom lip and pushes his tongue in. Regulus melts under his touch, his hips setting on a steady rhythm. Evan gives back, drags his thumb over the head and strokes harder, earning himself a broken moan, uttered right into his open mouth. “Fuck’s sake,” Barty’s rubs his eyes, still not entirely sure he’s not hallucinating. “That’s plenty,” James beckons at them and tilts his head to the side. “You don’t want to make him come too soon. He can bounce back, but enough is enough. He’s not earned it.” Evan drags the flat of his tongue over Regulus’ bottom lip and lets go of his cock. Regulus chases after him, stumbles forward. Evan gently nudges him towards the bed. “On you go, hop on.” Regulus stares at him blankly, mouth still parted and then… He drops to his knees and starts crawling on all fours towards the bed, his ass on full display. Barty’s fingers itch to reach out and caress his pale skin, the bend of his back and the dip between his cheeks. Regulus climbs on the bed and drags his body over the bed sheets, rubs his straining cock on the duvet, leaving a glistening trail of precum behind. A flicker of impatience runs through James’ face. He bites his nails in Reg’s jaw and drags him closer, lifting him off the sheets. He flips him around and guides him to lay between his spread legs, his back flush to his chest. “You’re so impatient,” James drags his lips over his earlobe and grazes the skin under his ear. Regulus shudders in response. “So eager to get off. How many times do you want to come tonight?” Regulus bares his neck. “You decide.”“Let’s see what they come up with then,” James quips and glances at Evan, and then at Barty, a glint of challenge in his eyes. “Blanket permission to come.” Evan’s face stretches in a wide grin. He kneels on on the bed, the springs creaking under their combined weight. “Come now, Reggie. I want to see it. Spread your legs for me,” he taunts. James’ hands slide under the bend of Regulus’ clenched knees. “Come on, baby, show them,” he puts pressure on the soft skin, nails biting into the flesh. He spreads Regulus’ legs wide, relishes in the way his pliant body slumps against his chest.Barty clasps a hand over his mouth to muffle a loud groan; Evan is not as guarded as him and lets out a breathless fuck, his eyes raking over Regulus’ hard cock bouncing on his stomach, the white skin peppered with fine hair, and the pink, puckered hole. “So hot,” Evan chokes out. “I can’t wait to come inside you. James, can you open him up for me?” James already has a bottle of lube in his hands. He squirts an obscenely large amount into his palm. “They want to see, so let’s show them,” James nips at Regulus’ jaw, distracting him, while his hand slides between his legs and cusps his balls, then slides lower and prods at the entrance. Regulus writhes in his grip, arches his back and canters his hips, impaling himself on the index finger. James pushes inside, goes knuckles deep in one swift motion. Barty gasps, his own ass clenching down as if he’s the one being fingered. Evan falls forward and crawls on all fours, his face level with James’. They look at each other, wicked smiles dancing on their lips, a silent conversation taking place. Barty feels cold sweat gathering in the small of his back, but he doesn’t know how to make himself act, how to engage and seamlessly fit into the scene. “Can I suck him off?” Evan whispers, his lips almost brushing over James' jaw. He’s hovering over Regulus, who’s whimpering softly, now with two fingers up his ass slowly working him open. “Yes,” James nods and yanks his fingers out, wipes the lube in Regulus’ soft curls. Evan dips his head and takes him in, tongue lapping on the head and alongside the shaft. He puffs his cheeks and sucks hard and Barty feels a spark of pleasure shoot through him at the memory of that same skilled tongue dragging over his dick merely days ago. Regulus sings under Evan, sweet, broken moans spilling out of his wet lips. His palms clasp on James’ thick thighs, nails digging in painfully. James hisses but doesn’t push him off. “Evan,” James is breathing fast now. Barty’s convinced that Reg’s riding his hard cock right now, must be grinding back on it. He can imagine the clothed head sliding over the cleft of his ass. “Do what you want to him. I’ll tell you if you should stop.” Evan is ravenous. He doesn’t stop at the dick in his mouth, he licks on the balls and nips the skin with his teeth, Reg jerking under him and crying out in elation. He drags his tongue over the taint and dips it into his hole. James hand is now stroking Regulus to the same rhythm that Evan’s tongue is fucking into him. It’s rushed and hard. They’re not giving Regulus a chance to protest or warn them. Regulus goes rigid, thighs shaking around Evan’s head, and comes all over his flat belly and James’ fingers. “Fuck, you taste good.” Evan emerges from between his legs, wipes his lips with the back of his hand, eyes. He meets James stare. “Blanket permission to kiss, you say?” he taunts and then he dips down again, laps up Regulus’ come and then captures James’ lips in a searing kiss. Barty can see the streaks of come trickling down James' jaw. They’re both panting hard.  You’d think they just came, and not Regulus, who’s still struggling to catch his breath crushed under Evan’s heaving chest. ‘Fucking hell,” James lets out a started laugh, “You’re lucky I liked it. I didn’t give you permission to kiss me.” “Sorry,” Evan sits back on his haunches and has the decency to look contrite. “Won’t happen again.”“Apology accepted,” James hums and pats Regulus’ on the shoulder. “Get up.” Evan jumps back, letting Regulus crawl forward on the bed, ass up. James slaps him playfully and turns his attention towards Barty. “You’re being awfully quiet,” he teases, raising an eyebrow at him. “What do you want?” “I think Barty might need some directions,” Evan chimes in innocently and winks at him. “I…” Barty stammers and rakes a hand through his hair anxiously. “Maybe?” “Stand here,” James points to the foot of the bed, right where Regulus’ was just crawling towards, his ass up in the air and thighs splayed wide on the crumpled sheets. “Reggie, darling. Can you do me a favour and suck Barty off? But don’t you dare put that ass down. We’re going to play with it while he comes down your throat. Is that ok?” Regulus whines into the duvet. “Green.” Barty finds himself standing at the foot of the bed, his legs trembling, with Regulus deft fingers dipping under the waistband of his shorts. Evan’s at his side. He helps get his cock out, while trailing a kiss down Barty’s neck. “Come on, relax a bit. Look who’s opening their pretty mouth for you?” he says while placing the tip of his cock on Regulus’ bottom lip. Precum leaks down his chin and dribbles onto the sheets.Regulus murmurs contently and sticks his tongue out, licks the rest of the precum off the tip, then cleans his stained lips by pressing them to the inside of Barty’s thigh. Barty lets out a string of curses, pinches himself hard at the base. “Can I fuck his face?” Barty is ready to make his wish. \n Can I fuck his impudent, absurdly beautiful face, and these plump lips, and slide over that pink tongue that’s now lapping on his head eagerly?  \n“Do your worst,” James nods and turns to Evan. “I think you should also fuck him, just not his face. Fuck his ass.” Barty bristles at the thought of Evan getting to put his dick in that tight ass first, but then Regulus takes him in whole, his lips stretching around his girth. The tip hits the back of his throat. Barty yanks Regulus by the hair, eliciting a pained moan, its vibrations running down his length and straight to the pit of his stomach. In the corner of his eye he sees Evan position himself behind Regulus, now naked, slotting his thick dick between Regulus’ thighs. He knows James is sitting to his left, watching like a hawk. Barty thrusts in and grabs Regulus beneath his chin, feeling out the shape of his cock through the fine skin. “How do you fit it all in?” he marvels and then punches in hard. Regulus gags, spits on himself. Barty flickers his eyes to James in a silent question. “He’s fine,” he assures. “We have a way to signal the safeword if he can’t speak.” Evan chooses that moment to pull his lube coated fingers from Regulus’ ass and slide his dick over his gaping hole. “You ready?” he pats Regulus’ on the back. The only answer they get is a silent whimper. Evan pushes in, and Barty does the same, skewering Regulus on both ends, trapped and helpless, but so deliciously responsive. Barty’s envious. More envious than he’s ever been of James, or anyone. The inside of Regulus’ mouth is soft and spongy. The scorching heat that envelopes him and swallows him whole with every thrust makes his insides churn. Teeth catch on the veiny underside, and Barty hisses, yanks Regulus by the hair. He mewls an apology and coughs around him, his throat spasming. Evan groans and spits out a couple of incoherent words, then grabs Regulus by the hips, drags him back, impaling him on his cock, turning him into a living fleshlight. Regulus lets them, his throat going slack, his thighs opening up further. Barty supposes that Regulus’ cock must be hard again. He’s dreaming about what he will do to it after he comes in the back of his throat. He knows he’d be the first to tumble over the edge. He grinds his hips and bites through his lip when he expels what feels like excessive amounts of come onto the waiting tongue. Barty yanks Regulus’ head back and before he’s done coming, he slides out from between his parted lips and paints his chin and flushed cheeks with white, glistening streaks. Evan watches with wide eyes as Barty smears the come all over freckles cheeks and chokes out a broken moan as he seats himself deep inside and fucks his come inside Regulus’ hole.It’s a bit of a blur, after that. Barty feels a levee break with that first orgasm. He mumbles out his next wish, and James abides. He flips Regulus' boneless body on his back and grabs him under the knee, spreading his legs wide. As he suspected, he is hard again. It looks painful, straining against his sticky stomach, the head swollen and dark red. Barty has to know what it feels like in his mouth. He laps on it, cleans him thoroughly. Regulus cries under him, cants his hips up in search of friction. Barty is not paying attention to what James and Evan are doing, his mind wrapped up in Regulus, his smell, his breathy moans, his clenched thighs. He pushes his finger inside his stretched hole, one and then another. Evan’s come serves better than lube. It squelches obscenely around his fingers.His dick fills out in minutes of just doing that, just sucking on every visible part of Regulus’ compliant body and fingering him at a brutal pace. When he’s ready he hovers over Regulus, takes a steadying breath. Looks him in the eye. Regulus is not there, it would seem. Some newly born creature, a lustful demon with eyes black as night and lips blood red, lures him in to take the bait. “Fuck me,” the demon pleads and lift its shaking fingers to his face, strokes his chin tenderly. Barty splits him open, fucks into the mess that Evan’s left inside. He punches in deep, grinds his hips down. Regulus squeals under him, presses his cheek into the pillow to muffle his beautiful screams. Barty admits he’s lost any semblance of control. He’s rutting into him, teeth at the base of his neck, string of moans escaping his lips with every drag of his dick over his raw insides. Regulus clenches around him and Barty comes for the second time, uses him to empty himself, like it’s all he’s there for. The thought that his come melds with Evan’s and fills him to the brim satisfies some dark, bone-deep need Barty didn’t realise he had. His thighs are shaking so badly he’s barely able to pull out and topple to the side. He’s still catching his breath when Evan leans over him and lets out an amused chuckle. “You really went to town,” he gives a quick glance at Regulus, who’s not moved and is now cupping his hole, creating a barrier with his fingers to stop the come from leaking out. “Come on, your turn is over. Get up.”With Evan’s help, Barty rolls off the bed and manages to stand up. A clink of a metal buckle and a ruffling of fabric is what makes him look up from Regulus’ trembling body and back to the foot of the bed. James throws his shirt to the side and kicks off his trousers. Barty gapes at his cock, mouth salivating. James is hung, and already hard. He strokes the head of his cock, breathing through his nose. He must have been watching them. What was he thinking, or feeling? “Jamie,” Reg’s toes curl on the sheet. He spreads his knees further, and then slowly withdraws his fingers, putting his puffy and abused hole on display. Come is leaking down the cleft of his ass and onto the white sheets, it’s sticking to the black hair and the pale insides of his thighs. “Perfect,” James grabs him by the ankles and hauls him closer. Barty watches entranced as he slots between Regulus waiting legs and fucks into him in one violent push. They can all hear the squelch. The come oozes out, dribbles onto James’ skin. James huffs in effort and grinds his hips down. They moan in tandem. He peppers Regulus’ slender neck with kisses, then his ears, then the sweaty skin under his jawline. “God,” he croaks and ruts against Regulus, who wriggles under him and fists the sheets. “You feel so good. So loose, fucking hell, it’s never felt like that.” Regulus comes with an almost surprised gasp, his heels digging into James’ back. Barty recalls the feeling of Regulus’ ass clenching around him, and he covets. He bores his eyes into James’ back as he convulses in Regulus’ arms, fills him up to the brim, pushing their come out with his own. Barty gets it now. He understands, finally, what James is getting out of the scene.  “Dirty fucker,” Evan gasps with admiration. Barty grits his teeth and grabs him by the elbow, pulls him towards the exit. “Hey, what the fuck,” Evan protests. “The show’s not over.” “Yes, it is,” James rolls over onto his back. Barty blushes when he sees his cock, covered in sticky come from the swollen tip to the base. “Hope you enjoyed yourself.” Evan barks out a laugh. “Fucking hell, yeah, I know I have!” Regulus has not attempted to move. He’s playing with the come, dragging his fingers over his stretched hole, dipping them in curiously. “I’ve got to take a shower,” Barty can feel the sweat drying on his skin. He slips his boxers on and hands Evan the other pair. “That’s fair,” James has his eyes closed. Barty jaw drops to the floor when Regulus smears the come he’s dug out of himself on James’ hip and giggles. Evan coughs lightly. “Right, time for us to go.” “Let’s hope breakfast is not going to be too awkward,” Regulus adds just as they’re about to slip out of the room. Evan cackles loudly and Barty rolls his eyes.",
	"45744394000": "Pandora awoke with a jolt.\nIt was the middle of the night, the dim light from the moon only illuminated a small part of the room. Her body was moist, soaked in sweat, and she felt the long blond curls sticking to her forehead and neck.\nIt had happened again. It hadn’t happened for so long that she was actually starting to worry, you never know she was healed magically from her condition!\n\"It happens to you because you’re special Panda, you’ve been chosen,\" said her mother, with a feeble voice and eyes full of tears, perhaps of joy, perhaps of sadness, Pandora had never understood.\nThe dream, or better to say nightmare, was always the same: she got up from bed, struggling to drag her weight to the last door of the corridor where her older brother Rabastan slept.\nThe journey seemed longer and longer, and the corridor darker than ever. Pandora was afraid of the dark, she didn’t like the feeling of being wrapped in a dark blanket.\nShe felt sinking, as if that darkness had the same consistency as honey, saturated and sticky. She wrapped her small hand around the door handle and pushed slowly, peering through the small crack that had formed.\n«Rab? Are you awake?» she whispered.\nRabastan was the brother she trusted the most, he was good at braiding and he always played with her at dolls. He always knew what to do whenever Pandora had one of her episodes. Moreover, Rabastan did not have the thick eyebrows that Rodolphus had, which made him look like a grumpy bear.\n«Rabby?» Pandora called her brother again, shaking his arm.\nSomething was wrong. His brother was cold, turned to his left side. He didn’t seem to move, he almost looked... No. Pandora knew death all too well, she saw it right in its face the day her parents were killed. Rabastan was just sleeping.\nFrustrated, she used all the strength she had to turn her brother’s body. She heard a scream, was there a girl screaming? Why was she screaming? Who was with them? Besides her and her two older brothers no one else lived in that house.\nRabastan stood there, his skin bluish , mouth wide open and face twisted. In the meantime , her brother Rodolphus had woken up. He immediately ran to embrace her, holding her so tightly causing her to look away from that terrifying sight.\nIf she focused enough, she could still feel the fabric of her brother’s pyjamas rubbing against her face as he rocked her and whispered repeatedly in her ear that everything was fine.\nBut Pandora, although she was small, understood that it was, in fact, not well.\nHer parents were not well, her brother Rabastan was not well, the person who had screamed was not well.\nIt took her years to realise that that night the scream came from her.",
	"45744364000": "She had always loved reading.\n\nLoved learning and exploring as the words morphed into images in her mind like puzzle pieces clicking into place. Hermione’s entire existence was based on the verses and paragraphs that she consumed at an abnormally quick rate. Her above average reading level earned her praise from her teachers and parents but made her somewhat of an outcast in grade school as the kids her age didn’t understand her. She preferred the library while they favored braiding hair or playing games outside.\n\nShe didn’t consider her childhood to be lonely, even though her parents were quite busy running their dental practice and were scarcely home, she had never minded as she found comfort and companionship with the characters and authors between the spines and pages that her eyes danced across.\n\nHer love for books and knowledge increased exponentially when she received her letter from Hogwarts. Hermione decided that she would do her absolute best to fit in to her new world. Which of course in her mind meant that she needed to read everything she could get her hands on about magic so that she wouldn’t seem silly or lost. Not only was she curious and excited to embrace something wholly unknown to her, but she also felt a deep need to compensate for being muggle-born, a term that had slowly started to itch at her skin the more she saw it in her research.\n\nIt took some time but eventually she had made some friends. Two boys who relied on her love for books, intelligence and analytical skills. Most days she wasn’t sure how Harry and Ron had managed to make it to the end of the week alive... their proclivity for stumbling upon and getting into trouble and their complete disregard for their grades was truly astonishing.\n\nWhile Harry was strong, courageous and bold, he had the tendency to be denser than the cake served in her parent’s favorite muggle cafe. And Ron was, well, he was Ron. He tended to be the more emotionally reactive one of their trio. She didn’t blame or fault either of them for who they were just as they accepted her for her more reserved studious nature.\n\nOver the years she learned to brush off the dirty blood slurs fired her way from her peers, more specifically, a boy with the silkiest blonde hair she had ever seen. She accepted the sneers of other students when they called her ‘the golden girl’ or ‘the brightest witch of their age’ with a mild smile on her face as if she hadn’t just been verbally slapped for basically being called an ‘insufferable know it all’. It wasn’t what she set out to be but nonetheless it became required and expected of her.\n\nCompleting an eighth year at Hogwarts was not common, and by not common, she had read that it was practically unheard of.\n\nShe had missed so much learning while on the hunt for Horcruxes with Harry and Ron. Missed so much time being ordinary teenage witch and doing what every other student had done their senior years. She didn’t regret her friendship with the boys at all! But something was missing. Almost as if a chapter had been ripped out of the book that was her life.\n\nSo, for the first time, Hermione elected to take the unstudied and unexpected route. She was going to return to Hogwarts instead of accepting a position at the ministry like her friends and almost every other witch or wizard who had survived the previous year. If she really was to become ‘the brightest witch of their age’ she believed she needed to finish her education and maybe while she was there she would learn how to be her own person separate from Harry and Ron again.\n\nHaving the details already worked out with McGonagall, she made the announcement of her plan to attend an eighth year during a post-war interview with the Prophet in the middle of the summer. She was standing in her small room at Grimmauld place reading the published statement with a small smile on her face when a group of owls flocking to her window startled her enough to drop the paper.\n\nHermione couldn’t believe the words scrawled on the notes she had received from the birds. One after another stating that she wouldn’t be alone in her eighth year. She sat gingerly on the corner of her bed and read through them all again.\n\nLuna and Neville had decided to join her upon reading her interview claiming they both wanted a do-over and their time at Hogwarts didn’t feel complete. Ginny of course would be returning as it was her seventh year and she couldn’t be happier to hear that they would get more time together away from the boys and their mischief. A few Hufflepuffs and Ravenclaws that she had studied regularly with in the library also jumped on the wagon to return upon hearing that there would be others.\n\nThe summer seemed to fly by after that in a mass of dreadfully hot days and random lunch dates with the boys.\n\nShe was just stepping on to the platform for the Hogwarts Express and began moving in the direction of her usual car when she saw them. Ginny ran into her from behind due to her quick stop after crossing through the passageway causing her to stumble forward a bit awkwardly.\n\n“Hermione what in the bloody he-” Ginny hissed.\n\nIt took one glance in the direction that held Hermione captive and then Ginny was quickly whispering the news her father had brought home from the ministry the night before in her ear.\n\nThey were to return as some sort of slap on the wrist punishment for their involvement with the Dark Lord and his cause... the Ministry had deemed Azkaban too harsh a punishment for their age. She nodded mutely and started slow careful steps towards the humming train. She agreed that Azkaban was too much, but she was now doubting her choice of taking an eighth year.\n\nShe had secluded herself in Harry’s unused Grimmauld place all summer, as he was busy rebuilding the house in Godric’s Hollow, trying to get back to normal… trying so desperately to figure out what she wanted instead of what was expected of her that she had completely forgot about the people who had chosen to fight for the other side. The people she hadn’t seen since they had all been standing in the rubble of their school surrounded by bodies of people they once knew.\n\nThey walked in pairs, floating across the platform as if they owned it, as if nothing had changed. A shaky breath escaped her as she felt Ginny’s fingers lace with hers. Hermione watched them through her lashes, readying herself for any one of the sharp comments that she’d grown used to over the years but they all passed by her silently. No one uttered a word or offered her anything other than a blank facial expression.\n\nPansy Parkinson led their group next to Blaise Zabini, Theodore Nott marched beside Marcus Flint, Astoria Greengrass was shouldering Gregory Goyle, and they were all followed by the boy who had vexed her entire existence since the moment she set eyes on him before the sorting ceremony. Draco Malfoy.\n\nShe remembered feeling the slight blush creep into her cheeks when she saw him first, it was like one of her book characters had come to life, making her feel euphoric. And then he happened to open his mouth.\n\nDraco affected her more than she cared to admit over their shared years at Hogwarts. From making her cry when he called her foul names to inspiring her to punch him straight in the nose one day. It felt good at the time, but it was something her brain had played on repeat when she was unable to sleep lying in bed late at night. But unfortunately, no matter how much he angered her there was always that small unexplainable budding warmth deep within her veins whenever she saw him.\n\n“Come on, let’s go find Neville and Luna.” Ginny urged with a gentle tug on her hand.\n\nHermione looked back watching the crowd of students and parents quickly step out of the way of the Slytherins. She nodded as she swiveled her head back towards Ginny and offered her a small smile.\n\nShe took one more peek over her shoulder catching a glimpse of the tall blonde ducking into a car towards the front. He turned his head at the last second and their eyes connected. Her blood warmed and she shivered before she forced herself to look away.\n\n“Let’s.” She agreed and started moving rather quickly toward their usual car."
}